{"first_name": "Abby Blair", "last_name": "’25", "biography": "Abby graduated from UMF in May 2025 with a degree in Secondary Education, Social Studies. While at UMF, she nurtured her longstanding interest in photography and developed her skills as a student employee in the marketing department. Following graduation, she continued working with the department over the summer and, though initially set on becoming a teacher, found a home combining her passions as a Digital Media Specialist. In this role, she mentors student employees while expressing her creativity and storytelling through photography and social media. Outside of work, Abby loves traveling, attending concerts, and spending time with friends and family. As a former member of UMF’s women’s rugby team, she’s an avid rugby fan and enjoys watching and photographing the sport. Even in her off time, she is still often found behind the camera photographing games, portraits, events, landscapes, and everything in between.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/abby-blair-95/", "emails": ["abbygail.blair@maine.edu"], "phones": ["207-778-7050"], "departments": ["Administrative Staff"], "titles": ["Digital Media Specialist"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Abby", "last_name": "Waceken", "biography": "Abby Waceken, a proud first-generation college student herself, has worked for the UMF Upward program for just over 3 years. In addition to academic counseling, she also runs the program’s social media pages, designs recruitment materials, and teaches the Senior Success Seminar class during the summer program. When not at work, Abby enjoys tap dancing, participating in community theater, and spending time with her adorable kitty, Ethel.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/abby-n-waceken/", "emails": ["abby.waceken@maine.edu"], "phones": ["207-778-7296"], "departments": ["Upward Bound"], "titles": ["Academic Counselor-STEM & Outreach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Adam", "last_name": "Welch", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/adam-r-welch/", "emails": ["awelch@maine.edu"], "phones": ["207-778-7400"], "departments": ["Public Safety"], "titles": ["Police Officer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Adin", "last_name": "Merritt", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/adin-b-merritt/", "emails": ["adin.merritt@maine.edu"], "phones": ["207-778-7863"], "departments": ["Arts & Humanities"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Alannah", "last_name": "Hartford", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/alannah-hartford/", "emails": ["alannah.hartford@maine.edu"], "phones": ["207-778-7056"], "departments": ["Financial Aid"], "titles": ["Admissions and Financial Aid Counselor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Alexa Pelletier", "last_name": "’20", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/alexa-l-pelletier/", "emails": ["alexa.pelletier@maine.edu"], "phones": ["207-778-7090"], "departments": ["University Advancement"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Alexis", "last_name": "Edwards Jr", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/alexis-l-edwards-jr/", "emails": ["alexis.edwards@maine.edu"], "phones": ["207-778-7050"], "departments": ["Sweatt Winter Childcare Center"], "titles": ["Head Teacher-Preschool"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Alireza", "last_name": "Geshnizjani", "biography": "Dr. Alireza Geshnizjani (Dr. Ali) joined UMF in 2011. His educational background is interdisciplinary: biology and public health with concentrations in statistics and health behavior theories. He has presented at several state and national conferences such as American Public Health Association and Indiana Public Health Association and published in several public health journals. His research focus is on chronic disease prevention by using theoretical and conceptual frameworks to design interventions and evaluation studies. His research projects are currently focused mainly on cancer prevention, college students’ sexual health and changing health behaviors in rural areas. He has taught a wide variety of courses such as human anatomy, animal biology, personal health, theories of health behavior, program planning, epidemiology, health communication and theories, intervention design, public health biology, and independent research courses.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/alireza-geshnizjani/", "emails": ["alireza.geshnizjani@maine.edu"], "phones": ["207-778-7270"], "departments": ["Global Studies"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Alison", "last_name": "Thayer", "biography": "Alison is a Maine native and proud UMF alumna who fell in love with the Western Maine mountains during her time as a student. She brings a strong passion for fitness and recreation to her role and enjoys sharing its benefits with the UMF and greater Farmington communities. Outside of work, Alison spends as much time as possible outdoors—mountain biking, cross-country skiing, gardening, and exploring with her dogs.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/alison-m-thayer/", "emails": ["athayer@maine.edu"], "phones": ["207-778-7050"], "departments": ["Fitness and Recreation Center"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Allen", "last_name": "Bailey", "biography": "A native of Arkansas, Dr. Bailey arrived at UMF in 2000 after attending graduate school in Idaho. As an undergraduate, he received a degree in history as well as mathematics, which explains a rather keen interest in the history of mathematics. In his time at UMF, he has been involved with grants that focused on enhancing communication between math and science teachers at all levels and helping to better prepare high school students for college-level mathematics classes. He is currently serving as chair of the Faculty Development Committee. Outside of school, Allen likes to read, hike, plant trees, and root for the Arkansas Razorbacks.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/allen-bailey/", "emails": ["allen.bailey@maine.edu"], "phones": ["207-778-7245"], "departments": ["Mathematics"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Allen", "last_name": "Mercier", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/allen-m-mercier/", "emails": ["allen.mercier@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Alyssa", "last_name": "Williamson", "biography": "Alyssa Williamson became the University of Maine at Farmington Head Softball Coach in 2021. Williamson, a Maine native, came to UMF from Suffolk University, where she spent two years as an Assistant Coach. In her first season at Suffolk, she helped the team reach the postseason with an 11-5 conference record. Six Suffolk athletes received all-conference recognition, including one first-team selection, two second-team selections, and three third-team selections. Williamson was responsible for managing administrative operations, preparing practice plans, and recruiting. At Suffolk she also worked as an Academic Support Advisor for the athletics department. She met twice monthly with all incoming student-athletes to assist with their transition to college, as well as teach student-athletes proper study habits and time management skills. Outside of coaching, Williamson has worked and volunteered for a number of organizations in the realm of mental health and poverty. In 2020 she joined LUK Inc., a non-profit that supports youth, adults and families in challenging situations to get the help they need. From 2019 to 2020, Williamson interned at Worcester Polytechnic Institute, managing a caseload of undergraduate and graduate students providing therapy and helping to guide them with treatment plans. As a student-athlete, Williamson Willamson racked up an impressive list of accolades at Merrimack as a standout first baseman. She was a two-time Northeast-10 All-Conference athlete, two-time CoSIDA Academic All-American, NE10 Female Scholar Athlete of the Year, NE10 Woman of the Year finalist, two-time CoSIDA Academic All-District selection, two-time D2CCA All-East Region, two-time NE10 All-Conference First Team selection, NFCA All-East Region First Team honoree, and led the conference with a .441 batting average as well as led her team with 71 hits. At Scarborough High School in Maine, Williamson was a four-time All-State honoree, two-time State Champion, and in 2014 was named Miss Maine Softball and Gatorade Player of the Year.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/alyssa-m-williamson/", "emails": ["alyssa.williamson@maine.edu"], "phones": ["207-778-7925"], "departments": ["Athletics"], "titles": ["Head Coach Women's Softball"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Amy", "last_name": "Neswald", "biography": "Amy Neswald is a fiction writer, screenwriter, and short filmmaker. Her work has appeared in The Rumpus, The Normal School, Bat City Review, and Green Mountain Review, among others. Her debut novel-in-stories I Know You Love Me, Too, was a recipient of the New American Fiction Prize and a finalist for a Maine Literary Award. Her short film Solitaire received international recognition. Prior to moving to rural Maine, she had a long career as a wigmaster for Broadway shows. She teaches creative writing at the University of Maine in Farmington and continues working on her next novel and a collection of short films.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/amy-neswald/", "emails": ["amy.neswald@maine.edu"], "phones": ["207-778-8024"], "departments": ["Creative Writing"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Andrea", "last_name": "Butterfield", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/andrea-b-butterfield/", "emails": ["andreab@maine.edu"], "phones": ["207-778-7807"], "departments": ["University Store"], "titles": ["Mail Services Assistant CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Andrew", "last_name": "Barton", "biography": "Raised in the southern Appalachians, Andrew Barton is a forest and fire ecologist, science writer, and professor of biology. His research focuses on forest response to changing climate and wildfire in the mountains of the Southwest. His current projects focus on an endangered plant, fire management in national parks, and the use of the new ECOSTRESS instrument on the International Space Station to predict vegetation recovery after wildfires. Drew is the author of the award-winning book, The Changing Nature of the Maine Woods, and Ecology and Recovery of Old-growth Forests in Eastern North America . He co-founded the Michigan National Forest Watch and the UMF Sustainable Campus Coalition and was a board member of the Mt. Blue-Tumbledown Conservation Alliance, which protected 30,000 acres of forestland in western Maine. He teaches courses on ecology, conservation, and forests, as well as a travel course on the ecology of Costa Rica.", "orcid": "https://orcid.org/0000-0001-5978-0337", "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/andrew-barton/", "emails": ["barton@maine.edu"], "phones": ["207-778-7397"], "departments": ["Environmental Science"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Angela", "last_name": "Carter", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/angela-g-carter/", "emails": ["angela.carter@maine.edu"], "phones": ["207-778-7417"], "departments": ["Administrative Systems"], "titles": ["Accounting Support Specialist"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Angie", "last_name": "Leclair", "biography": "I currently serve as the Communications & Marketing Specialist for Enrollment at the University of Maine at Farmington (UMF). I’ve been with UMF for 36 years, and my 38 years in higher education have given me a deep understanding of effective communication within the campus community, with prospective students, and the broader public.My current role involves creating admissions collateral and communications to prospective students through emails and videos, working closely with the admissions team. I am also involved in major marketing campaigns. In addition to my role in Admissions, I assist various departments with their branded marketing materials.I earned my Bachelor of Arts in Interdisciplinary Studies, with a focus on Art & Business, from the University of Maine at Farmington in 2013. My specialized skills include digital print production using Photoshop, Illustrator, and InDesign, as well as web page design with WordPress. Originally from Texas, I moved to Maine in 1985 and now consider myself a Mainer, even though I don’t sound like one.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/angie-leclair/", "emails": ["aleclair@maine.edu"], "phones": ["207-778-7656"], "departments": ["Admissions Professional Staff"], "titles": ["Communications & Marketing Specialist"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ann", "last_name": "Bartges", "biography": "Ann Bartges is a photographer and video artist with an appetite for experimental approaches to digital media. Her work has been exhibited nationally and internationally at venues including the Grimmerhus Museum in Denmark, Dark Horse Experiment in Melbourne, Australia and Cove Street Arts in Portland, ME. She has been an artist-in-residence at Cite Internationale des Arts in Paris, France, Institute fur Alles Mogliche in Berlin, Germany, and Guldagergaard International Ceramic Research Center in Skaelskor, Denmark. At UMF, Bartges teaches courses in digital photography, video and 2-D design, and is also the Director of Emery Community Arts Center. As a curator, Bartges’ goal is to use art as a vehicle to engage students and the Farmington community in meaningful conversations about the complexity and humanity of contemporary issues and foster a deeper appreciation for the importance of art in civic life.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ann-bartges/", "emails": ["ann.bartges@maine.edu"], "phones": ["207-778-7461"], "departments": ["Visual Arts"], "titles": ["Senior Lecturer/Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Anne Marie", "last_name": "Wolf", "biography": "Anne Marie Wolf is a medieval historian and a dedicated teacher. She teaches both halves of Global History, several courses on Europe from the Roman period through the 17th century and several others, mostly on the Middle East and the Mediterranean world. She also teaches a 2-week travel course, Cultural History of Spain, in Spain in even-numbered years. Dr. Wolf specializes in late medieval Spain, especially interfaith (Christian-Jewish-Muslim) interactions there. Her recent book Juan de Segovia and the Fight for Peace: Christians and Muslims in the Fifteenth Century (Notre Dame Press, 2014) focuses on this Castilian theologian’s unconventional plea for peace and dialogue with the Turks rather than war. Her current research is in popular notions and practices of health, which she is exploring through an investigation of apothecaries and vernacular medical writing. For this, she has expanded her research into the Early Modern period.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/anne-marie-wolf-2/", "emails": ["anne.marie.wolf@maine.edu"], "phones": ["207-778-7715"], "departments": ["Arts & Humanities"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Anne", "last_name": "Rockwell", "biography": "Coach Rockwell was born and raised in Greenville, Maine. She graduated from Carrabassett Valley Academy and moved on to compete four years for Bates College Alpine Team. Following her athletic career, Anne gained coaching experience with Gould Academy. During her time in Bethel, ME she furthered her coaching education receiving a USSA Level 200 Alpine Certification. It was a matter of time before migrating north to ski and coach with CVA in most recent years. Maine ski racing has always been at the heart of Anne’s life, working and playing in the western mountains of Maine. She now calls Stratton, ME home where she lives with her husband and english lab.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/anne-rockwell/", "emails": ["anne.rockwell@maine.edu"], "phones": ["207-778-7050"], "departments": ["and Head Alpine Coach"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "April", "last_name": "Mulherin", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/april-c-mulherin/", "emails": ["april.mulherin@maine.edu"], "phones": ["207-778-7081"], "departments": ["Public Information"], "titles": ["Associate Dir Media Relations"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ashlee", "last_name": "Fecteau", "biography": "Ashlee Fecteau, a proud UMF Class of 2012 alumna, is deeply committed to helping students thrive, guiding them toward their goals and new experiences. In her personal life, Ashlee enjoys quality time with her husband and daughter, from exploring local Maine spots, playing board and video games, making memories at Disney World, or simply relaxing at home. She’s also a fan of 90s/2000s nostalgia, the series “Friends,” Disney and Pixar films, and a good Dunkin’ iced coffee.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ashlee-m-fecteau/", "emails": ["ashlee.fecteau@maine.edu"], "phones": ["207-778-7050"], "departments": ["TRIO Johnson Scholars"], "titles": ["Dir Johnson Scholars"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ashley", "last_name": "LaCasse", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ashley-n-lacasse/", "emails": ["ashley.lacasse@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Austin", "last_name": "French", "biography": "As the Internship Coordinator and a Part-Time Business Faculty Member at UMF, Austin is a workforce development leader and educator dedicated to connecting academic learning with real-world industry experience. Austin specializes in the outdoor recreation sector, serving as Project Director for UMF’s Western Maine Outdoor Recreation Hub of Excellence, where he works closely with industry partners to strengthen workforce development initiatives and drive economic growth in Maine’s outdoor industry. To complement the students’ internship experiences, his work integrates hands-on, project-based learning into business courses, creating real-world opportunities for students to engage with industry challenges. Beyond academia, Austin serves as the Seasonal Programs Supervisor and Training Coordinator at Sugarloaf Mountain Resort’s Snowsports School and is an Alpine Development Team Member with the Professional Ski Instructors of America – Eastern Region (PSIA-E).", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/austin-j-french/", "emails": ["austin.french@maine.edu"], "phones": ["207-778-7516"], "departments": ["Learning Assistance Center"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Barbara", "last_name": "McKeen", "biography": "Barbara L. McKeen is an accomplished and strategic Human Resources leader with over 38 years of experience driving organizational success through effective talent management, employee and labor relations, and comprehensive HR strategy development. A proud Maine native, Barbara brings extensive expertise in union and non-union environments, health and ancillary plan assessment and implementation, payroll management, and collective bargaining.\n\nAs the Director of Human Resources for the University of Maine System, supporting the University of Maine at Farmington, Barbara is responsible for overseeing all facets of Human Resources. Her purview includes recruitment, employee and labor relations, and ensuring rigorous compliance with all applicable federal and state labor laws.\n\nBefore her current role, Barbara held senior Human Resources positions across diverse sectors, including banking, state government, manufacturing, and healthcare. Her broad expertise encompasses benefits administration, payroll operations, organizational structuring, labor and employee relations, and the strategic implementation of HR technology.\n\nBarbara resides in Farmington, Maine, with her two rescue companions, Beau and Neige. Outside of her professional endeavors, she enjoys the outdoors and the many offerings of Maine, particularly when the weather is warm, and a beach is nearby.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/barbara-mckeen/", "emails": ["barbara.mckeen@maine.edu"], "phones": ["207-227-7271"], "departments": ["Administrative Systems"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Barbi", "last_name": "Castonguay", "biography": "I am a proud University of Maine at Farmington alum, Class of 1995, and a first-generation college graduate. My time at UMF was transformative and deepened my appreciation for Maine’s natural beauty—especially the Weld area, with its stunning lake, hiking trails, and peaceful landscapes. I love spending time with my family, exploring the outdoors, traveling to new places, white water rafting, skydiving, and expressing my creativity through quilting. The connections and experiences I have gained at UMF continue to inspire me personally and professionally.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/barbi-castonguay/", "emails": ["barbic@maine.edu"], "phones": ["207-778-7079"], "departments": ["Admissions"], "titles": ["CRM Administrator"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ben Eric", "last_name": "Toribio Jr", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ben-eric-g-toribio-jr/", "emails": ["ben.toribio@maine.edu"], "phones": ["207-778-7050"], "departments": ["Athletics"], "titles": ["Assist Track & Field Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Benjamin", "last_name": "Parry", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/benjamin-e-parry/", "emails": ["benjamin.parry@maine.edu"], "phones": ["207-778-7325"], "departments": ["University Store"], "titles": ["Retail Services Assistant CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Betsy", "last_name": "Hill", "biography": "A native of the Finger Lakes region of New York State, most of Betsy’s career has been full of adventure and new destinations throughout the US while supporting her husband’s Marine Corps career and raising their 2 children (while working on and off). Prior to her husband’s retirement she completed her graduate degree in higher education with a goal to help students navigate through their collegiate journey. She has over 10 years of experience within higher education; serving in several capacities and institutional settings. Outside of work, she enjoys any and all water activities, hiking, traveling and spending quality time with her family and friends.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/betsy-m-hill/", "emails": ["betsy.hill@maine.edu"], "phones": ["207-778-7254"], "departments": ["Administrative Systems"], "titles": ["Student Accounts and Financial"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Blake", "last_name": "Hart", "biography": "Blake Hart was named UMF Head Coach of Men’s Soccer in 2021. Prior to that he had served as an Assistant Coach with the Men’s Soccer program. During that time, he also has coached with Western Maine United U-18 and been on the staff of numerous soccer camps. Additionally, he assisted with the Women’s Basketball program at UMF.\n\nBlake is a graduate of Castleton University where he earned a Bachelor’s degree in Sports Administration with a minor in Business. In addition to his studies, he excelled for 4 seasons on the Castleton team, appearing in 75 games with 42 starts, tallying 15 goals and six assists. There he demonstrated leadership on many fronts, interning with the Director of Athletics and serving as a member of the Student-Athlete Advisory Committee (SAAC).\n\nHart’s volunteer experiences include coaching youth soccer and basketball while officiating youth soccer with the Farmington Recreation Department. He has been involved with Maine Special Olympics in the Farmington area as well as when he was a student-athlete at Castleton. He intends to draw upon his experiences and local connections to engage the team in community service as well.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/blake-hart/", "emails": ["blake.hart@maine.edu"], "phones": ["207-778-7142"], "departments": ["Athletics"], "titles": ["Head Men's Soccer Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Bodhi", "last_name": "Simpson", "biography": "Professor Simpson holds a doctorate in philosophy, is a licensed clinical professional counselor, and a registered art therapist. She is an assistant professor at the University of Maine in Farmington in the Masters in Counseling Psychology Program with an Emphasis in the Creative Arts. She has 20+ years of experience working with clients of all ages and educating clinicians on how to ethically incorporate creative expression into clinical practice. Bodhi has a small private practice in central Maine and she presents workshops locally, virtually, and internationally in Crete, Greece on incorporating creative expression and work with ancient stories and myth into clinical practice. Simpson is a co-creator of Expressive Wellness Workshops, Trainings, & Retreats and also Wisdom Journeys, LLC. Additionally she is a visionary artist and both the author and illustrator of “The Girl Who Cried for the Earth: A Story of Hope, Healing & Possibilities.”", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/bodhi-simpson/", "emails": ["bodhi.simpson@maine.edu"], "phones": ["207-778-7050"], "departments": ["Psychology"], "titles": ["Assistant Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Brad", "last_name": "Dearden", "biography": "Brad Dearden is Associate Professor of Geography and Environmental Planning at the University of Maine Farmington, with interests in development, sustainability, and urban places – particularly in the developing world. His recent research has examined inequality in urban areas associated with globalization processes. Brad maintains affiliations with the International and Global Studies program at the University of Maine at Farmington, as well as the American Association of Geographers and the New England-St. Lawrence Valley Geographical Society. Brad’s outside interests include travel, photography, cooking, tennis, and pickleball.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/brad-dearden/", "emails": ["brad.dearden@maine.edu"], "phones": ["207-778-7439"], "departments": ["Global Studies"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Breanna", "last_name": "Maxim", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/breanna-l-maxim/", "emails": ["breanna.maxim@maine.edu"], "phones": ["207-778-7050"], "departments": ["Sweatt Winter Childcare Center"], "titles": ["Asst Teacher Infant/Toddler"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Brian", "last_name": "Ellis", "biography": "3rd year at UMF working for the Office of the President and a Navy Veteran.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/brian-l-ellis/", "emails": ["brian.ellis1@maine.edu"], "phones": ["207-778-7256"], "departments": ["President's Office"], "titles": ["Administrative Support Supvsr"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Brian", "last_name": "Mason", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/brian-r-mason/", "emails": ["brian.mason@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Briana", "last_name": "Markoff", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/briana-markoff/", "emails": ["briana.markoff@maine.edu"], "phones": ["207-778-7192"], "departments": ["Middle & Secondary Education"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Brianna", "last_name": "Grumstrup", "biography": "Dr. Grumstrup is a first generation college student who was a classroom teacher for nine years in Reno, NV. She taught high schoolers with autism and related disabilities, as well as consulted with teachers to support students with autism and multiple disabilities ranging from 3 to 22 years old and in a wide range of educational settings. Her research emphasizes health education and outcomes for people with intellectual and developmental disabilities. She has a husband and dog, and loves to read, hike, cook, try new restaurants, and experiment with fashion. She also likes secondhand furnishings and art to use in cozy home decorating.", "orcid": "https://orcid.org/0000-0002-8826-753X", "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/brianna-grumstrup/", "emails": ["brianna.grumstrup@maine.edu"], "phones": ["207-778-7478"], "departments": ["Special Education"], "titles": ["Assistant Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Brock", "last_name": "Caton", "biography": "Chief Caton joined the Department of Public Safety/Police Department in 2012, and has served as Chief since 2013. In his role, he has responsibility for a wide range of campus safety, emergency, and compliance efforts, and supervises a staff of 6 full time and 14 part time staff members. Brock began his law enforcement career in 2003 as a Patrol Officer with the Livermore Falls Police Department. Brock has served 22 years in the Maine Army National Guard and was deployed three times to Iraq and Afghanistan. Brock resides in Farmington with his wife, Nissa, and their two children.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/brock-e-caton/", "emails": ["brock.caton@maine.edu"], "phones": ["207-778-7033"], "departments": ["Public Safety"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Brooke-Lynn", "last_name": "Hinkley", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/brooke-lynn-m-hinkley/", "emails": ["brookelynn.hinkley@maine.edu"], "phones": ["207-778-7050"], "departments": ["Office of Global Education"], "titles": ["RLE Program Coord"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Bryce", "last_name": "Cundick", "biography": "Bryce Cundick has an MA in American Literature from BYU and an MLIS from Florida State. He is a past president of the Maine Library Association and the current chair of the Maine Library Commission.|In his spare time he publishes YA thrillers under the pen name Bryce Moore and currently has 6 professionally published books in print. He also collaborates with UMF Professor Karol Maybury on pet personality research. They have conducted numerous popular studies on cats, for both scholarly and popular audiences. Most recently, they developed the first-ever cat intelligence assessment and a large scale analysis of cat color and personality.To learn more see their website: mainecatlab.org.|Outside of work, he is an avid Magic the Gathering player and helps run the UMF MTG Club.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/bryce-m-cundick/", "emails": ["bryce.cundick@maine.edu"], "phones": ["207-778-7224"], "departments": ["Library"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Bryn", "last_name": "Doiron", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/bryn-a-doiron/", "emails": ["bryn.doiron@maine.edu"], "phones": ["207-778-7201"], "departments": ["Health Center"], "titles": ["Special Project Assistant"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Callie", "last_name": "Hammer", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/callie-e-hammer/", "emails": ["callie.hammer@maine.edu"], "phones": ["207-778-7050"], "departments": ["Athletics"], "titles": ["Summer Camp Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Camille", "last_name": "Blanchet", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/camille-m-blanchet/", "emails": ["camille.blanchet@maine.edu"], "phones": ["207-778-7636"], "departments": ["TRIO Johnson Scholars"], "titles": ["Academic Advisor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Carey", "last_name": "Salerno", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/carey-l-salerno/", "emails": ["carey.salerno@maine.edu"], "phones": ["207-778-7050"], "departments": ["Arts & Humanities"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Carla", "last_name": "DeGraw", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/carla-j-degraw/", "emails": ["carlad@maine.edu"], "phones": ["207-778-7050"], "departments": ["VP for Academic Affairs"], "titles": ["Registrar"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Carol", "last_name": "Weeks", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/carol-j-weeks/", "emails": ["weeks@maine.edu"], "phones": ["207-778-7480"], "departments": ["Sweatt Winter Childcare Center"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Carroll", "last_name": "Pease", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/carroll-d-pease/", "emails": ["carroll.pease@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Cecil", "last_name": "Harris", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/cecil-e-harris/", "emails": ["cecil.harris@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Chelsey", "last_name": "Frank", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/chelsey-i-frank/", "emails": ["chelsey.frank@maine.edu"], "phones": ["207-778-7480"], "departments": ["Sweatt Winter Childcare Center"], "titles": ["Asst Teacher Infant/Toddler"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Chompers", "last_name": null, "biography": "Chompers is UMF’s beloved beaver mascot, known for big school spirit and an even bigger smile! When he’s not busy cheering on the Beavers at games, you’ll find him building campus pride one log at a time. A true Mainer at heart, Chompers loves crisp fall days, snowy winters, and making new friends at every event.\n\nHe’s a master builder, expert high-fiver, and never turns down a good photo op. Whether it’s Accepted Student Days, Move-In day, or just a regular Tuesday, Chompers is always ready to bring the energy and spread that Beaver pride!\n\nFavorite Snack: Freshly cut maple logs Favorite Hobby: Dam good construction projects Motto: “Once a Beaver, always a Beaver!”", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/chompers/", "emails": [], "phones": ["207-778-7050"], "departments": [], "titles": ["Resident Beaver"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Chris", "last_name": "Bessey", "biography": "Chris Bessey has been the University of Maine at Farmington’s Head Baseball Coach since 2008.\n\nUnder Bessy, the UMF Beavers have shown steady improvement. In 2016 UMF won 23 games overall and 15 conference games both all-time school records. In 2015 the Beavers won 17 games, the second-most wins in program history. In 2014, UMF earned five All-NAC awards, which is the most conference awards all-time in one season. The 2013 campaign also produced the first North Atlantic Conference Freshman of the Year in program history in rookie Ben Keene. Bessey was voted NAC Coach of the Year in 2014.\n\nNumerous UMF baseball players under Bessey’s tutelage earned All-NAC awards, including 12 First Team All-NAC selections. First baseman Josh Garneau, a First Team All-NAC honoree in 2011, was UMF baseball’s first First Team selection since 2004 and paved the way for two more First Team award winners in 2012. In 2017, Sean Cabaniss won the NAC Man of the Year award. From 2015-2017, the UMF Baseball program also had three players receive the Senior Scholar-Athlete of the year for UMF Athletics. The award is voted on by head coaches of all sports and given to one player. UMF’s Joe Sullivan, Sean Cabaniss and Jordan Croteau were the award recipients. From 2019-2021, five players received All-NAC honors, including four First Team selections and one Sportsmanship Team selection.\n\nPrior to his position at UMF, Bessey was a 14-year head varsity baseball coach at Jay High School where he amassed 141 wins and his Tigers won the State Class C Championship in 2002 and reached at least the regional semifinals in six seasons. Additionally, he guided the Jay girls basketball team for eight seasons, claiming a State Class C title in 2009. He previously led the Jay boys basketball team for three years (1999-2001). Following the consolidation of Jay and Livermore Falls high schools, Bessey was named head boys basketball coach of the new Spruce Mountain High School and has held that post since the start of the 2011-12 season.\n\nBessey was a standout student-athlete at UMF in both Baseball and Men’s Basketball. He was inducted into the UMF Athletics Hall of Fame in 2010 for his performance as a two-sport student-athlete. In Baseball, he held the program’s career record in triples and is second in stolen bases. In Men’s Basketball, he is third on the career scoring list at 1,641 points and maintains the standard for career steals.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/chris-bessey/", "emails": ["christopher.p.bessey@maine.edu"], "phones": ["207-778-7831"], "departments": ["Athletics"], "titles": ["Head Men's Baseball Coach, Assistant Sports Information"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Chris", "last_name": "Deon", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/chris-t-deon/", "emails": ["ctdeon@maine.edu"], "phones": ["207-778-7108"], "departments": ["Merrill Ctr Student Services"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Christian", "last_name": "Waller", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/christian-h-waller/", "emails": ["christian.waller@maine.edu"], "phones": ["207-778-7050"], "departments": ["VP for Academic Affairs"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Christine", "last_name": "Wilson", "biography": "Dr. Wilson has more than 30 years of teaching and strategic leadership experience in higher education in student affairs, enrollment management, alumni relations, and advancement. Before coming to UMF in 2019, she served as Assistant Vice President for Student Affairs at the University of Connecticut and taught in the UConn master’s in Higher Education and Student Affairs Program. Before UConn, she served as the Assistant Director for Student Leadership at the University of Rhode Island, during which time she oversaw and taught in the academic minor in Leadership Studies, and as an instructor in the URI’s master’s in College Student Personnel program. Wilson served as Director of Student Activities at the University of Baltimore, Assistant Director of Residential Life at SUNY–New Paltz, and Coordinator of Residential Life at Penn State University. Wilson also earned a master’s certificate in Restorative Practices and a certificate in Student Affairs Law and Policy.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/christine-wilson/", "emails": ["christine.wilson@maine.edu"], "phones": ["207-778-7087"], "departments": ["Student Affairs"], "titles": ["Vice President"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Christopher", "last_name": "Vogel", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/christopher-a-vogel/", "emails": ["christopher.a.vogel@maine.edu"], "phones": ["207-778-7036"], "departments": ["Upward Bound"], "titles": ["UB Ac Cnslr/Tutor & Ment Coord"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Christopher", "last_name": "Bennett", "biography": "Chris Bennett grew up near Atlanta, Georgia, moving to Maine with his wife in 2007. He enjoys sports, technology, the outdoors, reading, and spending time with family and friends. He lives in Wilton, Maine, with his wife, two sons, and a variety of animals.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/christopher-bennett/", "emails": ["chris.bennett@maine.edu"], "phones": ["207-778-7114"], "departments": ["Computer Science"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Christopher", "last_name": "Magri", "biography": "Chris Magri is an astronomer whose research involves radar studies of asteroids. He uses powerful radar facilities to transmit million-watt microwave beams at asteroids and then measure the faint echoes. These data are used to determine the target’s orbit, size, shape, rotation, surface topography, and material composition. He and his collaborators around the country also study asteroids’ thermal properties, using an infrared telescope atop Mauna Kea in Hawaii to measure emitted heat radiation. Computer analysis of these emissions can reveal whether an asteroid’s surface is loose material or else solid bedrock; this can influence the asteroid’s trajectory and thus whether or not it will impact Earth. At UMF Dr. Magri teaches introductory physics and astronomy, both as general education courses for nonscientists and as preparation for science majors.", "orcid": "https://orcid.org/0000-0002-2200-4622", "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/christopher-magri/", "emails": ["magri@maine.edu"], "phones": ["207-778-8151"], "departments": ["Environmental Science"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Christopher", "last_name": "White", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/christopher-white/", "emails": ["christopher.white@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Clyde", "last_name": "Mitchell", "biography": "Dr. Mitchell has an undergraduate degree in Mechanical Engineering and is a Chartered Accountant by profession. He trained as an accountant and auditor with Ernst and Young in South Africa, after which he worked as a management consultant before joining academia. Prior to UMF he taught at two major South African Universities, where he taught both graduate and undergraduate Accounting and Finance. His PhD and primary research interests are in the field of Corporate Social and Environmental Reporting. He currently teaches on the Business Economics Program and the Outdoor Recreation Business Administration interdisciplinary programs at UMF.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/clyde-mitchell/", "emails": ["clyde.mitchell@maine.edu"], "phones": ["207-778-7413"], "departments": ["Business Administration"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Connor", "last_name": "Fahey", "biography": "As the Coordinator of Orientation & Transition Programs at the University of Maine at Farmington, Connor Fahey is driven by the belief that life is an adventure, and he’s here to help new Beavers find their purpose within it. He meticulously designs engaging orientation experiences and supportive transition initiatives, ensuring a warm and seamless welcome for all students on UMF’s vibrant, community-focused campus. Connor is genuinely enthusiastic about fostering a deep sense of belonging, connecting students with the essential resources, exciting opportunities, and vital knowledge they need. His goal is simple: for every new Beaver to feel empowered, connected, and truly at home as they embark on their next chapter in their journey.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/connor-fahey/", "emails": ["connor.fahey@maine.edu"], "phones": ["207-778-7065"], "departments": ["Admissions Professional Staff"], "titles": ["Coordinator"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Cynthia", "last_name": "McShane", "biography": "Cyndi McShane, ’07, works in UMF’s Career Services office and is a part-time instructor of courses in academic and career exploration & planning. She aspires to help students explore academic paths and career opportunities that align with their interests, passions, and values. She thrives in helping students craft their career narratives while learning more about professional identities. Outside of work, Cyndi enjoys walking her dog in the woods and exploring the world with her two children and her husband, Joe.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/cynthia-a-mcshane/", "emails": ["cynthia.mcshane@maine.edu"], "phones": ["207-778-7050"], "departments": ["Learning Assistance Center"], "titles": ["Assist. Dir. Career Services"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Cynthia", "last_name": "Kaherl", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/cynthia-h-kaherl/", "emails": ["cynthia.kaherl@maine.edu"], "phones": ["207-778-7296"], "departments": ["Learning Assistance Center"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Dan", "last_name": "Pease", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/dan-pease/", "emails": ["dan.pease@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Dan", "last_name": "Seabold", "biography": "Dr. Dan stays clinically active as a Licensed Psychologist. As a longstanding board member of Work First, an organization that provides services to adults with developmental disabilities he has been a strong advocate for the organization’s three local thrift stores and other vocational opportunities for the disabled. Given his interests in the outdoors and land conservation, he assisted in the formation of Foothills Land Conservation and severed as the first president. During his time in office, the organization was able to preserve 180 acres at the headwaters of Wilson Lake. He also was instrumental in spearheading the formation of the Tumbledown Conservation Alliance through the combined efforts of Foothills and the Appalachian Mountain Club. This organization went on to secure the funding and protection of 7,464 acres inside Mt. Blue as well as 18,311 acres on Tumbledown Mountain.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/dan-seabold/", "emails": ["seabold@maine.edu"], "phones": ["207-778-7382"], "departments": ["Psychology"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Dana", "last_name": "Dudley", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/dana-dudley/", "emails": ["dana.dudley@maine.edu"], "phones": ["207-778-7050"], "departments": ["Fitness and Recreation Center"], "titles": ["Lifeguard"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Daniel", "last_name": "Jackson", "biography": "Daniel Jackson is an associate professor whose work connects mathematics, education, and technology. His interests include dynamical systems, algebra and geometry, and exploring tools like 3D printing and generative AI to enrich math teaching. He teaches courses including Calculus, Statistics, Math for Elementary School Teachers, Middle/Secondary Math Methods, Learning Theory for Middle and Secondary Education majors, and graduate seminars in mathematics education. His classes emphasize constructivism, project-based learning, and real-world applications, focusing on helping future and current educators build confidence and strong teaching identities. His research has appeared in Transactions of the AMS and other journals, and he frequently shares his work at regional conferences. Jackson finds his greatest reward in contributing to the success of his students and the learners they will teach. When he’s not in the classroom, he enjoys hiking in the Maine woods and spending time at the coast.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/daniel-jackson/", "emails": ["daniel.jackson1@maine.edu"], "phones": ["207-778-7318"], "departments": ["Middle & Secondary Education"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Danielle", "last_name": "Heintz", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/danielle-heintz/", "emails": ["umf.finish@maine.edu"], "phones": ["207-778-7051"], "departments": ["Continuing Education"], "titles": ["Administrative Specialist"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Danielle", "last_name": "Tekut", "biography": "Danielle began her undergraduate degree in 2008 and received a BA in dance from Smith College in 2015. She completed her Master of Clinical Social Work from the Smith College School for Social Work in 2019. Mid-pandemic, Danielle moved from Vermont- where she worked as a family, group, and individual therapist- to Downeast Maine.\n\nDanielle will be offering services entirely remotely at UMF. She can support students in managing the stress of life adjustments, relationship challenges, anxiety and depressive symptoms, developing communication skills, processing grief and loss, and navigating systemic oppression and resulting trauma. She believes both the relationships with ourselves and with others are at the heart of all healing work, and utilizes CBT, DBT, and mindfulness skills to promote self-awareness, growth, and empowerment. Danielle is also a certified yoga teacher, currently in training to become a yoga therapist.\n\nCall 207-778-7034 or stop by the CSD during open hours to schedule an appointment. All students with billable insurance can have up to three visits per semester without a co-pay charge. After three visits, you will be charged the co-pay amount associated with your insurance plan. Students with insurance that we cannot bill or who fail to present a health insurance card will be charged $20 for every visit. Students who have not met their annual insurance deductible or if your insurance company denies a submitted claim, will be charged $20 for the office visit. Students never have to pay up-front for services; they may have any charges added to their student account.\n\nAny dissatisfaction or complaints may be registered by contacting Christine Wilson, Vice President for Student Affairs and Enrollment Management, or the State Board of Social Worker Licensure, 35 State House Station Augusta, (207) 624-8623.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/danielle-l-tekut/", "emails": ["danielle.tekut@maine.edu"], "phones": ["207-778-7042"], "departments": ["Mental Health/Counseling Serv"], "titles": ["Mental Health Counselor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Darryl", "last_name": "Howard", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/darryl-j-howard/", "emails": ["darryl.howard@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "David", "last_name": "Bubier", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/david-p-bubier/", "emails": ["david.bubier@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Dawn", "last_name": "Nye", "biography": "Professor Nye has worked as a graphic designer but has also maintained a studio art practice for the last 20 years. She has exhibited and screened her work in the United States as well as in Europe. She is most interested with telling stories of conflicting human desires, best intentions, beauty and futility. She uses humor, pathos and the history of image to connect to ideas that cannot be accurately described with words. She is influenced by graphic design, film, animation, music, literature and the history of art–but also by the people she meets, the neighborhoods she has lived in and the headlines she reads.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/dawn-nye/", "emails": ["dawn.nye@maine.edu"], "phones": ["207-778-7515"], "departments": ["Visual Arts"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Deanna", "last_name": "Melville", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/deanna-melville/", "emails": ["deanna.melville@maine.edu"], "phones": ["207-778-7093"], "departments": ["University Advancement"], "titles": ["Manager"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Deborah", "last_name": "Baker", "biography": "Deborah Baker is committed to helping future educators acquire the skills they need to plan meaningful lessons, differentiate instruction, assess students’ learning, manage the classroom, and work collaboratively with school communities. Teaching, learning, and leading experiences in Maine and California as a teacher, principal, student teacher supervisor, and ASCD leader helps her connect educators to powerful resources. Student teaching is a field experience that provides future educators the opportunity to apply their knowledge and skills in schools. It requires the collaboration of student teachers, mentor teachers, principals, and student teacher supervisors. Student teachers build relationships, reflect on decisions, receive specific feedback, and demonstrate professionalism. For almost ten years, UMF student teachers have received Deborah’s support to become caring, confident, and competent educators.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/deborah-baker/", "emails": ["deborah.baker@maine.edu"], "phones": ["207-778-7172"], "departments": ["Early Childhood Education"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Deborah", "last_name": "Moody", "biography": "Deborah is a Maine native that has worked in the Financial Aid Office since 1983. She also oversees the Merrill Center, which is a one-stop service center that includes Financial Aid, Student Accounts, Records and Enrollment and Student Employment.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/deborah-moody/", "emails": ["dmoody@maine.edu"], "phones": ["207-778-7104"], "departments": ["Merrill Center Student Services"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Deborah", "last_name": "Overstreet", "biography": "Dr. Overstreet’s interest in young adult literature has culminated in writing two books that examine this literature—the most recent being vampire literature. Her interest in popular culture has led her to teach several First Year Seminars focusing on the television work of Joss Whedon and the films of Joel and Ethan Coen. Additionally, Dr. Overstreet teaches writing, children’s and young adult literature and teaches future teachers to teach writing, literature, and language arts.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/deborah-overstreet/", "emails": ["overstreet@maine.edu"], "phones": ["207-778-7506"], "departments": ["Middle & Secondary Education"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Debra", "last_name": "Kinney", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/debra-n-kinney/", "emails": ["dkinney@maine.edu"], "phones": ["207-778-7451"], "departments": ["VP Administration"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Denisa", "last_name": "Cundick", "biography": "Denisa discovered her love of learning languages in high school and continues to pursue new linguistic challenges, most recently Japanese. This passion for language acquisition naturally led her to a BA in Linguistics, and while pursuing her MA in Teaching English to Speakers of Other Languages (TESOL), she dedicated several years to teaching English as a Second Language to adults and young adults from diverse backgrounds in community and university settings. At UMF, she teaches undergraduate and graduate courses in linguistics, ESOL and first-year writing. In addition to teaching, she also works as an academic advisor and tutor in the TRIO Johnson Scholars Program and as a liaison in the Early College Program. Outside of work, she loves to travel with her family, work in her garden in the summer, and ski in the winter.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/denisa-cundick/", "emails": ["denisa.cundick@maine.edu"], "phones": ["207-778-7050"], "departments": ["English"], "titles": ["Instructor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Destiny", "last_name": "Long", "biography": "Destiny Long is the New Student Orientation Programmer at the University of Maine at Farmington. She is a proud first generation college graduate with a bachelor’s in English from Columbia University. A native of Farmington, she attended college as both a traditional first-year and a non-traditional transfer student, and hopes to draw from those experiences to design programming that supports a diversity of students at UMF. She is currently pursuing a Master’s in Adult and Higher Education from USM. Outside of work, she is a self-taught gardener who is working to implement permaculture design principles at home. In the evenings she spends her time creating with yarn, watching sci-fi, and gaming with her spouse and child.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/destiny-long/", "emails": ["destiny.long@maine.edu"], "phones": ["207-778-7595"], "departments": ["Strageic Procurement"], "titles": ["Associate Strageic Sourcing Manager"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Donald", "last_name": "Goebel", "biography": "Professor Goebel is a Visiting Lecturer of Chemistry and Physics and teaches General Chemistry and General Physics for STEM majors and non-science majors. Research interests are the study of unusual antimony and bismuth compounds and chemical reactions that behave as chemical oscillators. Professor Goebel’s hobbies include coin collecting and antique hunting. Additional outside activities include golf, hiking, fishing and reading science fiction novels.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/donald-w-goebel/", "emails": ["donald.goebel@maine.edu"], "phones": ["207-778-7050"], "departments": ["Chemistry & Physics"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Donelle", "last_name": "Schwalm", "biography": "Dr. Donelle (Doni) Schwalm’s interests broadly encompass the impact of climate change and habitat fragmentation on patterns of occupancy, distribution, genetic diversity and functional connectivity in terrestrial wildlife populations. She is focused on providing students the opportunity to engage in field and lab-based skills building and active research either as a research assistant or through participation in experiential learning in the classroom. Visit her website to learn more: http://donischwalm12.wixsite.com/connectthefox .", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/donelle-schwalm/", "emails": ["donelle.schwalm@maine.edu"], "phones": ["207-778-7395"], "departments": ["Environmental Science"], "titles": ["Assistant Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Donna", "last_name": "Karno", "biography": "Dr. Karno is originally from Phoenix, Arizona and has lived in a number of different regions throughout the U.S. She teaches Early Childhood Education with a teaching and research focus of appropriate use of digital technology with early learners, specifically computational thinking and robotics. Since arriving at UMF in 2009, Dr. Karno has been involved in a number of state-wide policies and initiatives, including membership on the Steering Committee and the cognitive standards writing group for the current Maine Early Learning and Development Standards. She loves spending time with her family, that includes her husband, three daughters, two son in laws, and her two wonderful grandsons. Her hobbies include traveling with her husband, reading, building miniature houses, and Legos.", "orcid": "https://orcid.org/0000-0002-1930-558X", "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/donna-karno/", "emails": ["donna.karno@maine.edu"], "phones": ["207-778-7561"], "departments": ["Early Childhood Education"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Douglas", "last_name": "Tucker", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/douglas-c-tucker/", "emails": ["douglas.tucker@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Douglas", "last_name": "Howard", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/douglas-howard/", "emails": ["douglas.howard1@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Douglas", "last_name": "Reusch", "biography": "Dr. Douglas Reusch, Professor of Geology, is interested in the origins and significance of mountains, notably the New England Appalachians; how tectonic processes affect carbon cycling and Earth’s climate; and sustainability, especially the emerging work on negative emissions. He has participated in Antarctic research, Ocean Drilling Leg 183 to the southern Indian Ocean, and mapping projects in coastal Maine, west-central Maine and Newfoundland. At UMF, Dr. Reusch teaches Environmental Geoscience, Oceans: Ancient and Modern, Structural Geology and Tectonics, Geochemistry, and Geology of Newfoundland (travel course). He has also engaged UMF students in award-winning geologic research, including mapping of the nearby spectacular Bald Mountain and Saddleback Wind field sites.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/douglas-reusch/", "emails": ["reusch@maine.edu"], "phones": ["207-778-7463"], "departments": ["Geology"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Duncan", "last_name": "Farley", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/duncan-j-farley/", "emails": ["duncan.farley@maine.edu"], "phones": ["207-778-7410"], "departments": ["Student Life"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Edward", "last_name": "Bronish", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/edward-j-bronish-jr/", "emails": ["edward.bronish@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Electrical Specialist CL3"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Elizabeth", "last_name": "LeClair", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/elizabeth-l-leclair/", "emails": ["elizabeth.le@maine.edu"], "phones": ["207-778-7050"], "departments": ["Athletics"], "titles": ["Assistant Coach Lacrosse"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Elizabeth", "last_name": "Hansen", "biography": "Elizabeth is a Maine native with over 15 years of experience in higher education. After completing undergraduate and graduate school at the University of Maine, she held positions at the University of Georgia, University of Washington Tacoma, and most recently Cameron University in Oklahoma. She is excited to be back in her home state with her husband, and closer to family and friends.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/elizabeth-m-hansen/", "emails": ["elizabeth.m.hansen@maine.edu"], "phones": ["207-778-7297"], "departments": ["Upward Bound"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Elyse", "last_name": "Pratt-Ronco", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/elyse-m-pratt-ronco/", "emails": ["elyse.pratt@maine.edu"], "phones": ["207-778-7050"], "departments": ["III"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Emily", "last_name": "Bean", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/emily-s-bean/", "emails": ["emily.falco@maine.edu"], "phones": ["207-778-7050"], "departments": ["Art & Humanities"], "titles": ["Program Manager"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Em", "last_name": "Swanson", "biography": "Emma has worked as an Admissions Counselor at UMF since the summer of 2024. She grew up on the coast in Southern Maine, but loves all that Western Maine has to offer. She has found Farmington in particular to be an exceptionally warm and welcoming community, and enjoys helping students find their place here. When she’s not working for UMF, Emma can be found reading by a river, treasure hunting at antique shops, camping with friends, or hanging out with her cats. She completed her BA at the University of Southern Maine and is currently working towards her MA in Organizational Leadership through UMPI. Emma is also a member of Psi Chi, The International Honor Society in Psychology.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/emma-swanson/", "emails": ["emma.swanson@maine.edu"], "phones": ["207-778-7051"], "departments": ["Admissions"], "titles": ["Admissions Counselor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Eric", "last_name": "McCallum", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/eric-s-mccallum/", "emails": ["eric.mccallum@maine.edu"], "phones": ["207-778-7147"], "departments": ["Athletics"], "titles": ["Assist Men's Soccer Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Erica", "last_name": "Thompson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/erica-n-thompson/", "emails": ["erica.n.thompson@maine.edu"], "phones": ["207-778-7482"], "departments": ["Sweatt Winter Childcare Center"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Erin", "last_name": "Connor", "biography": "Erin L. Connor, Ph.D. currently serves as Associate Dean for Graduate and Continuing Education at the University of Maine at Farmington, where she leads the graduate division of five master’s degree programs and eleven graduate certificates. Previously, Dr. Connor was Program Director for the Graduate Programs in Education at the University of New England, overseeing master’s, certificate, and doctoral programs. Dr. Connor also brings experience in instructional technology from her work at Colby College. A former English teacher and school administrator at the secondary level, her roots remain firmly planted in public schools. She holds a Ph.D. in Public Policy with a focus on Education Leadership and Policy from the University of Southern Maine, a master’s degree from the Harvard Graduate School of Education, and a B.A. in English Literature from Swarthmore College.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/erin-connor/", "emails": ["erin.l.connor@maine.edu"], "phones": ["207-778-7186"], "departments": ["Division of Graduate and Continuing Education"], "titles": ["Dean"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ernestine", "last_name": "Hutchinson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ernestine-s-hutchinson/", "emails": ["eleight@maine.edu"], "phones": ["207-778-7344"], "departments": ["VP Administration"], "titles": ["Dir"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Evan", "last_name": "Jackson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/evan-r-jackson/", "emails": ["evan.jackson@maine.edu"], "phones": ["207-778-7050"], "departments": ["STEM"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Frank", "last_name": "Chin", "biography": "A printmaker artist and a retired art instructor, department chair, RSU 54.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/frank-chin/", "emails": ["frank.chin@maine.edu"], "phones": ["207-778-7000"], "departments": ["Asso Provost/Dean of Acad Svcs"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Gabbi", "last_name": "Fultz", "biography": "Gabbi is the Area Director for the Scott Hall Complex (Scott Halls North, South, and West). She supervises the Community Assistants (CAs) in those halls and oversees the day to day operations of the buildings.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/gabbi-fultz/", "emails": ["gabriella.fultz@maine.edu"], "phones": ["207-778-7488"], "departments": ["Student Life"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Gail", "last_name": "Lange", "biography": "Gail has applied her expertise in Mathematics, Statistics, and Computing at the Harvard School of Public Health in modeling risk analysis as well as developing theoretical measures in Biostatistics. In addition she has worked at Jackson Labs in Bar Harbor in the genomic area and including particularly conserved sequence elements from man to mouse. As both a Mathematician and a Computer Scientist, she applies both of these areas to development of algorithms and proving their correctness, three-dimensional graphics, and image processing. Gail is an avid biker and ocean kayaker. She also enjoys tennis, hiking, snowshoeing, and cross country skiing.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/gail-lange/", "emails": ["lange@maine.edu"], "phones": ["207-778-7115"], "departments": ["Mathematics"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Gavin", "last_name": "Pickering", "biography": "Gavin Pickering, LCPC, is from Lincoln, ME. He is a first-generation college graduate with a Master’s in Education from UMO with concentrations in School and Mental Health Counseling. He loves swimming in rivers/streams, going on adventures, and producing/performing in theatre productions, especially with the local Farmington community theatre, Sandy River Players.\n\nGavin graduated UMF in 2008 with his B.S. in Secondary Education, and acquired his M.Ed. with concentrations in both Mental Health Counseling and School Counseling from The University of Maine in 2012. During Graduate School, Gavin was the Coordinator for LGBT services as well as graduate assistant for First and Second Year Programs- providing support for at-risk college students. After graduating, Gavin worked for several years with children and adolescents with significant emotional and behavioral issues, providing individual, family, and group counseling across the state of Maine. Here at UMF, Gavin helps students with personal growth issues, such as college adjustment, relationships, stress management, study skills and time management, attention deficit disorder, conflict mediation, substance abuse, eating disorders, anxiety, depression, sexual assault and abuse, and LGBT related issues.\n\nCall 207-778-7034 or stop by the CSD during open hours to schedule an appointment. All students with billable insurance can have up to three visits per semester without a co-pay charge. After three visits, you will be charged the co-pay amount associated with your insurance plan. Students with insurance that we cannot bill or who fail to present a health insurance card will be charged $20 for every visit. Students who have not met their annual insurance deductible or if your insurance company denies a submitted claim, will be charged $20 for the office visit. Students never have to pay up-front for services; they may have any charges added to their student account.\n\nAny dissatisfaction or complaints may be registered by contacting Christine Wilson, Vice President of Student Affairs and Enrollment Management, or the Board of Counseling Professionals Licensure, 35 State House Station, Augusta, ME 04333 (207-624-8626).", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/gavin-d-pickering/", "emails": ["gavin.pickering@maine.edu"], "phones": ["207-778-7038"], "departments": ["Mental Health/Counseling Serv"], "titles": ["Mental Health Counselor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "George", "last_name": "Josselyn", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/george-g-josselyn/", "emails": ["george.josselyn@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Lead Fac Maint Worker CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "George", "last_name": "Guptill", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/george-l-guptill/", "emails": ["george.guptill@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Griffin", "last_name": "Conlogue", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/griffin-t-conlogue/", "emails": ["griffin.conlogue@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Temp Prof Specialist, Other"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Hailey", "last_name": "Wellington", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/hailey-l-wellington/", "emails": ["hailey.wellington@maine.edu"], "phones": ["207-778-7050"], "departments": ["Administrative Systems"], "titles": ["Accounting Support Spclst CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Hannah", "last_name": "Willihan", "biography": "As the Admissions Specialist & Visit Coordinator at UMF, I am often the first point of contact for prospective students and families. I manage daily communications, organize personalized campus tours, and assist with the coordination of large group visits and admissions events. I also play a key role in reviewing international student applications. With a background that includes working at Carrabassett Valley Academy, Colby College, and the Maine Concussion Management Initiative, I bring valuable experience connecting with students, families, and high schools across the state. I am passionate about sharing what makes the Farmington area so special—its welcoming community, sense of adventure, and natural beauty. A proud graduate of the University of Maine at Presque Isle, I come from a family of University of Maine System alumni and am deeply committed to public higher education in Maine. When I’m not on campus, I can usually be found gardening or camping with my family, making the most of the region’s boundless outdoor offerings.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/hannah-b-willihan/", "emails": ["hannah.willihan@maine.edu"], "phones": ["207-778-7050"], "departments": ["Admissions"], "titles": ["Admissions Specialist"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Hattie", "last_name": "DeRaps", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/hattie-m-deraps/", "emails": ["hattie.walls@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Heather", "last_name": "Kennedy", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/heather-d-kennedy/", "emails": ["heather.d.kennedy@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Heustis", "last_name": "Whiteside", "biography": "Penn Whiteside is a psychiatric nurse practitioner who works with students at the Student Health Clinic. Penn offers holistic treatment including medication management for such conditions as anxiety, PTSD, ADHD, and mood disorders. Penn enjoys reading, languages, and spending time with his family.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/heustis-p-whiteside/", "emails": ["heustis.whiteside@maine.edu"], "phones": ["207-778-7200"], "departments": ["Health Center"], "titles": ["Psychiatric MH NP"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Hillary", "last_name": "Goldthwait-Fowles", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/hillary-goldthwait-fowles/", "emails": ["hillary.goldthwaitfowles@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Holly", "last_name": "Doe", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/holly-m-doe/", "emails": ["holly.doe@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Holly", "last_name": "Pond", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/holly-pond/", "emails": ["holly.pond@maine.edu"], "phones": ["207-778-7267"], "departments": ["Continuing Education"], "titles": ["Certification Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ilana", "last_name": "Lesser", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ilana-lesser/", "emails": ["ilana.lesser@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Isaac", "last_name": "Seigle", "biography": "Isaac Seigle is an Admissions Counselor at the University of Maine at Farmington, where he works to bring clarity, honesty, and encouragement to each conversation, proudly helping students “find their fit.” As a UMF graduate and Farmington native, Isaac brings a uniquely local and student-centered perspective to his work.Outside of work, he is a Registered Maine Guide, Appalachian Trail thru-hiker, and is currently restoring a 200-year-old timber-framed farm house. And for fun? He’s baked over 100,000 pizzas.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/isaac-seigle/", "emails": ["isaac.seigle@maine.edu"], "phones": ["207-778-7053"], "departments": ["Admissions Professional Staff"], "titles": ["Admissions Counselor & Transfer Advising"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jaime O’Connor", "last_name": "’98", "biography": "Jaime O’Connor, a proud member of the UMF Class of 1998, earned her degree in International Studies. Before joining the university in 2023 as Director of Alumni Relations, Jaime spent many years in the summer camp industry, serving as director for both day and overnight camps across New England.|Her passion for building community and fostering meaningful connections led her back to UMF, where she now enjoys engaging with alumni through a variety of events and programs. When she’s not at work, Jaime loves to travel, spend time with her family, and explore the natural beauty of Maine’s outdoors.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jaime-l-oconnor/", "emails": ["jaime.oconnor@maine.edu"], "phones": ["207-778-7050"], "departments": ["University Advancement"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jaime", "last_name": "Powers", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jaime-l-powers/", "emails": ["jaime.powers@maine.edu"], "phones": ["207-778-7200"], "departments": ["Health Center"], "titles": ["Medical Assistant CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jake", "last_name": "Turlo", "biography": "Jacob is a native of Central Maine and began his current role as an Admissions Counselor and Transfer Specialist after graduating from UMF in 2024. Having attended four different schools in his first four semesters, he firmly believes that finding a place where you truly fit in is a major part of the college decision process. He is committed to helping students discover how UMF can be the right fit for them. In his free time, he loves to disc golf and watch the Red Sox. A fun fact about Jake is that he was the Student Speaker at UMF’s commencement in 2024.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jake-turlo/", "emails": ["jacob.turlo@maine.edu"], "phones": ["207-778-7540"], "departments": ["Admissions"], "titles": ["Admissions Counselor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "James", "last_name": "Melcher", "biography": "Jim Melcher was born and raised in Madison, WI, one of America’s most politically active cities. His undergraduate degrees in Political Science and Geography are a reflection of his strong interest in the interactions between American politics, geography and history. He went on to write his doctoral dissertation on state political parties at the University of Minnesota, and was the last doctoral student of legendary parties scholar Frank Sorauf. He’s taught at UMF since 1999 and teaches a wide range of courses on American politics, government and political thought. He also serves as pre-law adviser. He has become known throughout the University of Maine system for his work on the Maine Public Policy Scholars program, and has become a frequent “voice of the University” in his numerous interviews as a political expert with media both within and outside Maine. Jim and his wife Nancy Finnegan live in Augusta, ME.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/james-melcher/", "emails": ["jim.melcher@maine.edu"], "phones": ["207-778-7416"], "departments": ["Political Science"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jamie", "last_name": "Beaudoin", "biography": "Jamie Beaudoin was named the University of Maine at Farmington’s Director of Athletics in 2022, after serving in that capacity on an Interim basis during the 2021-22 academic year.\n\nHe previously served as UMF’s Head Women’s Basketball Coach from 1999 to 2021 and was named Associate Athletics Director in 2010. During his time guiding UMF’S women’s hoops, Beaudoin guided the team to Conference Championships in 2002, 2003, 2004, 2006, and 2007. Beaudoin was the North Atlantic Conference and State of Maine Coach of the Year in 2003 and 2007.\n\nOver his 22 seasons (1999-2021) at the helm of UMF’S Women’s Basketball, Beaudoin’s teams posted an overall record of 294-261.\n\nBeaudoin also coached Men’s Soccer for the Beavers from 2001 to 2007 where the Beavers earned back-to-back Conference Titles in 2001 and 2002. He was named the NAC Men’s Soccer Coach of the Year in 2003 and 2006.\n\nA graduate of Orono High School and the University of Maine at Farmington with a degree in Elementary Education in 1997, Beaudoin was a four-year starter for the UMF Men’s Basketball program under Head Coach Dick Meader. During his junior and senior years, he was the team’s captain and was named an NAIA Scholar Athlete each year. At the conclusion of his senior year, he was awarded the Maine Athletic Conference/Fleet Bank Scholar Athlete and the Maine College Basketball and Writers’ Association Scholar Athlete awards for his outstanding efforts in competition and in the classroom.\n\nBeaudoin also played on the highly successful UMF Men’s Soccer team that had a 43-8-2 record during the three years he competed. During his junior and senior seasons, he was named to the National Soccer Association of America First Team All-American, was an NAIA Scholar Athlete, and received numerous awards on the regional and state level.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jamie-beaudoin/", "emails": ["jbeaudoin@maine.edu"], "phones": ["207-778-8168"], "departments": ["Student Affairs"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Janice", "last_name": "Crandall", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/janice-crandall/", "emails": ["janice.crandall@maine.edu"], "phones": ["207-778-8117"], "departments": ["Learning Assistance Center"], "titles": ["Testing Operations Manager"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jason", "last_name": "Beckler", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jason-d-beckler/", "emails": ["jason.beckler@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Mechanical Manager"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jason", "last_name": "Brooks", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jason-r-brooks/", "emails": ["jason.r.brooks@maine.edu"], "phones": ["207-778-7535"], "departments": ["Athletics"], "titles": ["Dir"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jassmine", "last_name": "Reil", "biography": "Jassmine has been a Data Management Technician at UMF since the fall of 2023. They grew up in the Bath area and moved to Farmington for their undergraduate career in 2017. They’ve grown to love the Western maine area for its mountains, proximity to nature, and cozy small town feel. The community of Farmington makes her feel right at home. When she is not working at UMF they can be found writing at home, watching horror movies with her cat Benny, and exploring the area for great photography opportunities. She completed her BA program in Psychology through UMF in the winter of 2021 and is currently working toward finishing their Creative Writing Certificate through UMF as well.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jassmine-reil/", "emails": ["jassmine.reil@maine.edu"], "phones": ["207-778-7057"], "departments": ["Administrative Staff"], "titles": ["Data Management Tech"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jayne", "last_name": "Decker", "biography": "Professor Decker is a playwright and director and teaches courses in acting, directing, social and political theatre, commedia and physical performance. Director teaches for UMF Honors and the Division of Arts, Humanities, Social Science and business.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jayne-decker/", "emails": ["jdecker@maine.edu"], "phones": ["207-778-7319"], "departments": ["Performing Arts"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Evans", "last_name": null, "biography": "JD Evans, UMF’s Outdoor Recreation Admissions Counselor, is back on campus after 13 years in the outdoor industry, inspiring young adults to blend business aspirations with a love for the outdoors. A 2018 UMF alumnus, JD holds a Bachelor of Science in Community Health with a concentration in outdoor recreation programming and planning, plus a certificate in Alpine Operations Management.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jd-evans/", "emails": ["john.d.evans@maine.edu"], "phones": ["207-778-7598"], "departments": ["Admissions"], "titles": ["Admissions Counselor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jean", "last_name": "Doty", "biography": "Dr. Jean Doty is a microbiologist with research interests in both environmental and medical microbiology. When not in the classroom, you can find Dr. Doty in the lab guiding students in their class-required or independent research projects. These student-designed projects are very diverse in topic, ranging from the heritability of musicality to the bioremediation of heating oil contamination in soil. Her own research interests are in the interaction between humans and their microbiota. Dr. Doty teaches Cell Biology, Genetics and Microbiology for students in the major, and Introductory Microbiology and Human Genetics for students outside the major. When she isn’t teaching or doing research, she’s exploring the Canadian Maritimes with her husband, daughter and two very excited dogs.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jean-a-doty/", "emails": ["jeandoty@maine.edu"], "phones": ["207-778-7366"], "departments": ["Environmental Science"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jeffrey", "last_name": "Willis", "biography": "Dr. Jeffrey Willis is a UMF alumni with a doctorate in Political Science & International Relations from the University of Canterbury, in Christchurch, New Zealand. Professionally, Dr. Willis has engaged in a wide range of international work, including with both large and small international organizations such as United Nations Development Programme and World Wildlife Fund. Outside of work, Dr. Willis enjoys spending time on Maine’s many lakes and collecting vinyl records, cassette tapes, and CDs.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jeffrey-d-willis/", "emails": ["jeffrey.willis@maine.edu"], "phones": ["207-778-7166"], "departments": ["Office of Global Education"], "titles": ["Coord."], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jeffrey", "last_name": "Thomson", "biography": "Jeffrey Thomson is the Director of the BFA Program and the author of four books of poems, including Birdwatching in Wartime , winner of both the 2010 Maine Book Award and the 2011 ASLE Award in Environmental Creative Writing, and Renovation. Birdwatching in Wartime is currently being translated into Spanish and Russian. His translations of the Roman poet, Catullus, are forthcoming from Cambridge University Press. In 2012 he was the Fulbright Distinguished Scholar in Creative Writing at the Seamus Heaney Poetry Centre at Queen’s University Belfast. His website is www.jeffreythomson.com.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jeffrey-thomson/", "emails": ["jeffrey.thomson@maine.edu"], "phones": ["207-778-7454"], "departments": ["Creative Writing"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jennifer", "last_name": "Pageot", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jennifer-a-pageot/", "emails": ["jennifer.pageot@maine.edu"], "phones": ["207-778-7050"], "departments": ["Fitness and Recreation Center"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jennifer", "last_name": "Hutchinson", "biography": "Jennifer grew up a stone’s throw from campus and has worked at UMF since 1986. She serves on the Board of Directors for the Maine Association of Student Financial Aid Administrators (MASFAA) where she also served as President from 2018 to 2022. When not at work, she enjoys music, camping, friends, traveling and hanging out with family.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jennifer-f-hutchinson/", "emails": ["jferr@maine.edu"], "phones": ["207-778-7106"], "departments": ["Financial Aid"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jennifer", "last_name": "King", "biography": "Dr. Jennifer King is a licensed marriage and family therapist and founder of the Center for Collaborative Family Therapy in Falmouth, Maine. A member of the graduate faculty in Counseling Psychology, Dr. King teaches Social & Cultural Foundations, Diagnosis & Treatment, and Foundations in Marriage & Family Therapy. Dr King serves as Chair of the Maine Board of Counseling Professionals Licensure. Outside of work, Jennifer is most likely hiking, downhill skiing, or tending to her cat, Zoloft.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jennifer-king/", "emails": ["jennifer.king1@maine.edu"], "phones": ["207-778-7176"], "departments": ["STEM"], "titles": ["Assistant Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jesse", "last_name": "Potts", "biography": "Jesse Potts was born in Harrisburg, PA, but has also called NY, MT, VT, VA, MI and ME home. His sculpture and installations combine constructed and found objects, printed image, video, light, performance and sound. Kinetic and interactive components within the work link time-based functions to action and outcome. The work itself exists as the residual matter of a meditation on the relationship between time, sensory perception, culture and mortality. Jesse has been an artist in residence at the I-A-M residency, Berlin, Germany, The European Ceramic Work Centre, s’-Hertogenbosch, The Netherlands, and Cité Internationale des Arts, Paris, France. He has received grants from The Virginia Museum of Fine Arts, Vermont Arts council, The Kansas City Artist Coalition and VCU School of the Arts. His work has been included in solo and group exhibitions both nationally and internationally and reviewed by Hyperallergic and the New York Times.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jesse-potts/", "emails": ["jesse.potts@maine.edu"], "phones": ["207-778-7050"], "departments": ["Visual Arts"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jessica", "last_name": "Apgar", "biography": "Jessica has been an educator for the past 16 years; she spent 8 years as a dual-certified inclusive educator in public schools and has worked with pre- and in-service teachers for the past 11 years. Her professional interests include inclusive education, systems change, literacy, and curricular alignment, all with the goal of achieving social justice for all students through the implementation of high-quality, rigorous instruction, particularly for students with the most extensive support needs.", "orcid": "https://orcid.org/0009-0000-1361-8959", "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jessica-apgar/", "emails": ["jessica.apgar@maine.edu"], "phones": ["207-778-7385"], "departments": ["Special Education"], "titles": ["Assistant Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jessica Isler", "last_name": "Nickerson", "biography": "Since 2024, Jess has been the first year advisor for education majors, and managed the education peer advising program. Jess loves working with education majors to help them navigate the nuances of their first year in college! Jess originally joined the UMF Staff in 2017 as a professional librarian at Mantor Library, and she helps staff and faculty use our student success program: Navigate360.|Away from work, Jess feels very lucky to spend time outdoors with her family where they ski at Sugarloaf, hike in the mountains, swim and paddle in the lakes, and keep a garden in the summer.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jessica-e-isler-nickerson/", "emails": ["jessica.isler@maine.edu"], "phones": ["207-778-7227"], "departments": ["Library"], "titles": ["Access Srvs Lib & Nav Admin"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ashley", "last_name": "Montgomery", "biography": "Originally from Tennessee (Go Vols!), Dr. Montgomery has called Maine home for over 25 years. She is deeply invested in how we teach—not just what we teach. Her passion lies in instructional design and helping educators in both K–12 and higher education make intentional choices that truly support learning. To better support faculty at UMF, she teaches in the First Year Seminar program and in the EDT graduate partnership with UM and USM. Outside of work, she spends her time gardening, preserving what she grows, swimming in as many Maine lakes as possible, and baking sourdough bread.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/joella-a-montgomery/", "emails": ["ashleym@maine.edu"], "phones": ["207-778-7383"], "departments": ["Teaching & Learning Collabortv"], "titles": ["Dean"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Joey", "last_name": "Essoe", "biography": "Dr. Joey Ka-Yee Essoe (劉家宜) is a cognitive neuroscientist/psychologist with a speciality in learning enhancement. Her teaching interests includes implementing learning enhancement strategies in frontline pedagogy, training students to become resourceful learners in the age of Generative AI and uncertainty. Her current research concerns the interaction between learning and human flourishing, covering topics such as forgiveness and anti-fragility.Beyond these, she writes epic-fantasy novels (kessoe.com), cooks from scratch (mostly American and Italian), feeds people delicious (but ugly) food, plays guitars (poorly), and recently started digital drawing. She loves puns. She loves snow, Maine’s sun angles, which lead to the blue hour at twilight that happens nowhere else she has lived. And “sidle” is her favourite word in the English language.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/joey-essoe/", "emails": ["joey.essoe@maine.edu"], "phones": ["207-778-7381"], "departments": ["Psychology"], "titles": ["Assistant Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "John", "last_name": "Hawes", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/john-hawes/", "emails": ["john.hawes@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Struct Spclst Locksmith CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jon", "last_name": "Hayes", "biography": "With over two decades of experience in higher education, athletics administration, and coaching, this professional brings a diverse skill set in leadership, program development, and student success. Jon started working in the Admissions office for UMF in 2016. He currently serves as the Associate Director of Admissions. His responsibilities include office travel planning, applicant pool management, and coordinating key initiatives including expense and budget oversight. His role also includes staff supervision and serving as the primary liaison with the athletic department.His extensive background includes over 17 years of collegiate coaching experience, marked by significant leadership roles across various NCAA divisions. This includes his tenure as Head Coach of Men’s Basketball at the University of New England. Other coaching roles encompassed assistant and associate head coaching positions for men’s basketball at the University of Maine, Thomas College, Whitworth University, Colorado School of Mines, Hamilton College, and the University of Maine at Farmington.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jon-hayes/", "emails": ["jonathan.hayes@maine.edu"], "phones": ["207-778-7735"], "departments": ["Admissions"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jon", "last_name": "Kennedy", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jon-p-kennedy/", "emails": ["jon.kennedy@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Struct Spclst Carpenter CL3"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jonathan", "last_name": "Durrell", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jonathan-b-durrell/", "emails": ["jonathan.durrell@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Jonathan", "last_name": "Moody", "biography": "Jonathan Moody, Maine’s 2024 State Superintendent of the Year, is the Superintendent of the Schools for RSU / MSAD 54 in Somerset County. This large rural district includes five elementary schools, the Skowhegan Area Middle School, the Skowhegan Area High School, the Somerset Career and Technical Center, and the Marti Stevens Learning Center. Jon and his wife Shelly (Maine’s 2011 Teacher of the Year, and Elementary Principal in RSU18) are proud alumni of UMF (’98), where they both were scholar-athletes. Jonathan was a 2016 inductee into the UMF Athletics Hall of Fame. Jon and Shelly are active advocates for a strong educational system for students (K-12) and pre-service teachers (post-secondary) statewide. Together they have three children.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/jonathan-d-moody/", "emails": ["jonathan.moody@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Joseph", "last_name": "McShane", "biography": "Joe graduated from UMF in 2007 and has been working here since 2016. He lives in New Sharon with his two small children and wife Cyndi, who also works at UMF.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/joseph-mcshane/", "emails": ["joseph.mcshane@maine.edu"], "phones": ["207-778-7068"], "departments": ["TRIO Johnson Scholars"], "titles": ["Learning Spec/Acad Advisor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Joseph", "last_name": "McDonnell", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/joseph-w-mcdonnell/", "emails": ["jmcdonnell@maine.edu"], "phones": ["207-778-7256"], "departments": ["President's Office"], "titles": ["President"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Joshua", "last_name": "DeMello", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/joshua-d-demello/", "emails": ["joshua.d.demello@maine.edu"], "phones": ["207-778-7426"], "departments": ["Arts & Humanities"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Judy", "last_name": "Burdick", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/judy-l-burdick/", "emails": ["judy.burdick@maine.edu"], "phones": ["207-778-7034"], "departments": ["Mental Health/Counseling Serv"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Julia", "last_name": "Daly", "biography": "Dr. Daly is a geologist with interests in landscape evolution and the geologic footprint of climate change. Most of her courses, including Environmental Geology, Surficial Processes, and Climate Change, focus on the intersection of geologic processes and human activity. All of her classes emphasize field experiences and take multiple trips to explore the geology of Maine. In addition, her upper-level courses use of the program’s ground-penetrating radar (GPR) to investigate a variety of local landforms. Her current research focus is small mountaintop lakes in western Maine that are indicators of how climate change is altering the high peaks region of the state. Other recent projects with students have included documenting the fossils found in post-glacial deposits, water quality monitoring on a local lake, and tracking erosion on a local river.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/julia-daly/", "emails": ["dalyj@maine.edu"], "phones": ["207-778-7403"], "departments": ["Geology"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Julia", "last_name": "Hazel", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/julia-i-hazel/", "emails": ["julia.hazel@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Julia", "last_name": "Jeremias", "biography": "Julia started her life in education as a toddler teacher and continued in various roles from teacher to public school administrator until moving to Maine. Julia’s work focuses on building connections and supporting adult learners in their continued educational journey.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/julia-jeremias/", "emails": ["julia.jeremias@maine.edu"], "phones": ["207-778-7274"], "departments": ["Early Childhood Education"], "titles": ["Coordinator & Advisor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Julia", "last_name": "Bouws", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/julia-r-bouwsma/", "emails": ["julia.bouwsma@maine.edu"], "phones": ["207-778-7050"], "departments": ["Arts & Humanities"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Julie", "last_name": "Bartlett", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/julie-bartlett/", "emails": ["julie.bartlett1@maine.edu"], "phones": ["207-778-7400"], "departments": ["Public Safety"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Julie", "last_name": "Farmer", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/julie-farmer/", "emails": ["julie.farmer@maine.edu"], "phones": ["207-778-7105"], "departments": ["Financial Aid"], "titles": ["Financial Aid Counselor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Justin", "last_name": "Godin", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/justin-d-godin/", "emails": ["justin.godin@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Mechanical Specialist CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kaitlynn", "last_name": "Ham", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kaitlynn-ham/", "emails": ["kaitlynn.ham@maine.edu"], "phones": ["207-778-7050"], "departments": ["Athletics"], "titles": ["Assistant Coach Field Hockey"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Karen", "last_name": "Barrett", "biography": "Karen Barrett is a native of Maine, and is a graduate of the Rehabilitation Services Program. She completed her Masters and Doctorate at Southern Illinois University in Carbondale, where her studies and research focused on human resources within rehabilitation organizations. She has published in the Journal of Rehabilitation Administration , Rehabilitation Education , and Psychiatric Rehabilitation , and is a member of the Commission on Undergraduate Standards and Accreditation of the Council on Rehabilitation Education. Dr. Barrett has local ties, and is a leader in rehabilitation education at the national level.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/karen-barrett/", "emails": ["kbarrett@maine.edu"], "phones": ["207-778-7111"], "departments": ["Psychology"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Karen", "last_name": "Hellekson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/karen-l-hellekson/", "emails": ["karen.hellekson@maine.edu"], "phones": ["207-778-7505"], "departments": ["Fitness and Recreation Center"], "titles": ["Special Project Assistant"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Karen", "last_name": "Thurston", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/karen-thurston/", "emails": ["karen.thurston@maine.edu"], "phones": ["207-778-7265"], "departments": ["Early Childhood Education"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Karla", "last_name": "Diffin", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/karla-l-diffin/", "emails": ["karla.diffin@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Part-time Faculty"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Karol", "last_name": "Maybury", "biography": "Professor Maybury has expertise in Social Cognition; Personality and Organizations (particularly aviation); Pet Attachment; and Research Methods. She leads the UMF Social Psychology Laboratory, which has produced several students who have pursued graduate study and research positions after graduating UMF.\n\nKarol and her students have presented papers and posters at: the New England Psychological Association; the Psi Chi Journal; the Association for Psychological Science; COPLAC; Mainely Data; the American Psychological Association; and the Eastern Psychological Association annual conferences.\n\nIn her spare time she collaborates with Mantor Library Director Bryce Cundick; they have conducted numerous popular studies on cats, for both scholarly and popular audiences. Most recently, they developed the first cat intelligence assessment and a large scale analysis of cat color and personality..\n\nTo learn more see their website: mainecatlab.org.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/karol-maybury/", "emails": ["karol.maybury@maine.edu"], "phones": ["207-778-7067"], "departments": ["Psychology"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kate", "last_name": "Macleod", "biography": "Dr. Kate MacLeod is an innovative inclusive educator, researcher, and author. She teaches in the undergraduate and graduate special education programs at UMF and leads the Inclusive Education and Leadership track in the M.S.Ed. special education program. She began her career as a dual-certified high school special educator and English teacher in New York City. Kate also works as a consultant to support educators, school leaders, and families across Maine, the northeast, and the country to feel prepared and inspired to include all learners. She has co-authored three books and written many research and practitioner articles about K-12 inclusive education. Kate lives in Maine with her husband and son.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kate-macleod/", "emails": ["kate.macleod@maine.edu"], "phones": ["207-778-7099"], "departments": ["Special Education"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Katherine", "last_name": "Yardley", "biography": "Katherine Yardley currently serves as the Co-provost and Dean of the College of Education, Health, and Rehabilitation. Prior to assuming this role in 2023, she held the position of Associate Provost and Dean of the College of Education, Health, and Rehabilitation since 2001. Her leadership experience at the University of Maine at Farmington (UMF) also includes serving as the Chair of the Department of Early Childhood and Elementary Education from 1995 to 2001. Dr. Yardley began her career at UMF in 1987 as an Assistant Professor of Early Childhood Education, a role that initially involved teaching and serving as the Educational Director of the Sweatt-Winter Child Care Center. She achieved promotion and tenure in 1992 and was further promoted to full professor in 1998. Throughout her tenure at UMF, Dr. Yardley has been actively involved in numerous professional activities. She has contributed to various leadership teams, including the President’s Advisory Council, the College Leadership Team, and the Academic Leadership Council, and played a key role in the development and implementation of graduate education initiatives. Dr. Yardley has also overseen multiple state and national accreditation reviews of UMF’s teacher education programs, chaired several reviews of Maine’s Teacher Education programs for the State Board of Education, and served as a program reviewer for the New England Association of Schools and Colleges (NECHE). Dr. Yardley holds a B.A. with Honors in Psychology from Bowdoin College, as well as an M.Ed. and an Ed.D. in Early Childhood Education from the University of Massachusetts, Amherst.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/katherine-w-yardley/", "emails": ["kyardley@maine.edu"], "phones": ["207-778-7154"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Dean"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kathryn", "last_name": "Will", "biography": "Dr. Will holds a Doctorate in Curriculum and Instruction from Montana State University with a focus on literacy teacher preparation in situated communities of practice. Dr. Will taught in a four-room schoolhouse, developed preschool summer camps, and family-to-farm camps before transitioning to teacher preparation. Prior to joining UMF, she worked at Montana State University where she developed a passion for embedded teacher preparation. Her research interests include the development of teacher efficacy in clinically immersive preparation, rural education, children’s literature, and the innovative intersections of literacy development and technology.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kathryn-d-will/", "emails": ["kathryn.will@maine.edu"], "phones": ["207-778-7046"], "departments": ["Elementary Education"], "titles": ["Assistant Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kathryn", "last_name": "Desjardins", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kathryn-j-desjardins/", "emails": ["kathryn.desjardins@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kathryn", "last_name": "Stiefel", "biography": "Dr. Kathryn S. Stiefel is an assistant professor of special education whose work centers on promoting inclusive education and a sense of belonging for students with disabilities. Prior to her faculty role, her career began in classrooms, working as a preschool teacher, paraprofessional, and middle school special educator in MetroWest Boston. She has also worked at the collegiate level for an inclusive postsecondary education (IPSE) program. Her dedication to bridging research and practice informs her scholarship and teaching, preparing future educators to create accessible learning environments. Dr. Stiefel’s research explores evidence-based practices that foster meaningful inclusion, with a focus on supports and policies that improve outcomes for students with disabilities. Her teaching and scholarship are grounded in real-world experience and a deep commitment to student success. Dr. Stiefel’s work aims to prepare educators to lead in creating inclusive schools and classrooms where all students belong and are empowered to succeed.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kathryn-s-stiefel/", "emails": ["kathryn.stiefel@maine.edu"], "phones": ["207-778-7178"], "departments": ["Special Education"], "titles": ["Instructor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Katie", "last_name": "Callahan", "biography": "Dr. Callahan grew up in Wilton and Farmington, Maine, and now teaches in the Community and Public Health major at UMF. With a background in Public Health specializing in epidemiology, health behavior, and program development, her research focuses on community level interventions and behavior change strategies to improve population health. An active collaborator with State and National health organizations, she integrates service learning projects into her courses. Passionate about experiential learning, she aims to build community within her classes, make courses engaging, and create hands on, out of class experiences that give students real world, career ready skills. When she’s not teaching, you’ll find her outdoors—paddle boarding, tracking down hidden waterfalls, or enjoying easy hikes with her dog Pepper.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/katie-callahan/", "emails": ["katie.callahan@maine.edu"], "phones": ["207-778-7050"], "departments": ["Community and Public Health"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kaya", "last_name": "Backman", "biography": "Kaya Backman is a 2023 graduate of the University of Maine at Farmington with a degree in Community Health Education and a minor in Coaching. She takes over as the Head Coach after playing five seasons for the Beavers, four of which she served as a team captain.\n\nAs a player, Backman was a consistent offensive threat for the Beavers, playing in 48 contests and making 47 starts. She was named to the North Atlantic Conference (NAC) All-Conference team on three separate occasions.\n\nBackman aims to bring the Women’s Lascosse program back to the height of contention in the North Atlantic Conference after reaching the NAC Championship game in 2019. She also ihopes to create a sense of stability within the program, transitioning from senior captain to Head Coach.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kaya-backman/", "emails": ["kaya.backman@maine.edu"], "phones": ["207-778-7050"], "departments": ["Athletics"], "titles": ["Head Women's Lacrosse Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Keith", "last_name": "Plouffe", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/keith-a-plouffe/", "emails": ["keith.plouffe@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Part-time Faculty"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kelly", "last_name": "Bentley", "biography": "Professor Bentley’s work has focused on women’s health, mothering, intimate partner violence (IPV) and health policy. She has more than 24 years of experience in community health and has worked internationally, nationally, and at state and local levels. She is sought to speak about her research on mothers and IPV and is actively involved in violence prevention in the state and local community. Kelly has received numerous awards to include the prestigious Social Sciences and Humanities Research Council of Canada, Canada Graduate Scholarship Award. She has had more than 25 grants funded by federal, state and philanthropic organizations for community level interventions, evaluation and academic research.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kelly-bentley/", "emails": ["kelly.bentley@maine.edu"], "phones": ["207-778-7386"], "departments": ["Community Health"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kelly", "last_name": "Boivin", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kelly-j-boivin/", "emails": ["kelly.boivin@maine.edu"], "phones": ["207-778-7470"], "departments": ["Library"], "titles": ["Library Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kelsea", "last_name": "Bickford", "biography": "Kelsea Bickford is a Maine native and serves as the JMG College Success Specialist at the University of Maine at Farmington, where she supports students through academic advising, resource navigation, and transitional coaching. Her work focuses on helping students persist, graduate, and explore meaningful career pathways. Kelsea is also an active member of the Farmington Rotary Club, where she enjoys giving back to her community through service and leadership. Outside of work, she spends time with her family on their small hobby farm and unwinds with a binge-worthy TV series.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kelsea-bickford/", "emails": ["kelsea.bickford@maine.edu"], "phones": ["207-778-7050"], "departments": [], "titles": ["JMG College Success Specialist"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ken", "last_name": "Lewis", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ken-lewis/", "emails": ["kenneth.c.lewis@maine.edu"], "phones": ["207-778-7066"], "departments": ["Continuing Education"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kenneth", "last_name": "Dunham", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kenneth-w-dunham/", "emails": ["kenneth.dunham@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Structural Manager"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kevin", "last_name": "Melvin", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kevin-l-melvin/", "emails": ["kevin.melvin@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Mech Specialist Plumber CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kiana", "last_name": "Thompson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kiana-r-thompson/", "emails": ["kiana.thompson@maine.edu"], "phones": ["207-778-7050"], "departments": ["Athletics"], "titles": ["Assistant Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kim", "last_name": "Hilton", "biography": "Kim Hilton works with graduate students from their first inquiry through graduation. She advises in the graduate education programs as well as provides support for non-degree students taking courses towards teacher certification. Before returning to UMF as a staff member, Kim was a middle school English teacher and drama coach for 14 years here in Western Maine. She enjoys theater, reading, riding roller coasters, summer days at the lake, and spending time with her family.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kim-hilton/", "emails": ["kimberly.hilton@maine.edu"], "phones": ["207-778-7213"], "departments": ["Division of Graduate and Continuing Education"], "titles": ["Graduate Enrollment and Retention Counselor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kimberly", "last_name": "Ladd", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kimberly-a-ladd/", "emails": ["kimberly.ladd@maine.edu"], "phones": ["207-778-7029"], "departments": ["Learning Assistance Center"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kirsten", "last_name": "Petroska", "biography": "Kirsten Petroska is the Director of Early College Partnerships, where she builds strong connections between high schools and the university to help Maine students get a head start on college success. With a background in higher and secondary education, Kirsten is passionate about expanding access to college to high school students across the state, particularly first generation and rural students. She believes deeply in the transformative power of education and is dedicated to helping students discover their potential, build confidence, and thrive in college and beyond. Kirsten collaborates closely with school counselors, faculty, and families to create opportunities that are academically challenging and personally meaningful. Outside of work, she enjoys exploring Maine’s beautiful outdoors, reading widely, spending time with her family, and is currently pursuing a PhD in Leadership and Organizational Studies at USM where her research focuses on mothering and the leadership experience.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kirsten-a-petroska/", "emails": ["kirsten.petroska@maine.edu"], "phones": ["207-778-7266"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kirsten", "last_name": "Swan", "biography": "Even though Kirsten is “from away” she has been at UMF for more than 35 years. She works with clubs & organizations, creates Leadership workshops, coordinates Club Sports and advises both the senior class and Student Senate. Outside of work, Kirsten is involved in the Farmington community as a past president for the Farmington Rotary club and spearheads the local Dan / Janet Warner PJ drive during the winter months in collaboration with other non-profits. Kirsten enjoys her quiet neighborhood, basket weaving, and checking out all the spots for the best clam chowdah in Maine!", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kirsten-swan/", "emails": ["kswan@maine.edu"], "phones": ["207-778-7593"], "departments": ["Student Life"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kristen", "last_name": "Allen", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kristen-g-allen/", "emails": ["kristen.allen@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kristie", "last_name": "Backus", "biography": "Kristie is a proud Maine native and UMF alumi. She currently works in UMF’s Mental Health and Counseling Services Office, where she is passionate about supporting students in navigating their mental health and overall well-being. Kristie particularly enjoys integrating expressive art into her work, helping students explore and process their experiences through creative expression. Outside of her role at UMF, Kristie enjoys spending time with her family, and getting outside as much as possible. Whether it’s canoeing, kayaking, snowshoeing or simply being in nature, she finds peace and renewal in the outdoors.\n\nAccountability \nAny dissatisfaction or complaints may be registered by contacting Christine Wilson, Vice President of Student Affairs and Enrollment Management, or the Board of Counseling Professionals Licensure, 35 State House Station, Augusta, ME 04333 (207-624-8626).", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kristie-a-backus/", "emails": ["kristie.backus@maine.edu"], "phones": ["207-778-7042"], "departments": ["Mental Health/Counseling Serv"], "titles": ["Mental Health Counselor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Kristin", "last_name": "Hickey", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/kristin-o-hickey/", "emails": ["kristin.hickey@maine.edu"], "phones": ["207-778-7263"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Administrative Specialist CL3"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Larry", "last_name": "Tuttle", "biography": "Dr. Tuttle is a petrologist (i.e., geologist specializing in rocks) who studies the pressure-temperature history of metamorphic rocks as a means for examining Earth’s tectonic development. His present research efforts are largely focused on the spectacular metamorphic (and igneous) rocks of western Maine with the research goal of using these rock types to constraint the tectonic development of northern New England. Dr. Tuttle’s teaching activities at UMF include mineralogy, igneous and metamorphic petrology, and introductory geology. A key goal of Dr. Tuttle’s teaching efforts is to demonstrate the infinite ways in which Earth resources (i.e., minerals and rocks) are used by humans in Maine and everywhere to power society and to improve our standard of living. In his spare time, Dr Tuttle enjoys hiking (commonly with the goal of finding cool rocks) and growing flowers.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/larry-f-cliff-tuttle-ii/", "emails": ["larry.tuttle@maine.edu"], "phones": ["207-778-7402"], "departments": ["Geology"], "titles": ["Assistant Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Laura", "last_name": "Ada", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/laura-d-adams/", "emails": ["ladams@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Lead Fac Maint Worker CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Laurie", "last_name": "Lemieux", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/laurie-a-lemieux/", "emails": ["laurie.lemieux@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Laurie", "last_name": "Macwhinnie", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/laurie-a-macwhinnie/", "emails": ["macwhinn@maine.edu"], "phones": ["207-778-7219"], "departments": ["Library"], "titles": ["Head"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Laurie", "last_name": "Orff", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/laurie-j-orff/", "emails": ["godin@maine.edu"], "phones": ["207-778-7050"], "departments": ["Library"], "titles": ["Library Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lawrence", "last_name": "Ronco", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lawrence-s-ronco/", "emails": ["lawrence.ronco@maine.edu"], "phones": ["207-778-7177"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Leigh Ann", "last_name": "Fish", "biography": "Leigh Ann Fish, Ph.D., is an Associate Professor of Early Childhood Education, teaching undergraduate and graduate courses in early childhood, elementary, gifted and talented, and nature-based education. She is also a Maine Master Naturalist. Dr. Fish brings extensive experience as a public school educator, having served as an elementary teacher, gifted and talented specialist, and K–12 administrator. She previously held National Board Certification and served as board president of the Maine Association for the Education of Young Children (MaineAEYC). She currently serves on the governing board of the Maine Master Naturalist Program. Her professional interests include Reggio-inspired practices, nature-based education, and the role of museums and experiential environments as powerful spaces for learning, engagement, and interdisciplinary exploration.", "orcid": "https://orcid.org/0000-0001-8573-8693", "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/leigh-ann-fish/", "emails": ["leighann.fish@maine.edu"], "phones": ["207-778-7855"], "departments": ["Early Childhood Education"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lesley", "last_name": "Herschiag", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lesley-a-herschiag/", "emails": ["lesley.herschlag@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lewis", "last_name": "Robinson", "biography": "Lewis Robinson is the author of the story collection Officer Friendly (Random House, winner of a Whiting Award and the Pen/Oakland Josephine Miles Award) and the novel Water Dogs (a New York Times Book Review Editor’s Choice selection). His stories and essays have appeared in Sports Illustrated, Tin House, The Baffler, The Missouri Review, Open City and elsewhere and have been featured on N.P.R.’s Selected Shorts. He has received grants from the Whiting Foundation and the National Endowment for the Arts.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lewis-robinson/", "emails": ["lewis.robinson@maine.edu"], "phones": ["207-778-7419"], "departments": ["Creative Writing"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Linda", "last_name": "Beck", "biography": "Since joining the faculty in 2006, Linda Beck has developed several new courses that reflect her research interests in African Politics, Environmental Politics, and Global Studies, including a travel course on Ecotourism and Environmental Activism in Tanzania. Each spring, she teaches an honors course that prepares students to participate in the annual Camden Conference on World Affairs. Currently serving as the Associate Dean of Experiential and Global Education, she works closely with students and faculty to promote internships, short-term travel courses, and other experiential learning opportunities. Dr. Beck has published various articles, chapters in edited volumes, and a book on identity politics and democratization in Senegal. She has served as a consultant for various development organizations, including the US Agency for International Development, the World Bank, Freedom House, and the International Budget Project.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/linda-beck/", "emails": ["linda.beck@maine.edu"], "phones": ["207-778-7341"], "departments": ["Political Science"], "titles": ["Dean"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Linda", "last_name": "Andrews", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/linda-l-andrews/", "emails": ["linda.andrews@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Linda", "last_name": "Blodgett", "biography": "Linda is the longest-tenured member of the FRC staff. She began working in the UMF Business Office in 1989 and transitioned to the FRC in 2001. She cherishes the opportunity to work with both students and members of the community that her job affords her.|When not at work, Linda loves being outdoors and staying active. Having grown up on a farm, she stays true to her roots by maintaining an impressive vegetable garden.|She is a grandmother to 5 grandchildren, and lives in Wilton with her husband.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/linda-r-blodgett/", "emails": ["blodgett@maine.edu"], "phones": ["207-778-7311"], "departments": ["Fitness and Recreation Center"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lisa", "last_name": "Ellrich", "biography": "With a career in higher education spanning more than 25 years, Lisa Ellrich is well established in New England’s admissions community. As the Assistant Vice President for Enrollment Management & Director of Admissions at the University of Maine at Farmington, she is responsible for all facets of student recruitment, marketing, and financial services. Her leadership was instrumental in implementing the university’s CRM system and developing comprehensive recruitment plans that have expanded the university’s reach globally. An active member of numerous professional organizations, including NEACAC and NACAC, Lisa is a frequent presenter on topics ranging from data-informed recruitment to effective student yield programs. When not involved on campus, you can find Lisa actively involved in many local community organizations, including Titcomb Mountain – the local ski area – where she has served on the Board of Directors for many years.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lisa-ellrich/", "emails": ["ellrich@maine.edu"], "phones": ["207-778-7054"], "departments": ["Admissions"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lisa", "last_name": "Henry", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lisa-henry/", "emails": ["lisa.henry@maine.edu"], "phones": ["207-778-7376"], "departments": ["MA Counseling"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lisa", "last_name": "Beane", "biography": "Lisa is a Maine native and has worked at the university for 19 years within Merrill Center and the Registrar’s Office. She works closely with transfer credit analysis and pertinent areas of registration helping students, faculty, staff and parents. Outside of the university she enjoys gardening, camping, and most of all spending time with family and friends. Her biggest joy is her granddaughters.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lisa-m-beane/", "emails": ["lbeane@maine.edu"], "phones": ["207-778-7238"], "departments": ["VP for Academic Affairs"], "titles": ["Assistant Registrar"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lisa", "last_name": "Gallant", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lisa-m-gallant/", "emails": ["lisagall@maine.edu"], "phones": ["207-778-7199"], "departments": ["Asso Provost/Dean of Acad Svcs"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lisa", "last_name": "Cobu", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lisa-p-coburn/", "emails": ["lisa.coburn1@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lori", "last_name": "Soucie", "biography": "Lori is a native of Maine and an alum of UMF (’08). She has been working on campus in many capacities since the late 80’s. Currently, she coordinates and advises students in the Liberal Arts Undeclared program and offers general advising for all. Look for Lori in the Advising office in the Student Center. During spring, summer, and fall months, you’ll also find Lori in her perennial gardens with a view of the the beautiful foothills of Franklin County.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lori-a-soucie/", "emails": ["lori.soucie@maine.edu"], "phones": ["207-778-7040"], "departments": ["Mental Health/Counseling Serv"], "titles": ["Asst Dir"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lori", "last_name": "Koban", "biography": "Lori Koban’s research is in combinatorics, especially matroids and their connections with graph theory. The main topic of her work is gain and biased graphs. These are graphs with additional structure that leads to new graphical matroids. The theories of gain and biased graphs are being developed by her advisor, Thomas Zaslavsky, in a series of papers entitled Biased Graphs. She has developed interests in both actuarial education and mathematics education.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lori-koban/", "emails": ["lori.koban@maine.edu"], "phones": ["207-778-7952"], "departments": ["Mathematics"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Luann", "last_name": "Yetter", "biography": "Luann Yetter is retired from UMF but occasionally teaches writing classes. Her summer class, Local Stories, Your Stories, continues to be a popular creative nonfiction course. Luann is the author of three local history books, on Bar Harbor, Portland and Farmington, published by Arcadia.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/luann-i-yetter/", "emails": ["luann.yetter@maine.edu"], "phones": ["207-778-7050"], "departments": ["Arts & Humanities"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Lucas", "last_name": "Kellett", "biography": "Professor Kellett is a broadly trained archaeologist who teaches courses in archaeology, anthropology, climate change, geography and geographic information systems (GIS). Since 2002 he has conducted archaeological research in highland Peru which focuses on changing prehistoric settlement patterns, human-environmental interactions, warfare and climate change. His current research examines long-term mobility patterns in the Inca occupation of the eastern edge of the Andes in the Paucartambo area (Cusco region of Peru). Luke has led UMF travel courses to Newfoundland, Canada, the Four Corners of the US and Peru. He enjoys skiing, hiking, mountain biking and traveling internationally.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/lucas-kellett/", "emails": ["luke.kellett@maine.edu"], "phones": ["207-778-7436"], "departments": ["Global Studies"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Mackenzie", "last_name": "Campbell", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/mackenzie-m-campbell/", "emails": ["mackenzie.marles@maine.edu"], "phones": ["207-778-7480"], "departments": ["Sweatt Winter Childcare Center"], "titles": ["Head Teacher Preschl/SchoolAge"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Madison", "last_name": "Perkins", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/madison-j-perkins/", "emails": ["madison.j.perkins@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Marc", "last_name": "Bowering", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/marc-bowering/", "emails": ["marc.bowering@maine.edu"], "phones": ["207-778-7400"], "departments": ["Public Safety"], "titles": ["Police Sergeant"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Marcus", "last_name": "Christopher", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/marcus-christopher/", "emails": ["marcus.christopher@maine.edu"], "phones": ["207-778-7050"], "departments": ["Athletics"], "titles": ["Assistant Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Mariah", "last_name": "Langton", "biography": "I’m a 2021 UMF alumnus who now works in the toddler room at Sweatt-Winter Childcare. I’m passionate about nature-based education and connections within the Farmington community.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/mariah-d-langton/", "emails": ["mariah.langton@maine.edu"], "phones": ["207-778-7480"], "departments": ["Sweatt Winter Childcare Center"], "titles": ["Head Teacher Infant/Toddler"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Marilyn", "last_name": "Shea", "biography": "In addition to her teaching responsibilities in psychology, Dr. Shea maintains a strong web presence through the creation and maintenance of her Chinese English Dictionary and Study Center. Check out her website: http://hua.umf.maine.edu/Chinese/welcome.html", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/marilyn-shea/", "emails": ["mshea@maine.edu"], "phones": ["207-778-7374"], "departments": ["Psychology"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Mark", "last_name": "Henderson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/mark-a-henderson/", "emails": ["mark.henderson@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Martin", "last_name": "Morocco", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/martin-t-morocco/", "emails": ["terrym@maine.edu"], "phones": ["207-778-7050"], "departments": ["STEM"], "titles": ["Part Time Faculty"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Mary", "last_name": "Dindorf", "biography": "Mary Dindorf has been the Instructional Designer at UMF’s Teaching and Learning Collaborative since 2020. She works with faculty on course design, strategies for teaching, and supports faculty with their use of the university’s educational technology.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/mary-dindorf-2/", "emails": ["mary.dindorf@maine.edu"], "phones": ["207-778-7500"], "departments": ["Teaching & Learning Collabortv"], "titles": ["Instructional Designer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Mary", "last_name": "Sylvia", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/mary-e-sylvia/", "emails": ["mary.orourke@maine.edu"], "phones": ["207-778-7050"], "departments": ["Sweatt Winter Childcare Center"], "titles": ["Head Preschool Teacher"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Mary", "last_name": "Sinclair", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/mary-sinclair/", "emails": ["mary.sinclair@maine.edu"], "phones": ["207-778-7140"], "departments": ["Athletics"], "titles": ["Head Women's Field Hockey Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Matthew", "last_name": "McCourt", "biography": "Matt McCourt is a cultural geographer with a background in GIS and community planning. He teaches courses on landscape, planning, GIS, geographic concepts and globalization. Matt’s current research with the UMF/Rangeley Sustainability Project (funded by the Maine Sustainability Solutions Initiative) involves working with students and community partners to understand how people take care of their local economies, cultures and ecological communities. Matt and his students use surveys and participatory mapping techniques in the field, create beautiful web and paper maps with GIS, programming tools and graphics applications, and present their research at regional and national conferences. Matt is also working on a book project applying active learning strategies to the study of North American landscapes.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/matthew-mccourt/", "emails": ["matthew.mccourt@maine.edu"], "phones": ["207-778-7044"], "departments": ["Geography"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Meghan", "last_name": "Price", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/meghan-price/", "emails": ["meghan.price@maine.edu"], "phones": ["207-778-7110"], "departments": ["Recreation"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Melissa", "last_name": "Kelly", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/melissa-l-kelly/", "emails": ["melissa.l.kelly@maine.edu"], "phones": ["207-778-7050"], "departments": ["STEM"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Melissa St.", "last_name": "Pierre", "biography": "Dr. Melissa St. Pierre moved to Maine a few years back from the City of Brotherly Love, Philadelphia. She spent a large part of her career at the Community College of Philadelphia, where she was a tenured professor of psychology. Prior to that, she held several positions related to advising and counseling at various universities. Outside of work, she is a certified yoga teacher and owns a small business, Honeybee Healing Hive, LLC.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/melissa-st-pierre/", "emails": ["melissa.st1@maine.edu"], "phones": ["207-778-7476"], "departments": ["VP for Academic Affairs"], "titles": ["Dir"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Melissa", "last_name": "Thompson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/melissa-thompson/", "emails": ["melissa.thompson@maine.edu"], "phones": ["207-778-7571"], "departments": ["Performing Arts"], "titles": ["Assistant Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Melissa", "last_name": "Clawson", "biography": "Dr. Mellisa Clawson specializes in creative arts, science education, and infant-toddler development, along with early intervention and inclusive practices for young children with special needs. Dr. Clawson partners with educators nationwide, helping them craft effective strategies for children with sensory and autism spectrum disorders. Her commitment to hands-on learning even led her to conquer seasickness while researching a co-authored book. She braved the Alabama coast on a shrimp boat to help rural teachers develop a captivating, place-based science curriculum. When she’s not educating the minds of her college students, Dr. Clawson is dreaming of her next adventurous endeavor.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/mellisa-clawson/", "emails": ["mellisa.clawson@maine.edu"], "phones": ["207-778-7168"], "departments": ["Early Childhood Education Special Edication"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Meredith", "last_name": "Swallow", "biography": "Dr. Meredith Swallow is an Associate Professor of Elementary Education. She holds a PhD in Educational Leadership and Policy Studies from the University of Vermont with a research focus on educational technology. Dr. Swallow taught for many years as a mathematics teacher focused on engaged and active learning by supporting the connection of knowledge with application and creativity. Her current teaching and research centers on supporting pre-service teachers and in-service graduate-level educators in developing, and engaging with, innovative teaching practices that support active, learner-driven environments, and effective technology integration.", "orcid": "https://orcid.org/0000-0001-6241-9462", "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/meredith-swallow/", "emails": ["meredith.swallow@maine.edu"], "phones": ["207-778-7180"], "departments": ["Middle & Secondary Education"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Merit", "last_name": "Bean", "biography": "Merit “Buzz” Bean joins the UMF staff after coaching both the Alpine and Nordic teams at Mt. Abram High School for more than 30 years, where he has always enjoyed a successful teaching career. Bean’s teams have won numerous Conference and State Championships.\n\nHe has been the President of the Maine Ski Coaches Association for more than 30 years and served as the liaison to the Maine Principals Association Ski Committee. Bean was also involved in the formation of the New England Nordic Ski Association and served as head of the Junior Committee, which led him to be a part of the Athlete Development Committee.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/merit-bean/", "emails": ["merit.bean@maine.edu"], "phones": ["207-778-7050"], "departments": ["Athletics"], "titles": ["Head Nordic Skiing Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Michael", "last_name": "Colella", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/michael-a-colella/", "emails": ["michael.colella@maine.edu"], "phones": ["207-778-7050"], "departments": ["Fitness and Recreation Center"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Michael", "last_name": "Rackliff", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/michael-a-rackliff/", "emails": ["michael.rackliff@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Michael", "last_name": "Adcock", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/michael-c-adcock/", "emails": ["michael.adcock@maine.edu"], "phones": ["207-778-7400"], "departments": ["Public Safety"], "titles": ["Police Sergeant"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Michael", "last_name": "Johnson", "biography": "Professor Johnson teaches courses in American literature, film studies, multicultural literature, and African American literature. Recent courses include African American Literature and Culture, Popular Genres, The Splendid Drunken Twenties, and A History of the Horror Film. He also claims to be the English Department’s resident expert on surviving the Zombie Apocalypse. His book publications include “Can’t Stand Still: Taylor Gordon and the Harlem Renaissance,” “A Black Woman’s West: The Life of Rose B. Gordon,” and “Speculative Wests: Popular Representations of a Region and a Genre.” He is also a co-editor of two anthologies of criticism: “Weird Westerns: Race, Gender, Genre,” and “Hell-Bent for Leather: Sex and Sexuality in the Weird Western.”", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/michael-k-johnson/", "emails": ["michael.johnson@maine.edu"], "phones": ["207-778-7424"], "departments": ["English"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Michael", "last_name": "Schoeppner", "biography": "Professor Schoeppner studies the history of race, migration, and law, especially in the United States. He is currently working on his second book, a history of the invention of illegal immigration. His courses include the American Revolution, Civil War and Reconstruction, and American Legal History, among others. He also teaches courses in the Honors Program, most of which explore the representation of history in film, video games, and commemoration ceremonies. When not cheering on his Florida Gators or Chelsea Football Club, he enjoys playing volleyball, skiing, playing chess, and traveling.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/michael-schoeppner/", "emails": ["michael.schoeppner@maine.edu"], "phones": ["207-778-7456"], "departments": ["History"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Mick", "last_name": "Kaminsky", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/mick-v-kaminsky/", "emails": ["mick.kaminsky@maine.edu"], "phones": ["207-778-7050"], "departments": ["Athletics"], "titles": ["Athletic Trainer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Misty", "last_name": "Beck", "biography": "Dr. Beck coordinates the Learning Commons, a space dedicated to fostering student success through peer tutoring and academic coaching. She believes the right to an education is as vital for survival today as the right to common land once was, a conviction rooted in her doctoral research on the historic loss of these rights in England. Guided by the principle that learning is a process of growth and self-discovery, she hires, trains, and mentors a staff of 50 student employees, loving to watch them and those they tutor flourish. Away from work, Dr. Beck keeps her own New England traditions alive. She’s a passionate gardener, a nature poet, an avid contradancer, and an unpolished fiddle player. Her dog, Scout, tolerates the music but loves walking rural lanes with her best.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/misty-beck/", "emails": ["misty.beck@maine.edu"], "phones": ["207-778-7765"], "departments": ["Teaching & Learning Collabortv"], "titles": ["Coordinator"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Misty", "last_name": "Krueger", "biography": "Dr. Krueger teaches courses in English, gender studies, monster studies, and 18th-century literature. They specialize in Jane Austen and William Shakespeare. They have edited a book: Transatlantic Women Travelers, 1688-1843. They have published many essays on Austen and other subjects and are writing a book: Jane Austen’s Monsters.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/misty-krueger/", "emails": ["misty.krueger@maine.edu"], "phones": ["207-778-7473"], "departments": ["English"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Mitchell", "last_name": "Ada", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/mitchell-adams/", "emails": ["mitchell.adams1@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Molly", "last_name": "Callahan", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/molly-m-callahan/", "emails": ["molly.callahan@maine.edu"], "phones": ["207-778-7221"], "departments": ["Library"], "titles": ["Library Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Molly", "last_name": "Wilkie", "biography": "Molly Wilkie became the UMF Head coach of Women’s Soccer in 2008. She also coached the UMF Women’s Lacrosse program through the 2015 season and qualified for the North Atlantic Conference postseason seven times.\n\nShe was named the North Atlantic Conference Women’s Soccer Coach of the Year in 2010, after leading the UMF Beavers to a 6-1-0 conference record. Under her helm, UMF Women’s Soccer athletes have captured 33 All-NAC awards and UMF junior Kayla Tuttle was named an NSCAA All-New England Region selection. The 2012 squad posted a double-digit win total for the first time since 2007, and advanced to the NAC Tournament semifinals for the fourth time in five seasons. In 2013, Wilkie coached the NAC women’s soccer player of the year, Kayla Tuttle.\n\nFrom 2013-2019, Willkie’s teams have compiled a 35-21-4 record during conference games. She led the 2018 team to a 5-2 Conference record and won the NAC Championship. The following year, her team finished with a 5-2-1 conference record and were the 2019 NAC runners-up.\n\nWilkie is a former Women’s Soccer player at UMF and played for the Beavers in 2004 and 2005. A starter in the backfield, Wilkie appeared in 40 games over two seasons with three goals and three assists. A leader on and off the field, Wilkie was captain of the 2005 team and named to the All-North Atlantic Conference Second and the NAC All-Tournament Team.\n\nWilkie transferred to UMF from the University of Southern Maine where she was an All-Little East Conference First Team and All-New England First Team choice in 2000 and All-LEC Second Team in 2001.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/molly-wilkie/", "emails": ["molly.wilkie@maine.edu"], "phones": ["207-778-7529"], "departments": ["Athletics"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Monica", "last_name": "Campbell", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/monica-a-campbell/", "emails": ["monica.campbell@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Monica", "last_name": "Smith", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/monica-j-smith/", "emails": ["monica.j.smith@maine.edu"], "phones": ["207-778-7502"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Natasha", "last_name": "Lekes", "biography": "As a therapist, teacher, and researcher, Natasha Lekes is passionate about the role that psychology can play in helping people to live more satisfying and fulfilling lives. Her practice as a psychologist has included individual counseling, couples therapy, and sex therapy. She feels privileged to guide students in exploring questions on how mental disorder is defined and treated, views on death and dying, and approaches to mental health and well-being. Dr. Lekes’ research has examined the relationship between values and happiness. Her work is most recently published in the Journal of Positive Psychology .", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/natasha-lekes/", "emails": ["natasha.lekes@maine.edu"], "phones": ["207-778-7287"], "departments": ["Psychology"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Nate", "last_name": "Carson", "biography": "Women’s Basketball Coach Nate Carson began coaching with the UMF Men’s program in the 2014-2015 season, learning under the tutelage of legendary UMF coaches Dick Meader and Jim Bessey. Carson has been a part of the program ever since.\n\nBefore coaching, Carson was a member of the UMF Men’s Basketball program from 2010 to 2014. A three-year starter, Carson helped his team host the North Atlantic Conference (NAC) Tournament as well as contributing to a 21-6 record in his junior year. In his senior year, he helped the Beavers make it to the NAC Championship.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/nate-carson/", "emails": ["nathan.s.carson@maine.edu"], "phones": ["207-778-7147"], "departments": ["Athletics"], "titles": ["Head Women's Basketball Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Neil", "last_name": "Hart", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/neil-j-hart/", "emails": ["neil.hart@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Nena", "last_name": "Cunningham", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/nena-m-cunningham/", "emails": ["nena.cunningham@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Nicholas", "last_name": "Koban", "biography": "Nicholas Koban has been a mathematics professor at UMF since 2006, and he teaches a wide variety of courses in the mathematics major as well as for other disciplines. He is interested in studying sets on which algebra can be performed (not necessarily sets of numbers), but uses geometry to study these algebraic sets instead of algebra. Each year he hires a research assistant to help with studying these algebraic objects. These students will usually assist in his research projects along with working on their own individual project.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/nicholas-koban/", "emails": ["nicholas.koban@maine.edu"], "phones": ["207-778-7117"], "departments": ["Mathematics"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Nicholas", "last_name": "Richards", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/nicholas-t-richards/", "emails": ["nicholas.richards@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Asst Dir"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Nicole Coffey", "last_name": "Kellett", "biography": "Professor Nicole Kellett is originally from Nebraska, but has moved throughout much of the country before landing in Maine. She teaches courses in environmental justice, medical anthropology, gender, Latin America, methods, and theory, among others. Her research centers primarily on economic development, war and reconciliation in Peru; women and the criminal legal system in the United States; and HIV/AIDS-related stigma in Uganda. Outside of work, Professor Nicole Kellett enjoys adventuring in the outdoors with family and friends with a perpetual goal of becoming more musical.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/nicole-coffey-kellett/", "emails": ["nicole.kellett@maine.edu"], "phones": ["207-778-7433"], "departments": ["Global Studies"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Nigel", "last_name": "Fung-A-Fat", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/nigel-i-fung-a-fat/", "emails": ["nigel.fungafat@maine.edu"], "phones": ["207-778-7064"], "departments": ["Athletics"], "titles": ["Athletic Trainer/S&C"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Nikia", "last_name": "Dixon", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/nikia-l-dixon/", "emails": ["nikia.dixon@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Noah", "last_name": "Carroll", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/noah-e-carroll/", "emails": ["noah.carroll@maine.edu"], "phones": ["207-778-7050"], "departments": ["Athletics"], "titles": ["Assist Womens Basketball Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Noel", "last_name": "Wilson", "biography": "Noel Wilson is the Director of Field Services. He holds an M. Ed in Educational Leadership and Administration from Regis University. He also holds a B.A. in Psychology and a B.S. in Early Childhood Education. Noel taught for many years at the elementary school level, as well as serving as a Building Administrator. Noel’s passions are in the areas of Early Literacy Development, Mindfulness Integration and Leadership Development.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/noel-p-wilson/", "emails": ["noel.wilson@maine.edu"], "phones": ["207-778-7171"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Noelle", "last_name": "Dubay", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/noelle-v-dubay/", "emails": ["noelle.dubay@maine.edu"], "phones": ["207-778-7429"], "departments": ["TRIO Johnson Scholars"], "titles": ["Academic Advisor and Assessment Specialist"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Normand", "last_name": "Lacasse", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/normand-s-lacasse/", "emails": ["normand.lacasse@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Palo", "last_name": "Shelton", "biography": "Paloma Shelton graduated Magna cum laude in the University of Maine at Farmington Class of 2025 as a university honors scholar with a double major in Outdoor Recreation Business Administration and a self-designed major in Sustainability and Artificial Intelligence. Paloma was a varsity athlete on the alpine ski team and served as captain for two seasons. Her honors thesis, Redefining Readiness: Higher Education’s Role in an AI World , led to strategic work with both UMF and the University of Maine System on AI implementation in higher education. Next for Paloma is living in New York City and working at Umbrage, a craft-based digital studio building end-to-end digital products.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/paloma-shelton/", "emails": [], "phones": ["207-778-7050"], "departments": [], "titles": [], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Pamela", "last_name": "Mitchel", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/pamela-a-mitchel/", "emails": ["mitchel@maine.edu"], "phones": ["207-778-7050"], "departments": ["STEM"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Patricia", "last_name": "Gordon", "biography": "Patty Gordon has lived in Maine for 35 years and was a middle school teacher for most of them before coming to UMF. She teaches courses in Education and advises Elementary Education majors. Patty instructs/supervises field courses for all Education majors including Practicum, Advanced Practicum and Student Teaching. When she’s not working, Patty enjoys being outdoors hiking, swimming, xc skiing, gardening and walking in the woods with family and friends. She likes learning new things, and next on her list is learning to play the cello.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/patricia-gordon/", "emails": ["patricia.gordon@maine.edu"], "phones": ["207-778-7163"], "departments": ["Elementary Education"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Patricia", "last_name": "Willia", "biography": "Dr. Williams teaches undergraduate and graduate courses in early childhood education across face-to-face, online, and hybrid modalities. Her research and grants focus on practical solutions to educational challenges, particularly through university-community collaborations, informed by her interdisciplinary Ph.D. in Applied Child Development. She is a native of Western New York and was a first-generation college student. In her spare time she enjoys volunteering in her community, serving on the board of a local children’s play museum and designing exhibits.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/patricia-williams/", "emails": ["patricia.h.williams@maine.edu"], "phones": ["207-778-7109"], "departments": ["Early Childhood Education"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Patrick", "last_name": "Kelley", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/patrick-r-kelley/", "emails": ["patrick.r.kelley@maine.edu"], "phones": ["207-778-7295"], "departments": ["Learning Assistance Center"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Paul", "last_name": "Knowles", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/paul-d-knowles/", "emails": ["paul.d.knowles@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Part-Time Faculty"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Paul", "last_name": "Gies", "biography": "Paul Gies likes to say that while he wasn’t actually born on Pluto, his home asteroid was destroyed by Zerkons. He likes to say that after receiving his English degree from Iowa, he applied for graduate school in English, but he put down the wrong code number and ended up in mathematics. Every time he went to change majors, the line was too long, so Gies wound up staying in math. It’s easier than trying to explain how a child of a historian parents, born in Connecticut, wound up with a BA in English from Iowa and a math PhD from Illinois, and found a job teaching in Maine. In truth, the job announcement from UMF looked amazing; the job turned out to be even better than it had looked; and once here, he realized he was in the right place to teach, to mentor students, and to write.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/paul-gies/", "emails": ["paulgies@maine.edu"], "phones": ["207-778-7119"], "departments": ["Mathematics"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Peter", "last_name": "Hardy", "biography": "Dr. Peter Hardy was born in the month of December, in the little town of Bethlehem...Pennsylvania. Since then he has climbed Mt. Kenya on Christmas, slapped a seal in New Zealand, narrated a novel in Maine, snorkeled with sharks in Belize, betrothed a bride in Beijing, rode rapids in Bali, deferred a diploma in Mexico, rescued a rhesus in Rwanda, serenaded a street corner in Prague, and clutched a crocodile in Thailand. Exactly one of those exploits is untrue. He is currently teaching mathematics and zen, putting poetry to music and creating a sustainable lifestyle while living the dream with his family on Rainbow Farm in West Farmington.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/peter-hardy/", "emails": ["peter.hardy@maine.edu"], "phones": ["207-778-7528"], "departments": ["Mathematics"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Quinn", "last_name": "Richardson-Newton", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/quinn-l-richardson-newton/", "emails": ["quinn.richardsonnewton@maine.edu"], "phones": ["207-778-7148"], "departments": ["Athletics"], "titles": ["Head Men's Basketball Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Rachel", "last_name": "Hovel", "biography": "Dr. Rachel Hovel is an aquatic ecologist who studies fishes and invertebrates across a range of freshwater habitats. Major themes of her research include species interactions, the timing of ecological events, and biodiversity of species and life histories. In particular, she is interested in how changes to freshwater environments–especially climate change–influence aquatic organisms and ecosystems. Rachel’s work takes place in Alaska, the Canadian Arctic, and the lakes of Maine. Visit her website for more information: rachelhovel.wordpress.com", "orcid": "https://orcid.org/0000-0002-3452-9485", "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/rachel-hovel/", "emails": ["rachel.hovel@maine.edu"], "phones": ["207-778-7401"], "departments": ["Environmental Science"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ralph", "last_name": "Parsons", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ralph-a-parsons/", "emails": ["ralph.parsons@maine.edu"], "phones": ["207-778-7249"], "departments": ["Administrative Systems"], "titles": ["Accounting Support Spclst CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Rebecca", "last_name": "Brinegar", "biography": "Rebecca joined the Athletics Staff in 2021 and became the ACSUM union representative for the Farmington campus in 2023. While not particularly athletic herself, she does enjoy watching student athletes excel in their chosen sport(s). GO BEAVERS!", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/rebecca-j-brinegar/", "emails": ["rebecca.brinegar@maine.edu"], "phones": ["207-778-7147"], "departments": ["Athletics"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Rebecca", "last_name": "Rackliff", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/rebecca-j-rackliff/", "emails": ["rebecca.nichols@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Renee", "last_name": "Repsher", "biography": "Renee has been a member of the Merrill Center team since January of 2022. She enjoys spending time with family, exploring trails with her two dogs, and curling up with a good book.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/renee-a-repsher/", "emails": ["renee.repsher@maine.edu"], "phones": ["207-778-7103"], "departments": ["Merrill Ctr Student Services"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Rhonda", "last_name": "Jamison", "biography": "Dr. Jamison is interested in human motivation, especially as it relates to students and school. She has investigated academic motivation in adolescents and college students. She regularly teaches Child and Adolescent Development, as well as several core Psychology courses. Outside of work, Dr. Jamison loves to hang out with her husband and young daughter.", "orcid": "https://orcid.org/0000-0003-1223-2848", "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/rhonda-jamison/", "emails": ["rhonda.jamison@maine.edu"], "phones": ["207-778-7885"], "departments": ["Psychology"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Rhonda", "last_name": "Bryant", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/rhonda-m-bryant/", "emails": ["bryantr@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Administrative Spclst(Conf)CL3"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Rob", "last_name": "Stratton", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/rob-a-stratton/", "emails": ["rob.stratton@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Robert", "last_name": "Grant", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/robert-c-grant/", "emails": ["robert.c.grant@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Robert", "last_name": "Hollis", "biography": "Robert Hollis, a former three-year captain for the University of Maine at Farmington cross country and track & field teams, rejoined the Beavers as an assistant coach in October 2021.\n\nHollis was a standout distance runner for the Beavers during his time at UMF. He was named the North Atlantic Conference (NAC) Runner of the Year in 2015 and was named first-team All-Conference three times from 2015 to 2017. Hollis still holds records for Track and Field in the 1500m, 5k, and 10k events.\n\nRecently he competed in the 2021 Maine Marathon and finished in eighth place with a time of 2:37:58.\n\nHollis is a 2018 graduate of UMaine-Farmington with a degree in community health education. He is currently a personal endurance coach, helping athletes prepare for races from 5k up to a full marathon.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/robert-hollis/", "emails": ["robert.hollis@maine.edu"], "phones": ["207-778-7147"], "departments": ["Athletics"], "titles": ["Head Men's and Women's Cross Country Coach"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Robert", "last_name": "Rogers", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/robert-j-rogers/", "emails": ["robert.j.rogers@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ronald", "last_name": "Smith", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ronald-l-smith-jr/", "emails": ["ron.smith@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Mech Specialist HVAC CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ruth", "last_name": "Archer", "biography": "I work on the front line of the Merrill Center helping students with Records & Registration and Student Accounts. In my spare time I love to garden, do crafts, and spend time with my three grandsons.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ruth-e-archer/", "emails": ["rarcher@maine.edu"], "phones": ["207-778-7237"], "departments": ["Merrill Ctr Student Services"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Ryan", "last_name": "Thompson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/ryan-m-thompson/", "emails": ["ryan.m.thompson@maine.edu"], "phones": ["207-778-7064"], "departments": ["Athletics"], "titles": ["Head Athletic Trainer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Sally", "last_name": "Beaulieu", "biography": "Professor Beaulieu is a Maine native and UMF alumnus (Class of 1991). Her primary responsibility at UMF is supervising education students in their field experiences. Outside of work, she enjoys reading, quilting, knitting, and walking with her golden retriever, Bruce.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/sally-beaulieu/", "emails": ["sally.beaulieu@maine.edu"], "phones": ["207-441-4612"], "departments": ["Middle & Secondary Education"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Sandra", "last_name": "Titcomb", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/sandra-m-titcomb/", "emails": ["sandra.duplisea@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Sarah", "last_name": "Carnahan", "biography": "Sarah is a Licensed Clinical Social Worker, UMF alum (’06), and serves as the Director of UMF’s Mental Health & Counseling Services. In addition to her MSW, Sarah has a Master’s in Women’s, Gender, and Sexuality Studies, both from The Ohio State University. She is also President of The Eating Disorders Association of Maine. Outside of the office, Sarah is passionate about performing in community theater and spoiling her numerous pets.\n\nSarah graduated from UMF in 2006, with a B.A. in Women’s Studies, and a minor in \nPsychology. After graduation, Sarah attended The Ohio State University, where she received an \nM.A. in Women’s, Gender, and Sexuality Studies, and a Master’s in Clinical Social Work. While \nat OSU, Sarah also taught courses in the Dept of Women’s Studies and completed an internship \nin the counseling center. Prior to returning to UMF, Sarah worked as a therapist in Lewiston and \nRumford, Maine. Sarah works with a wide variety of concerns, including trauma, anxiety, eating \ndisorders/body image, sexuality, gender, life events/transitions, race/ethnicity, and academic \nchallenges.\n\nEmail umfcounseling@maine.edu or call 207-778-7034 during open hours to schedule an \nappointment. All students with billable insurance can have up to three visits per semester \nwithout a co-pay charge. After three visits, you will be charged the co-pay amount associated \nwith your insurance plan. Students with insurance that we cannot bill or who fail to present a \nhealth insurance card will be charged $20 for every visit. Students who have not met their annual \ninsurance deductible or if your insurance company denies a submitted claim, will be charged $20 \nfor the office visit. Students never have to pay up-front for services; they may have any charges \nadded to their student account.\n\nAccountability \nAny dissatisfaction or complaints may be registered by contacting Any dissatisfaction or \ncomplaints may be registered by contacting Christine Wilson, Vice President of Student Affairs \nand Enrollment Management or the State Board of Social Worker Licensure, 35 State House \nStation Augusta, (207) 624-8623.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/sarah-carnahan/", "emails": ["sarah.carnahan@maine.edu"], "phones": ["207-778-7091"], "departments": ["Center for Student Develoment"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Sarah", "last_name": "Balascio", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/sarah-j-balascio/", "emails": ["sarah.balascio@maine.edu"], "phones": ["207-778-7050"], "departments": ["STEM"], "titles": ["Part-Time Faculty"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Sarah", "last_name": "Otley", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/sarah-m-otley/", "emails": ["sotley@maine.edu"], "phones": ["207-778-8130"], "departments": ["Library"], "titles": ["Library Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Sarah", "last_name": "Maline", "biography": "Sarah fell in love with holography as a medium for art as an undergraduate at Lake Forest College. At UT Austin she explored kabuki-inspired 18th-century Japanese courtesan prints for her MA thesis, then returned to holography for her doctoral dissertation. Because there was a wonderful Japanese film series featuring Ozu and other Japanese greats at Hogg Auditorium across those years–starring Austin’s local community of adorable Mexican Freetail bats flapping across the screen at critically interesting and emotionally charged moments–she became interested in the phenomenology of cinematic experience and other aspects of film theory, leading her back to the strange place of the viewer in different forms of holography and contemporary art. Sarah wants her students to explore connections across disciplines and interests. No bats required, though there are scholarly Little Brown bats on the 4th floor of Merrill happy to collaborate!", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/sarah-maline/", "emails": ["maline@maine.edu"], "phones": ["207-778-7321"], "departments": ["Visual Arts"], "titles": ["Associate Professor Art History/Gallery Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Sarah", "last_name": "Sloane", "biography": "Sarah A. Sloane is an avian behavioral ecologist specializing in the evolution of complex social systems, primarily cooperative breeding systems. Her current research focuses on the complex social system of the American Bushtit (Psaltriparus minimus) in Portland, Oregon. This year marks the 39th year Sarah has been studying bushtits, beginning in 1986 in southwestern Arizona for 25 years, with a brief foray into Washington State before migrating to Portland, Oregon in 2016. At UMF, Sarah greatly enjoys teaching behavioral ecology at all levels and has a special interest in mentoring undergraduate students by including them in her own research as well as guiding them in their own. Outside of work she enjoys hiking, making music, painting, and spending time with her adorable grandson.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/sarah-sloane/", "emails": ["sloane@maine.edu"], "phones": ["207-778-7484"], "departments": ["Biology"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Scott", "last_name": "Dalton", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/scott-e-dalton/", "emails": ["scott.e.dalton@maine.edu"], "phones": ["207-778-7400"], "departments": ["Public Safety"], "titles": ["Police Officer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Scott", "last_name": "Erb", "biography": "Professor Erb teaches courses on international relations, American foreign policy and political philosophy. His research interests include German foreign policy and the European Union. Professor Erb is fluent in German and working hard to learn Italian. He was born in Minnesota and grew up in South Dakota, but has been at UMF since 1995.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/scott-erb/", "emails": ["scotterb@maine.edu"], "phones": ["207-778-7486"], "departments": ["Political Science"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Scott", "last_name": "Ladd", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/scott-w-ladd/", "emails": ["scott.ladd@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Structural Spclst Painter CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Sean", "last_name": "Cabaniss", "biography": "Coach Cabaniss is a UMF alum ‘17 (Applied Mathematics and Secondary Education) and was a cofounder of the UMF Track & Field program during his time at UMF. After attending Smith College for a masters in Exercise and Sport Studies, he returned to UMF to takeover the program, and helped lead the Beavers to their first NAC Track titles in program history (‘25). He lives in Pittsfield with his wife and two golden retrievers. Go Beavers!", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/sean-cabaniss/", "emails": ["sean.cabaniss@maine.edu"], "phones": ["207-778-8153"], "departments": ["Athletics"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Shannon", "last_name": "Larsen", "biography": "Dr. Shannon Larsen was born and raised near Toronto, Canada. She received her B.A. from Middlebury College, VT. She majored in Russian and minored in both French and Elementary Education. After spending a year teaching 2nd grade in Cali, Colombia, Dr. Larsen returned to the United States. She received her Ed. M from Harvard Graduate School of Education where she studied International Education. Dr. Larsen spent several years as a 5th grade teacher in a town north of Boston and eventually became the district’s elementary mathematics coach. She also spent one year teaching 7th grade math. In 2012, Dr. Larsen graduated from the University of Toronto with a Ph.D in Curriculum, Teaching, and Learning. Her research focuses on professional learning for elementary school teachers and collaborative classroom practices. In her free time, she loves to travel, read, and spend time with friends and family.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/shannon-larsen/", "emails": ["shannon.larsen@maine.edu"], "phones": ["207-778-7167"], "departments": ["Elementary Education"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Shari", "last_name": "Witham", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/shari-l-witham/", "emails": ["switham@maine.edu"], "phones": ["207-778-7425"], "departments": ["Arts & Humanities"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Shawn", "last_name": "Durrell", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/shawn-durrell/", "emails": ["shawn.durrell@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Lead Fac Maint Worker CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Sheena", "last_name": "Bunnell", "biography": "Sheena Bunnell teaches courses in Business Economics with an emphasis on application in applied quantitative research, healthcare, consumer trends, and current economic events. Her classes are interactive and engage students in real world business applications that focus on international and domestic markets. Business goes beyond borders and understanding global interdependence is vital for future enterepreneurs and financiers whether they are working for their own small business or a Fortune 500 company . For example, in Consumer Behavior students learn the importance of business to consumer relations and engage in the understanding of the U.S. consumer as they navigate the $16 Trillion U.S. economy. She works collaboratively with students on healthcare research projects and supervises student internships. Her passion for teaching is like her passion for gardening where it is very fulfilling to watch a student grow and blossom.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/sheena-bunnell/", "emails": ["sbunnell@maine.edu"], "phones": ["207-778-7440"], "departments": ["Business Administration"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Shelley", "last_name": "Hickey", "biography": "Shelley joined the UMF community in 2017. She is a Maine native who brought vast knowledge in adolescent and young adult medicine to her position. Her background includes experience working for the State of Maine Bureau of Health, leadership positions at Maine Medical Association and Maine Ambulatory Care Coalition, and experience providing rural primary health care and school based health care at various middle and high schools in central Maine. Shelley delivers competent and compassionate health care and education with a holistic approach. She focuses on individualized assessment of physical, psychological, and social dimensions for effective implementation of specialized plans of care.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/shelley-hickey/", "emails": ["shelley.hickey@maine.edu"], "phones": ["207-778-7200"], "departments": ["Health Center"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Shyla", "last_name": "Sodones", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/shyla-a-sodones/", "emails": ["shyla.sodones@maine.edu"], "phones": ["207-778-7050"], "departments": ["Sweatt Winter Childcare Center"], "titles": ["Asst Teacher Infant/Toddler"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Sophia", "last_name": "Hawkins", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/sophia-s-hawkins/", "emails": ["sophia.hampton@maine.edu"], "phones": ["207-778-7437"], "departments": ["Fitness and Recreation Center"], "titles": ["Lifeguard Per-Diem"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Stanley", "last_name": "Spilecki", "biography": "Stan has been in the theater his entire adult life, even when working in other industries. After earning his BA as a double major in English and theater from Providence College he free-lanced extensively in Providence, RI with companies such as 2nd Story Theatre, Trinity Rep, and Opera RI. He was the resident designer/TD for the critically acclaimed Wickenden Gate Theatre for three seasons. Other regional theaters that he designed worked with include Triangle Theater of Boston, Goodspeed Opera House and Long Wharf Theatre in Connecticut. He has designed for The Public Theatre in Lewiston, Maine, Community Little Theater in Auburn and was a co-founder, resident designer/TD, and occasional actor in the multiple New England Theater Conference Moss Hart award winning Out of the Box Theater Company in Lewiston, ME. He has been the Resident Designer/TD of University of Maine-Farmington’s Alumni Theater and Emery Community Art Center since 2011.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/stanley-spilecki/", "emails": ["stanley.spilecki@maine.edu"], "phones": ["207-778-7862"], "departments": ["Emery Arts Center"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Stephen", "last_name": "Grandchamp", "biography": "Stephen Grandchamp teaches courses in the digital humanities and British literature. He also is the Co-Director of the New Commons Project and Manager of the Digital Humanities Lab. His current book project, Accounting for Failure: Arrested Development and the British Bildungsroman, 1805-1891 , examines failure as a counterpoint to pervasive notions of success and development across nineteenth-century narrative genres. His research also includes bibliometric analysis of literary texts and the integration of streaming media into the literature classroom.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/stephen-grandchamp/", "emails": ["stephen.grandchamp@maine.edu"], "phones": ["207-778-7963"], "departments": ["English"], "titles": ["Assistant Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Steven", "last_name": "Pane", "biography": "Steven Pane’s career as a pianist and conductor emerges out of his life-long interest in the interdisciplinary study and performance of music. At UMF his work often involves collaborations such as the Celestial Emporium with poet Jeff Thompson and artist Dawn Nye; Intertextuality, Bakhtin, and Ives’s Concord Sonata with Tiane Donahue; or Bach’s Goldberg Variations and Stories with author Pat O’Donnell. Most recently, Pane gave the American premier of Ana-Maria Avram’s Musique pour Mallarme, at Harvard and UMF in 2010, and shares Avram and her partner Iancu Dumitrescu’s interest in phenomenology and music. Dr. Pane has performed at universities and in major halls throughout the country including the Academy of Music in Philadelphia, Aaron Davis Hall in New York City, Davies Hall in San Francisco, and the Kennedy Center for the Performing Arts.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/steven-pane/", "emails": ["pane@maine.edu"], "phones": ["207-778-7288"], "departments": ["Performing Arts"], "titles": ["Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Steven", "last_name": "Quackenbush", "biography": "Originally from the San Francisco Bay Area, Dr. Steven Quackenbush completed his Ph.D. in social-personality psychology at Kansas State University in 1996. As a UMF faculty member, Dr. Quackenbush has taught a broad range of courses, including General Psychology (PSY 101), Adulthood and Aging (PSY 226), and Cognitive Psychology (PSY 314). His scholarly interests include the history of psychology and narrative approaches to the study of lifespan personality development. Dr. Quackenbush’s recent publications have explored issues relevant to the narrative structure of personal identity as well as the general problem of theoretical unification in the social sciences. Of his various accomplishments, Dr. Quackenbush is especially proud of his long track record of involving undergraduate students in original research.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/steven-quackenbush/", "emails": ["steven.quackenbush@maine.edu"], "phones": ["207-778-7518"], "departments": ["Arts & Science, Professor of Psychology"], "titles": ["Dean"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Susan", "last_name": "Boyce-Cormier", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/susan-a-boyce-cormier/", "emails": ["susan.boycecormier@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Susan", "last_name": "Enman", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/susan-j-enman/", "emails": ["enman@maine.edu"], "phones": ["207-778-7243"], "departments": ["Merrill Ctr Student Services"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Thad", "last_name": "Lacasse", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/thad-a-lacasse/", "emails": ["thad.lacasse@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Thomas", "last_name": "Jessen", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/thomas-a-jessen/", "emails": ["thomas.jessen@maine.edu"], "phones": ["207-778-7050"], "departments": ["Arts & Humanities"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Tiffany", "last_name": "Wing", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/tiffany-j-wing/", "emails": ["tiffany.wing@maine.edu"], "phones": ["207-778-7200"], "departments": ["Health Center"], "titles": ["Administrative Specialist CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Timothy", "last_name": "Burnell", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/timothy-a-burnell/", "emails": ["timothy.burnell@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Timothy", "last_name": "Young", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/timothy-a-young/", "emails": ["timothy.young@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Timothy", "last_name": "Breton", "biography": "Dr. Timothy Breton is a fish physiologist with expertise in reproductive development and applications to fisheries and aquaculture (fish farming). His research efforts have focused on understanding reproduction in several commercially important species, including Atlantic cod, black sea bass, summer flounder, and alewives. Dr. Breton also utilizes many modern molecular techniques to understand egg development, sex change, and sex differentiation in fishes, including quantitative PCR (qPCR) and genomics approaches. He has interests in all things related to fish or molecular biology, and is always looking to apply modern genetic techniques to new ecological or physiological questions.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/timothy-breton/", "emails": ["timothy.breton@maine.edu"], "phones": ["207-778-7364"], "departments": ["Biology"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Tori", "last_name": "Lands", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/tori-j-lands/", "emails": ["tori.lands@maine.edu"], "phones": ["207-778-7050"], "departments": ["College of Education and Rehab"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Tracye", "last_name": "Fortin", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/tracye-c-fortin/", "emails": ["tracye.fortin@maine.edu"], "phones": ["207-778-7050"], "departments": ["Assoc Provost/Dean of Educ"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Vic", "last_name": "Williamson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/vic-g-williamson/", "emails": ["vic.williamson@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Victoria Scanlan", "last_name": "Stefanakos", "biography": "Victoria graduated from the University of Pittsburgh with a bachelor’s degree in English Writing. After years of outdoor and local newspaper adventures out west, she earned her master’s degree in Magazine Journalism from Columbia University. She has worked as a national affairs correspondent for Newsweek, a senior editor at Working Mother, and is a longtime contributor to national media outlets. For the past several years, she has specialized in strategic marketing and thought leadership for start-ups and Fortune 100 companies.\n\nThese days, Victoria lives with the younger of her two sons, an alpine racer at Carrabassett Valley Academy, in a charming but drafty log cabin in Wyman. She loves cooking (and eating) with friends and family, making and fixing things, and going places —especially outdoors.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/victoria-scanlan-stefanakos/", "emails": ["victoria.stefanakos@maine.edu"], "phones": ["207-778-7584"], "departments": ["Marketing & Communications"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Violette", "last_name": "Beaulieu", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/violette-r-beaulieu/", "emails": ["violette.beaulieu@maine.edu"], "phones": ["207-778-7050"], "departments": ["Sweatt Winter Childcare Center"], "titles": ["Head Teacher Infant/Toddler"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Wayne", "last_name": "Coro", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/wayne-coro/", "emails": ["wayne.coro@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Mech Specialist HVAC CL2"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Wendi", "last_name": "Smith", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/wendi-l-smith/", "emails": ["wendi.smith@maine.edu"], "phones": ["207-778-7050"], "departments": ["Facilities Management"], "titles": ["Facilities Maint Worker CL1"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Wendy", "last_name": "Harper", "biography": "Professor Harper is a Maine native and teaches courses in microeconomics, finance and environmental economics. Her most recent research interests include non-market valuation, agriculture and food and sustainability. Outside of work, Professor Harper enjoys running, hiking and chauffeuring her children to their various sporting events. She is currently attempting to learn to ski, she hopes to one day complete an intermediate trail without injury.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/wendy-harper/", "emails": ["wharper@maine.edu"], "phones": ["207-778-7438"], "departments": ["Business Administration"], "titles": ["Associate Professor"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "William", "last_name": "Lane", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/william-a-lane/", "emails": ["william.a.lane@maine.edu"], "phones": ["207-778-7293"], "departments": ["Upward Bound"], "titles": ["Director"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Xuelian", "last_name": "Zhang", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/xuelian-zhang/", "emails": ["xuelian.zhang@maine.edu"], "phones": ["207-778-7050"], "departments": ["STEM"], "titles": ["Lecturer"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
{"first_name": "Yetunde", "last_name": "Ajao", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://farmington.edu/about/directory/yetunde-o-ajao/", "emails": ["yajao@maine.edu"], "phones": ["207-778-7050"], "departments": ["Student Life"], "titles": ["Asst Dir"], "institution_name": "University of Maine at Farmington", "start_date": "2025-12-06", "end_date": null}
