{"faculty_id": "e1431770-723b-44df-b17c-5ad591139be2", "first_name": "Nils", "last_name": "Haentjens", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/nils-haentjens/", "emails": ["nils.haentjens@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Research Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "22f390e8-1470-4e29-b06a-7fcf69622f2f", "first_name": "Amalia", "last_name": "Harrington", "biography": "I am a marine ecologist interested in understanding behavioral, physiological, and community-level responses to ecosystem change. Using a combination of field-based assessments, molecular tools, and laboratory-based experiments and assays, my goal is to understand the ecological responses of multiple life history stages of the American lobster ( Homarus americanus ) to a changing environment. My work also addresses issues of resilience for the fishery through collaborative research efforts with industry partners, resource managers, and researchers with diverse areas of expertise. As such, I am a strong proponent of collaborative research efforts and have experience leading and participating in multidisciplinary teams.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=n_MFGPEAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/amalia-harrington-2/", "emails": ["amalia.harrington@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "6eb71a16-222e-40a3-8cbf-544de0d47373", "first_name": "Emmanuel", "last_name": "Boss", "biography": "The bulk of our work is concerned with both basic and applied research. Among others, we develop new methods to use acoustical and optical properties (both from remote sensing and in-situ sensors) to quantify and characterize oceanic particulate materials.Our research is most often done in collaboration with researchers from outside UMaine, both from other universities (e.g. OSU, WHOI, Dalhousie) as well as private companies (e.g. Sequoia Scientific and WETLabs).", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/emmanuel-boss/", "emails": ["emmanuel.boss@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "4a121bc7-d867-4462-adc3-43cac0c816ed", "first_name": "Damian C.", "last_name": "Brady", "biography": "Dr. Damian C. Brady is a Professor of Oceanography based at the Darling Marine Center. His research interests, while broad, focus on how models can inform better decision-making in marine ecosystems to reflect the values of the coastal communities that rely on them. The decision-making contexts have included aquaculture, offshore wind, marine carbon dioxide removal, the American lobster fishery, sea-run fish, and coastal water quality. The Gulf of Maine is an important economic driver for the region with important fisheries and aquaculture operations; however, dynamic new ocean industries are emerging, such as recirculating aquaculture systems, floating offshore wind, and marine carbon dioxide removal. Many of these new and emerging technologies purport to address our pressing climate change induced challenges. To determine whether these emerging technologies can address these challenges, our team develops, calibrates, and validates tools, such as techno-economic analyses, marine ecosystem models, remote sensing, and oceanographic buoys, to collect objective, science-based information and importantly, communicate these results to coastal communities.Dr. Brady co-chairs the Science and Technical Subcommittee for the Governor of Maine’s Climate Action Plan, Maine Won’t Wait , serves on the Governor’s Offshore Wind Research Consortium, and serves on the board of the Maine Aquaculture Innovation Center. From 2019-2023, Dr. Brady chaired the Regional Association for Research on the Gulf of Maine. In 2019, Dr. Brady was named the Agatha B. Darling Professor of Oceanography and lives in Damariscotta, Maine with his wife, three daughters, and a rabbit named George.Follow us on Twitter: @BradyBunchDMC", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/damian-c-brady/", "emails": ["damian.brady@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Agatha B. Darling Professor of Oceanography"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "4fdadcb2-214a-4381-a05f-287936df600a", "first_name": "Ian", "last_name": "Bricknell", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/ian-bricknell/", "emails": ["ian.bricknell@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor of Aquaculture Biology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c159c73f-5d63-4a07-a5d7-a9a3aa8b030e", "first_name": "William", "last_name": "Ellis", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/william-ellis/", "emails": ["william.ellis@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Associate Director and Associate Professor of Oceanography"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "23907a13-1c8a-44a6-9626-185de9d72579", "first_name": "Walt", "last_name": "Golet", "biography": "Highly migratory species (tunas, billfish, sharks) are some of the most fascinating animals on the planet. Species like bluefin tuna, for example, have been important almost since the dawn of civilization. Described in detail by Aristotle, painted onto cave walls, stamped into currency, used as a food source and now a product in commerce there is probably no other fish with such prominence in our society. Crossing entire ocean basins, elevating their internal body temperature, swimming to depths in excess of 5000 feet within minutes and navigating with the precision of a GPS in an otherwise featureless environment is simply remarkable and something many HMS species do with regularity.Globally, commercial tuna fisheries account for more than 33 billion dollars and including their recreational component exceeds 45 billion conservatively. While their value is high, our understanding of their life history is not. Plagued with uncertainty, stock assessments for HMS species often lack basic information like age structure, stock delineation, predator prey interactions, size at maturity, indices of abundance, basic sampling, fecundity and more. My lab’s research is applied, working on these and many other aspects of HMS life history to improve stock assessment models and reduce uncertainty in their current and future projections. Every project I have requires the participation of commercial and recreational stakeholders, without whose help and dedication this work could never be completed. People wishing to work in my lab can expect to get dirty and spend time on the water with the various fishery components. Doing both of these things will give you a better perspective and understanding for both the science and the fishery.In addition to my research, I also dedicate a portion of my time to domestic and international management of these species. I hold an academic appointment on the NOAA Highly Migratory Species Advisory Panel, serve as a technical advisor on the ICCAT Advisory Committee and am a regular contributor to the Standing Committee on Research and Statistics to ICCAT. These positions allow direct participation into domestic and international allocation and use of HMS resources. Appointment to these panels also gives me the opportunity to understand the most pressing management and scientific issues facing both our domestic and international management bodies. Opportunities in my lab ebb and flow depending on available resources, but if you are interested I encourage you to reach out.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/walt-golet/", "emails": ["walter.golet@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f39d5c05-fd44-4f22-8a52-8281daed2a75", "first_name": "Heather", "last_name": "Hamlin", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/heather-hamlin/", "emails": ["heather.hamlin@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor and Director", "School of Marine Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "157b7d0b-9b1b-4be2-8017-1696f318b67f", "first_name": "Teresa", "last_name": "Johnson", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/teresa-johnson/", "emails": ["teresa.johnson@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor of Marine Policy"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "cf7d27c2-b1a0-4af9-97a9-b241c6768ff4", "first_name": "Lee", "last_name": "Karp-Boss", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/lee-karp-boss/", "emails": ["lee.karp-boss@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a17913bd-d7ad-413c-bb3f-64964bb80582", "first_name": "Heather", "last_name": "Leslie", "biography": "In the Leslie Lab at the University of Maine, we focus on the connections among people and coastal marine ecosystems. As marine conservation scientists, we use a combination of field experiments, modeling, and other approaches grounded in both the ecological and social sciences to investigate how diverse factors, including climate variability and changes in economic and regulatory regimes, influence ecosystem dynamics, and in turn, social interactions. Our ultimate aim is to provide scientific knowledge and tools that can help inform marine management that benefits both nature and people.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/heather-leslie/", "emails": ["heather.leslie@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor of Marine Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "54abdefe-3fc5-405a-ad2d-1d20de5f93b9", "first_name": "Sara", "last_name": "Lindsay", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/sara-lindsay/", "emails": ["slindsay@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor of Marine Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b826ca98-efec-45dc-b4bc-e0f9636d7a39", "first_name": "Neal", "last_name": "Pettigrew", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/neal-pettigrew/", "emails": ["nealp@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor of Oceanography"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "26197080-935f-409e-884a-151a639e6c11", "first_name": "Paul", "last_name": "Rawson", "biography": "The research in the Rawson lab investigates the ecological genetics of marine benthic invertebrates. A major focus of our work continues to center on the evolutionary dynamics of hybridization between blue mussels in the genus Mytilus using a combination of phylogenetic, physiological and molecular biological approaches. Past project have documented the distribution of two species of blue mussel Mytilus edulis and M. trossulus and their hybrids in the Gulf of Maine and the degree to which species-specific larval thermal tolerance, dispersal and settlement contribute to geographic variation in abundance of these two species. More recent and continuing work has employed phylogenetic analyses to estimate the historical patterns of extinction and colonization for M. trossulus in the northwest Atlantic, DNA sequence-based analysis of the role of natural selection in structuring blue mussel populations on east coast of North America and in the Baltic and North Seas, and molecular studies of the evolution of gamete recognition and the evolution of reproductive barriers among blue mussel species. In addition to blue mussels, we have on-going projects working with sea scallops, Placopecten magellanicus , and the eastern oyster, Crassostrea virginica . We are using a combination of ecological, population genetic and geochemical fingerprinting approaches to ask whether in-shore sea scallop populations in Cobscook Bay and Penobscot Bay, Maine are demographically isolated from off-shore populations, such as the large scallop beds on Georges Bank. We have partnered with the Maine Oyster Growers working group, the Maine Aquaculture Innovation Center and the Maine Aquaculture Association to continue selective breeding efforts for the eastern oyster. Oyster culture in Maine is typically limited by sub-optimal growth conditions and disease pressure from Juvenile Oyster Disease. Through the University of Maine Cooperative Oyster Broodstock Program we are using selective breeding and cross-breeding between improved oyster stocks to develop oyster lines that enhance production at Maine’s oyster farms.Although most of our research is conducted on marine bivalves, past and present projects have involved a wide diversity of species including copepods, barnacles and polychaete worms. For more information on these and other projects in our lab please visit our lab website using the link under the photo of our intrepid PI.Listed below are the five most recent publications from work conducted in our lab (as of November 2007). For a more complete list of publications check out our PIs CV or our lab website.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/paul-rawson/", "emails": ["prawson@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "996d4b26-e260-4299-8602-f652a6576d3b", "first_name": "Jeremy", "last_name": "Rich", "biography": "", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?hl=en&user=AK-lvy4AAAAJ&view_op=list_works&sortby=pubdate", "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/jeremy-rich/", "emails": ["jeremy.rich@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Associate Professor of Marine Microbiology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b10ccbe3-7d11-4338-9b33-c4b74fc3aa64", "first_name": "David", "last_name": "Townsend", "biography": "My research is broadly focused on the biological oceanography of coastal seas, especially the Gulf of Maine. More specifically, I am interested in physical-biological coupling of phytoplankton, zooplankton, and larval fishes. In the past, these interests have lead me into detailed studies of larval herring dynamics in the Gulf of Maine, larval cod dynamics on Georges Bank, phytoplankton blooms dynamics, the spring bloom and nutrient dynamics on Georges Bank, and biological production (in the broadest sense) of Maine’s estuaries. My current research projects are focused on phytoplankton, nutrients and red tides in the Gulf of Maine. Most of my work is heavily dependent on shipboard oceanographic surveys, as opposed to land-based laboratory experiments. I prefer to approach specific research problems in an interdisciplinary manner and to propose solutions to those problems that require the formation of teams of researchers that include physical, chemical and biological oceanographers.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/david-townsend/", "emails": ["davidt@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor of Oceanography"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "770dde71-b9b1-45f9-8c22-55f205a0646b", "first_name": "Richard", "last_name": "Wahle", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/richard-rick-wahle/", "emails": ["richard.wahle@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor and Director of the Lobster Institute"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "541334be-046b-44bb-925f-bd02d36818c3", "first_name": "Rhian", "last_name": "Waller", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/rhian-waller/", "emails": ["rhian.waller@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "21c73f97-4d2f-460a-a6b9-ead4ad02ffc3", "first_name": "Mark", "last_name": "Wells", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/mark-wells/", "emails": ["mlwells@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0a8f5ef0-cb5d-4f7e-b581-6922aa968832", "first_name": "Gayle", "last_name": "Zydlewski", "biography": "In the broadest sense my research interests and experiences are in the area of Fish Ecology, emphasizing the impacts of environmental conditions on the expression of behavior. It should be noted that at the intersection of environment and behavior are physiological responses. As such, much of my research has focused on the integration of behavior and physiology as it relates to environmental experiences. Recently, my research direction has expanded to incorporate impacts of various components of the ecosystems (prey presence, interspecific interactions, and water chemistry) on fish behavior and population dynamics. I have found that results from these research topics are useful for natural resource managers making decisions associated with environmental impacts on natural (or artificially-enhanced) populations of fishes.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/gayle-zydlewski/", "emails": ["gayle.zydlewski@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Professor and Director of Maine Sea Grant"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c8a48b51-5529-4621-a01b-564203f9eac0", "first_name": "Joshua", "last_name": "Stoll", "biography": "I am broadly interested in questions about the design and maintenance of formal and informal institutions that support sustainable fisheries and the communities that depend on them. Towards this objective, my research team is currently working on a range of interdisciplinary projects related to ecosystem-based fisheries management, seafood distribution and trade, community resilience, and aquaculture.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=lqOiIFMAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/joshua-stoll/", "emails": ["joshua.stoll@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Associate Professor of Marine Policy"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "7ebf665b-4380-4606-b6e0-f8e7b5068f6d", "first_name": "Kristina", "last_name": "Cammen", "biography": "Our lab uses molecular and analytical approaches to better understand aspects of ecology, evolution, and conservation biology in marine and coastal systems. I am interested in how marine species adapt to both natural and anthropogenic stressors, how genetic diversity partitions over time and space in dynamic populations, and how genomics can advance the study of non-model organisms in their natural environment. My research focuses primarily on marine mammal species that are sentinels of ocean health and species of conservation concern, though I have also studied adaptation to natural and anthropogenic stressors in estuarine fish and saltmarsh birds. Across study systems, my lab group is committed to a ‘one health’ perspective that integrates human, wildlife, and ecosystem health.", "orcid": null, "google_scholar_url": "https://scholar.google.se/citations?hl=en&user=6IuPb34AAAAJ&view_op=list_works&sortby=pubdate", "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/kristina-cammen/", "emails": ["kristina.cammen@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Associate Professor of Marine Mammal Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e68a7f93-ec61-4751-9dca-ed8c7870c31b", "first_name": "Margaret", "last_name": "Estapa", "biography": "", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=EDoXtvAAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/faculty/margaret-estapa", "emails": ["margaret.estapa@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Assistant Professor of Oceanography"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "59f86fa6-e071-4c2f-8870-ef995695ae17", "first_name": "Greg", "last_name": "Gerbi", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/faculty/greg-gerbi", "emails": ["gregory.gerbi@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Assistant Professor of Oceanography"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "dc3dce61-feed-4ea0-89d8-201439d904d7", "first_name": "Lisa", "last_name": "Kerr", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/lisa-kerr/", "emails": ["lisa.kerr1@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Associate Professor of Fisheries Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "77208a63-a1e7-4a17-acb5-91405e05dc48", "first_name": "Tiago Carrilho", "last_name": "Bilo", "biography": "How energy, mass, and seawater properties are transported and modified by large and mesoscale processes, deep ocean circulation, ocean dynamics, and variability of the Atlantic Meridional Overturning Circulation.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=r2i8_t0AAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/tiago-carrilho-bilo-ph-d/", "emails": ["tiago.carrilho@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "155dd9dc-a129-4c01-b917-e0d9c307c23d", "first_name": "Gail", "last_name": "Schwieterman", "biography": "", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=cXmW1D8AAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/gail-schwieterman-phd/", "emails": ["gail.schwieterman@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ddc3b032-a051-489e-959b-45190de09e5e", "first_name": "Hillary", "last_name": "Smith", "biography": "", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=GvHa7qMAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/hillary-smith/", "emails": ["hillary.smith@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Assistant Research Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ea12086d-9973-4285-b4b5-d172ea861746", "first_name": "Michelle", "last_name": "Staudinger", "biography": "Our laboratory group is committed to using collaborative, inclusive, and interdisciplinary approaches to address the unprecedented challenges that global change brings to the fields of fisheries management and marine conservation. We work across a wide range of coastal and marine habitats, spanning the intertidal zone to the deep sea.Key focal areas of our research program seek to understand how climate change effects the distribution, abundance, and trophic relationships among species. Of particular interest is the ecosystem role that forage fishes, such as squid, sand lances, and herring play in supporting the energetic demands of protected and managed predatory fishes, marine mammals, and seabirds.To achieve our research goals, we incorporate statistical models, data synthesis, laboratory, and field methodologies and work closely with a range of partners to coproduce science that is directly usable for decision making and the sustainable management of natural resources.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=8GOdtzgAAAAJ&hl=en&oi=ao", "research_gate_url": null, "scraped_from": "https://umaine.edu/marine/people/michelle-staudinger/", "emails": ["michelle.staudinger@maine.edu"], "phones": [], "departments": ["Marine Sciences"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "886b5c56-0d8c-478c-9aaf-5d02d2f8bd1c", "first_name": "Rafiou", "last_name": "Agoru", "biography": "The Agoro Lab uses a Systems Biology approach to identify molecular targets that prevent kidney aging, the progression of chronic kidney disease (CKD), as well as the development of sickle cell nephropathy (SCN). We believe the kidney to be the pioneer organ in mammals, and we are interested in understanding the molecular and cellular dynamics that change in this structurally and functionally complex organ during aging, CKD, and sickle cell anemia. In aged or diseased states, changes in cellular iron metabolism occur in the kidney driving therefore oxidative stress and renal function impairment. Learn more about our work here https://www.agoro-lab.org", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/rafiou-agoro/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c88ed1e9-9a07-421b-bfd7-0378486bede5", "first_name": "Fayeza", "last_name": "Ah", "biography": "Dr. Ahmed is an Assistant Professor of Psychology at the University of Maine. She is the director of the Maine Health, Aging, and Lifestyle Lab, where the focus of her work is on the intersection of health factors/behaviors and cognitive functioning.Trained in Clinical Neuropsychology throughout her graduate and postdoctoral training, Dr. Ahmed is particularly interested in how cardiovascular health and modifiable health behaviors impacts the risk for developing dementia, such as Alzheimer’s disease.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/fayeza-ahmed/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor of Psychology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "dcd84f8f-209a-4001-88bf-8c0d3c46626b", "first_name": "Suzanne", "last_name": "Angeli", "biography": "I received my B.S. in Cell and Molecular Biology. I attended graduate school at University of California, San Francisco, where I studies the group of genetically inherited neurodegenerative diseases known as polyglutamine diseases. For my postdoctoral studies, I incorporated how aging contributes to age-related diseases using C. elegans as a model. Currently, my lab uses C. elegans to understand the cell, molecular, and genetic influences of aging. In particular, we focus on how mitochondrial stress responses impact aging.Access to CV", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/suzanne-angeli/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor of Molecular & Cellular Biology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "aaae56db-fa9e-426a-9d12-e914c942c520", "first_name": "Christopher", "last_name": "Baker", "biography": "Behavioral/Cognitive SciencesBioinformatics/Computational BiologyDevelopmentGenomicsMolecular and Cellular BiologyStem Cells", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/christopher-baker/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "331d1b40-a4a4-47ed-91bd-53960294b544", "first_name": "Eva Rose", "last_name": "Balog", "biography": "I am an Associate Professor in the School of Mathematical and Physical Sciences and the Portland Laboratory for Biotechnology and Health Sciences at the University of New England. My areas of expertise encompass structural biology, enzymology, biophysics, and biomaterials. I am primarily focused on addressing the following research questions: (1) How can our understanding of protein structure and function contribute to the design and synthesis of advanced materials? and (2) How can protein-based materials enhance our ability to control and predict the behavior of cells and biological systems? From 2012-2014, I served as a postdoctoral research fellow at Los Alamos National Laboratory’s Center for Integrated Nanotechnologies, where I collaborated with a diverse team of scientists to develop protein polymers for applications in regenerative medicine and optoelectronics. I earned my Ph.D. in Molecular, Cell, and Developmental Biology from the University of California, Santa Cruz in 2012, and my B.S. in Biology from the California Institute of Technology in 2006.Visit Google Scholar Site to reach publications.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=R4C83CoAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/eva-rose-balog/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e653ef08-d9a3-4ce1-9c9f-11d6e2c58f75", "first_name": "Samantha", "last_name": "Barrick", "biography": "Dr. Barrick is an Assistant Professor of Biochemistry at the University of Maine. During her graduate studies at the University of Illinois, she studied mechanotransduction (the processes by which cells sense and respond to mechanical force) at cell-cell junctions. She then completed a postdoc at Washington University in St. Louis School of Medicine, focusing on the proteins involved in cardiac muscle contraction. Her lab at the University of Maine uses a multiscale approach to understand the biochemical and biophysical basis of cardiac mechanotransduction, with implications for the pathogenesis of familial cardiomyopathies (genetic diseases of the heart muscle).", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/samantha-barrick/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ea574a97-c2ac-470f-9cf6-068527729ea7", "first_name": "Kathleen A.", "last_name": "Becker", "biography": "Animal ModelCOM Faculty ResearchCOM Medical EducationGene ExpressionTransgenic Mice", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?hl=en&user=hyRX4soAAAAJ&view_op=list_works&sortby=pubdate", "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/kathleen-a-becker/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e6ba64f7-506d-4ed5-b18c-bae5e1804a1a", "first_name": "Erik", "last_name": "Bloss", "biography": "My career has focused on two major questions – how are neuronal cell types wired together to form functional circuits, and how do these circuits deteriorate during aging and in disease? First at The Rockefeller University and then at Mt. Sinai School of Medicine, my work focused on how stress and aging change the wiring of cortical circuits. As a postdoc at HHMI’s Janelia Research Campus, I developed imaging approaches to determine how genetically and neuroanatomically defined cell types are wired together. The rules obtained from these experiments suggest specific ways that circuits transform inputs into outputs.At The Jackson Laboratory, we wish to advance these rules and understand how circuits alter their wiring during learning to store memories. We use both light and electron microscopy approaches, techniques to silence or excite specific neurons, and strategies to delete individual genes from defined neuronal subsets. We also use in vivo neurophysiological strategies in awake, behaving mice to relate behavioral plasticity to changes in neuron activity. Other major projects in the lab seek to understand how cortical and hippocampal circuits are vulnerable to Alzheimer’s disease, and whether innovative circuit manipulations can protect neurons from pathology. In many experiments, we use genetically distinct mice with the broader goal of understanding how the processes we study might be modulated differently by genomic diversity.To reach CV press here .Research Areas:AgingBehavioral/Cognitive SciencesMolecular and Cellular BiologyNeuroscienceAlzheimer’s DiseaseNeuronal cell typesSynapses", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/erik-bloss/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "00566afb-d8b4-4e60-b9a7-98eef1cf4fc4", "first_name": "Robert E.", "last_name": "Braun", "biography": "Geneticists measure time in generations and celebrate immortality with reproductive success. My lab is driven by a passion to understand the cell biological basis of gamete (sperm and egg) development. We study how germline stem cells balance self-renewal with differentiation. Stem cell self-renewal at the expense of differentiation can cause germ cell tumors while differentiation at the expense of self-renewal can cause sterility. Our long-term goal is to understand the mechanisms that regulate germline stem cell fate. Other research interests include understanding the molecular function of the hormone testosterone in spermatogenesis. Our work has revealed that specialized tight junctions between Sertoli cells, which are integral to the blood/testis barrier, are regulated by testosterone. We are studying how germ cells pass through these tight junctions without compromising barrier function. We are also investigating molecular mechanisms of translational regulation—a major form of gene regulation in both male and female germ cells—during spermatogenesis. We use both forward and reverse genetics to identify the genes involved. Phenotypic analysis includes microscopy, biochemistry and cell physiology.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/robert-e-braun/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Janeway Distinguished Chair and Professor of Mammalian Genetics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "38cd3438-8c2f-4c6d-abd2-09a4f3b6820e", "first_name": "Matthew", "last_name": "Brichacek", "biography": "The group utilizes synthetic organic chemistry to better understand complex biological phenomena. When limitations in existing synthetic methodologies are encountered, new methods are developed to obtain the bio-molecules of interest. An improved understanding of biological processes and diseases at the molecular level enables the discovery of new, efficacious therapeutic treatments. This approach strives to make important contributions to the fields of chemistry and chemical biology.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/matthew-brichacek/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "7621db57-404d-4306-a8e5-36bd55e813e0", "first_name": "Carol", "last_name": "Bult", "biography": "My research group focuses on two major areas: bioinformatics and developmental genomics.In the area of bioinformatics we build information systems that integrate diverse genetic and genomic data to facilitate the use of the laboratory mouse as a model system for understanding normative biology and disease processes in humans. My group is a member of the Mouse Genome Informatics consortium at The Jackson Laboratory which hosts the Mouse Genome Informatics database (http://www.informatics.jax.org).In the area of developmental genomics, our goal is to use molecular genetics of normal lung development in mouse as a framework for identifying key genes and pathways in lung diseases such as cancer and pulmonary fibrosis.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/carol-bult/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b174db28-adf4-4256-92fb-443d76c5a953", "first_name": "Robert", "last_name": "Burgess", "biography": "DevelopmentNeurobiologyNeurodevelopmentNeurogeneticsNeuroscienceThe Burgess lab seeks to understand the molecular mechanisms of synapse formation and maintenance at two sites in the nervous system: the peripheral neuromuscular junction and the retina. In all of these studies, we are addressing basic molecular mechanisms, but these basic mechanisms have relevance to human neuromuscular and neurodevelopmental disorders. Our continued research on the genetics underlying these disorders, and our continuing effort to identify new genes involved in these processes, will increase our understanding of the molecules required to form and maintain synaptic connectivity in the nervous system.Dr. Burgess received his B.S. in Biochemistry from Michigan State University, and his Ph.D. in Neuroscience from Stanford University. After doing postdoctoral research at Washington University, St. Louis, he joined the faculty of The Jackson Laboratory in Bar Harbor, ME, in 2001. Dr. Burgess’ research is funded by the Muscular Dystrophy Association and the National Institutes of Health.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/robert-burgess/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "d4dcea82-3011-485a-9370-e811a390a20f", "first_name": "Michael", "last_name": "Burman", "biography": "My lab investigates the neurological substrates of fear, anxiety, and learning in rodents. We are espeically interested in anxiety disorders invoving memory components such as phobias and post-traumatic stress disorder. We are currently working on a model of pediatric anxiety.While always emphasizing the examination of behavior, my lab uses a variety of techniques including stereotaxic surgery, pharmacology, immunohistochemistry, PCR and more.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/michael-burman/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor of Psychology Project Leader", "COBRE Academic Director", "School of Social and Behavioral Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "46378953-cbb9-418a-b1e2-e99fe2b40157", "first_name": "Ling", "last_name": "Cao", "biography": "Dr. Ling Cao is a professor of immunology in the Department of Biomedical Sciences, University of New England College of Osteopathic Medicine, and the current chair for UNE’s institutional Animal Care and Use Committee (IACUC). Dr. Cao’s research focuses on chronic pain. In the laboratory, her laboratory investigates the neuroimmune mechanisms of neuropathic pain using rodent models, including peripheral injury induced neuropathic pain and HIV-associated peripheral neuropathy. She also conducts secondary data analysis and human subject research trying to understand factors affecting the chronic pain and its management. The goal of her research is to help bridge basic research with clinic practice. Her lab has also been active in mentoring students in various disciplines who are interested in participating in research. Dr. Cao received training in Clinical medicine from the Beijing Medical University (Currently Peking University Health Science Center) and earned her Ph.D. in Toxicology from SUNY Albany. She completed her post-doctoral training at the University of Rochester School of Medicine and Dentistry and the Dartmouth Geisel School of Medicine. Dr. Cao became a faculty member at UNE COM since 2007.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/ling-cao/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "5e897dc7-1d13-4852-b4e3-9bdff30c1c33", "first_name": "Greg", "last_name": "Carter", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/greg-carter/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2f33dc0f-ba0f-48ae-ba62-8b8b4fa992c3", "first_name": "Gary", "last_name": "Churchill", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/gary-churchill/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "729ca086-3d3c-4a90-aa84-76fb669a51c4", "first_name": "Alan", "last_name": "Cobo-Lewis", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/alan-cobo-lewis/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "296d820f-1f64-4338-8ad0-684d9068c8b5", "first_name": "James", "last_name": "Coffman", "biography": "I am interested in how the phenotypic characteristics of an organism come to exist developmentally, via the interplay between the genomically-encoded information, cell physiology, and the environment, and how development contributes to aging and constrains phenotypic plasticity and regenerative capacity over an organism’s lifespan. My laboratory uses zebrafish and sea urchins as model systems to address these questions, because their embryos are highly accessible to experimental manipulation at many different levels, and their genomes have been sequenced and annotated.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/james-coffman/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "843bef82-cf50-4a63-a1f1-561e346adf4c", "first_name": "Katherine Weatherford", "last_name": "Darling", "biography": "Professor Weatherford Darling is an interdisciplinary health scientist with training in Medical Sociology, Feminist Science Studies and the Ethical, Legal & Social Implications of Genomics. In addition to her robust community-engaged health equity research program, she regularly collaborates with clinical, genomic and molecular scientists to anticipate and address ethical issues and equity concerns within biomedical innovation. Before coming to Maine, she served as Assistant Director of Research and Academic Programs at the Science & Justice Research Center based at University of California Santa Cruz. Working in lab and classroom contexts, Dr. Darling applies her training in Science Studies methods and pedagogy to develop innovative graduate training experiences and support reflexive socio-technical practices within biomedical science and healthcare. At GSBSE, she has taught courses and workshops in the responsible conduct of research and mentored graduate students on projects related to policy and social issues in biomedicine.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=OFa8bGEAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/katherine-weatherford-darling/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor of Health Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e261ec73-f813-4dd2-8041-f2536558126c", "first_name": "Harold", "last_name": "Dowse", "biography": "Molecular Mechanisms in Cardiac Physiology I am investigating cardiac function at the cellular level in Drosophila melanogaster using molecular, genetic, and pharmacological tools. The heart of this organism makes an ideal model for probing the way in which heartbeat is generated. We have discovered a number of mutations which render the heart arrhythmic, and probing the way in which these lesions affect the beat yields information on the ion channels constituting this electrochemical pacemaker. We use neurotransmitters and ion channel specific toxins to alter function. I have cloned a calcium channel central to the pacemaker and am expressing this channel in Xenopus oocytes to determine its characteristics. This three-pronged approach yields a clearer picture of the self-sustained oscillation driving the heart. Owing to homologies among ion channels in the mammalian and insect heart, we expect to shed light on the latter’s more complicated system with this model.Digital Signal Analysis In my work with circadian rhythms and heartbeat, I have adapted a number of digital signal analysis techniques for use with biological systems. One of these techniques is Maximum Entropy Spectral Analysis. More recently, I have adapted wavelet analysis techniques for use in circadian rhythms. I am currently investigating acoustic signals produced by male Drosophila during courtship. There is a great deal of species-specific information carried by these songs. I have adapted wavelet decomposition techniques for time-frequency of analysis of these signals as well. Wavelet analysis is a new method that holds promise for other biological signals, including heartbeat.Circadian Rhythms I continue my work on circadian and ultradian rhythms in collaboration with investigators at other institutions, principally Brandeis University. I am particularly interested in ultradian rhythms and their potential role underlying the 24-h oscillator, and have worked on the role of the cry gene in peripheral clocks and social interactions that can lead to resetting of the clock.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/harold-dowse-2/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor Emeritus of Biological Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f20593cb-871b-4f1b-ab67-5b062c4cbe50", "first_name": "Iain", "last_name": "Drummond", "biography": "Iain Drummond received his Ph.D. from the University of California Berkeley for work on ionic signaling and the Drosophila heat shock response. His postdoctoral work at Northwestern University Medical School and the University of Chicago focused on gene regulation in Development and Kidney Cancer (Wilms tumor). From 1996-2019 Dr. Drummond was an Associate Professor in Medicine and Genetics at Harvard Medical School / MGH and Director of the Harvard Stem Cell Institute Kidney program. His lab established the zebrafish as a genetic system for discovering mechanisms of kidney development, disease, and regeneration. His work has revealed new genes required for cilia function in organogenesis and in human Primary Ciliary Dyskinesia, established the role of collective cell migration in nephron morphogenesis, discovered new pathways underlying kidney nephrotic syndrome, revealed cellular mechanisms linked to Polycystic Kidney Disease gene functions, and developed the zebrafish pronephros as an in vivo system to evaluate pathogenicity of human gene sequence polymorphisms. Now at the Mount Desert Island Biological Laboratory as Director of the Davis Center for Aging and Regeneration, his lab studies 1) Vascular/epithelial interactions in kidney morphogenesis, 2) Genetic compensation for cilia gene mutations and 3) Growth factor mechanisms of stem cell-based kidney regeneration and how this can be translated to human cell-based therapy for kidney failure.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/iain-drummond/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "3ef1ce6b-c7e4-47a9-8d17-e918dbcbd73f", "first_name": "Matthew", "last_name": "Dube", "biography": "Bioinformatics/Computational BiologySpatial and Temporal Data Science", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/matthew-dube/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Data Science", "Computer Information Systems", "and Applied Mathematics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "552c3037-ed88-4d40-a751-f9a0cd051d6d", "first_name": "Max", "last_name": "Egenhofer", "biography": "Dr. Max J. Egenhofer is professor in the School of Computing and Information Science, a member of the Spatial Information Science Engineering faculty at the University of Maine. He has held a Libra Professorship at the University of Maine and was a Visiting Professor at the Instituto Nacional de Pesquisas Espaciais, Brazil (2010), the Westfälische Wilhelms-Universität Münster, Germany (2004), and the Università de L’Aquila, Italy (1993).Dr. Egenhofer has published over 130 articles in fully refereed outlets, among them the most frequently cited papers in four journals and another three conference series, including the most cited paper in the GIS flagship publication, the International Journal of Geographical Information Science. His work has had a huge impact on academic research and industry. Countless dissertations in computer science and geography have built on his research, several international standards have been formulated explicitly around his work, and a series of commercial GISs and spatial databases (by Oracle, IBM, Microsoft, Intergraph, ESRI, Intelligent Spatial Technologies) have implemented his formalizations. In ISO 19107 the model of topological relations he developed have been termed the “Egenhofer operators.”", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/max-egenhofer/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor of Spatial Computing"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a4ca09d6-ed56-4944-84e4-fdc01aa7c27a", "first_name": "Brett", "last_name": "Ellis", "biography": "Solid mechanics, material science, finite element analysis, design, failure analysis", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/brett-ellis/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor", "Mechanical Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8c949eaf-b382-4a09-9295-b206e78d6499", "first_name": "Eben", "last_name": "Estell", "biography": "Dr. Estell is a biomedical researcher focused on developing tissue-engineered models to understand how cells interact with their mechanical environment, and leveraging this knowledge for the development of therapeutic solutions to degenerative diseases in the musculoskeletal system.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/eben-estell/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c4de5592-cb34-40b8-8147-bc7a7ea151d0", "first_name": "Charilaos", "last_name": "Filippakis", "biography": "Harry Filippakis was born in Heraklion, Crete, Greece and was always drawn to biological sciences. This became the driving force behind his decision to study abroad at the University of Aberdeen in Scotland. After receiving his bachelor’s degree (Hons) in Genetics he moved back to Greece to attend the graduate program of Molecular Basis of Human Disease at the University of Crete, Medical School. In 2011, Harry earned his Ph.D. with a focus on the impact of human cytomegalovirus infection on the tumorigenic Ras signaling pathway. Harry then moved to the United States to study oncogenic viruses and chromosomal instability as a postdoctoral fellow at Tufts Medical Center. In 2013, Dr. Filippakis joined the laboratory of Dr. Elizabeth Henske at Brigham & Women’s Hospital and Harvard Medical School, where he worked on understanding how nutrient uptake and recycling contribute to the pathogenesis of TSC and LAM.Dr. Filippakis is currently an Assistant Professor in the Department of Biomedical Sciences at the University of New England, College of Osteopathic Medicine. His laboratory focuses on macropinocytosis, lysosomal metabolism, and autophagy in mTORC1-hyperactive cells, integrating metabolomic, proteomic, and transcriptomic methodologies and in vivo models. Harry has been funded by The LAM Foundation, and by the Department of Defense Kidney Cancer Research Program.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/charilaos-harry-filippakis/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor", "Department of Biomedical Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f580e280-aedc-43a3-afe0-86efbbe804e8", "first_name": "Geoffrey K.", "last_name": "Ganter", "biography": "Dr. Ganter’s laboratory is investigating the mechanisms of nociception using the powerful genetic toolkit of the fruit fly Drosophila melanogaster . Pain affects all of our lives in some way, yet we know only a little of how pain works and how to block it. The tiny fly might be able to lead us to the next generation of improved medications for pain in humans.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/geoffrey-k-ganter/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor of Biology", "Co-Director", "Histology and Imaging Core"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "babbe57c-cab2-4f5a-b915-8f96ac3f9479", "first_name": "Allison", "last_name": "Gardner", "biography": "I am a medical entomologist and my research focuses on the ecology of infectious diseases of humans and wildlife that are transmitted by arthropod vectors, such as mosquitoes or ticks. I use lab and field studies in conjunction with geographic, quantitative, and molecular tools to address questions related to 1) understanding the basic biology of arthropod vectors and the socio-environmental conditions that enhance disease transmission, 2) developing effective, sustainable vector management strategies that are grounded in ecological theory, and 3) predicting future hotspots of transmission to facilitate targeted public health prevention and intervention efforts. Current projects include studying the invasion of the blacklegged tick and Lyme disease in Maine, investigating the ecology of a mosquito vector for Zika virus in the Caribbean, and understanding the interactions between risk of exposure to vector-borne disease and economic interests (e.g., timber harvesting, tourism) at local and international spatial scales. I am an Assistant Professor in the School of Biology and Ecology and a cooperating faculty member in the Ecology and Environmental Sciences program, the Senator George J. Mitchell Center for Sustainability Solutions, the Margaret Chase Smith Policy Center, and the Graduate School of Biomedical Science and Engineering at the University of Maine.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=Ev9Z5AIAAAAJ", "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/allison-gardner/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "d14e838e-0075-4577-ac78-cc6681480d67", "first_name": "James", "last_name": "Godwin", "biography": "Do humans undergo scarring instead of regeneration because of their immune system? What can we learn from natural regeneration that we can use to induce scar-free regeneration in humans?Finding regenerative strategies capable of faithfully repairing tissues after surgery, disease or traumatic injury will have the potential to transform modern medicine and improve the lives of a limitless number of patients.In dramatic contrast to the poor repair outcomes for humans and rodent models such as mice, salamanders can completely regenerate sections of the heart, spinal cord, whole limbs, and many other tissues following injury, at any life stage. This astounding capacity for repair provides a template on which to understand the process of natural regeneration and develop strategies to improve human repair.Dr. Godwin’s work explores the molecular signals from nerve and immune cells that underpin the resistance to scarring, and the activation of regeneration in salamanders.By identifying knowledge gained in studying the natural process of regeneration in the axolotl salamanders, key insights into the requirements of regeneration have been gained that illuminate the path forward in inducing latent regeneration in mammals. The Godwin lab combines both comparative biology and immunomodulation in salamanders and mice (both MDIBL and JAX locations) to investigate the potential for regeneration in a range of genetic mouse models though a joint appointment with MDIBL and Jackson Laboratory.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/james-goodwin/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "1d50abcf-1169-4f1e-9b9a-a1e8dd72fe0c", "first_name": "Diana J.", "last_name": "Goode", "biography": "My laboratory focuses on neuro-immune cell interactions in chronic and neuropathic pain syndromes, specifically studying how T cells impact neuronal responses properties. Skilled in multi-color flow cytometry, multi-analyte assays, 2D DiGE and 2D Western, phospho-profiling, and mouse behavioral models (Hargreaves, von Frey, thermal choice assay). I earned my Doctor of Philosophy (Ph.D.) in Immunology from The Johns Hopkins University, and received training at the National Institutes of Health, Yale University, and Population Council. I have 5 years’ experience (4yrs graduate, 1yr undergraduate) teaching immunology and microbiology in both a standard classroom and an integrated medical school curriculum coupled with flipped learning.In 2008 at the National Institutes of Health, I discovered that the HIV envelope protein gp120 binds to integrin α4β7, the gut homing receptor. Expression of integrin α4β7 mediates migration of T cells to the gut where massive CD4+ T cells depletion occurs and subsequent HIV-induced immune dysfunction. We later showed that integrin α4β7 forms a complex with CD4 and defines a T cell subset that is highly susceptible to HIV infection.In 2014 as a post-doctoral fellow at Population Council, we showed that HSV-2 infection increased the frequency of α4β7+ T cells in the rectal and vaginal mucosa. This increased expression directly correlated with the increased susceptibility to Simian-Human Immunodeficiency virus (SHIV) infection. These experiments highlighted α4β7 as an important risk factor for HIV transmission. Additionally, we analyzed the effect that sex hormones had on α4β7+ T cells and the mucosal microenvironment. Progesterone and estradiol modified the expression and release of inflammatory immune factors directly implicated in HIV transmission. These experiments underscore the importance of understanding the hormone-driven modulation of the mucosal microenvironment and the implementation of contraceptive polices in high-risk communities.In 2017 as a post-doctoral fellow at the University of New England, my research focused on the roles of exchange proteins activated by cAMP (Epac) signaling pathways in primary sensory neurons and the contribution to the development of acute pain. Our work identified a previously unknown pathway by which tissue injury increases pain by enhancing mitochondrial function through the phosphorylation of the enzyme pyruvate dehydrogenase (Pdha1). An exciting observation is that this mitochondrial mechanism only occurs in male mice, not females, suggesting the need for sex-specific treatments.My research focuses on neuro-immune cell interactions in chronic and neuropathic pain syndromes, specifically studying the extent CD4+ T cells impact neuronal responses properties. Projects involve multi-color Flow Cytometry, Western blotting, PCR, immunohistochemistry, immunocytochemistry, Phospho-profiling, and mouse behavioral models (Hargreaves, von Frey, thermal choice assay, mechanical conflict system). I earned my Doctor of Philosophy (Ph.D.) in Immunology from The Johns Hopkins University School of Medicine, and received training at NIH, Johns Hopkins University, and Yale University. I have 6 years’ experience (5yrs graduate, 1yr undergraduate) teaching immunology and microbiology in both a standard classroom and an integrated medical school curriculum coupled with flipped learning.To reach CV press here.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/diana-j-goode/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "89acb727-c5d8-4802-9017-16ff927d95c3", "first_name": "Julie", "last_name": "Gosse", "biography": "Immunology / Inflammation / HematologyMolecular and Cellular BiologyStress Response and Adaptation", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/julie-gosse/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "d0970271-0fce-47e1-8ecc-dd1516489d02", "first_name": "William", "last_name": "Gramlich", "biography": "In our lab we use polymer chemistry and engineering to develop new materials for biomedical applications. We typically work with biomaterials like hydrogels to mimic the extracellular matrix to interact with cells and proteins controlling their fate to affect biological functions. Two specific areas of interest are outlined below.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/william-gramlich/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a8fd3c9e-e268-4a7a-9630-6d41b7ca298b", "first_name": "Giovanna", "last_name": "Guidoboni", "biography": "Giovanna Guidoboni is the inaugural Dean of Maine College of Engineering and Computing, which bridges engineering and computing programs for the benefit of all students across the University of Maine System. She previously served as associate dean for research and professor in the College of Engineering at the University of Missouri (MO, USA), and was on the faculty at the University of Houston (TX, USA), Indiana University Purdue University Indianapolis (IN, USA), and the Université de Strasbourg (France). She is an elected member of the European Academy of Sciences and Arts and is founder and manager of Gspace LLC, which provides modeling and computational solutions for complex problems in engineering and life sciences. Guidoboni also serves as co-founder and co-editor-in-chief of the journal “Modeling and Artificial Intelligence in Ophthalmology” (Kugler Publications, the Netherlands). She holds a doctorate in mathematics and both a bachelor’s and master’s degree in materials engineering from the University of Ferrara.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/giovanna-guidoboni/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Dean", "Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "4a8fcccb-e07b-497e-b0da-de1ae1a57ef4", "first_name": "Olgun", "last_name": "Guvench", "biography": "Olgun Guvench teaches biomedical sciences to Pharm.D. students and pursues research in the field of biomolecular simulation, with a focus on proteoglycans and protein-carbohydrate interactions. Before joining UNE, Dr. Guvench was a National Institutes of Health Kirschstein Postdoctoral Fellow at the University of Maryland, where he trained in biomolecular simulation and structure-based discovery/design, including developing new atomic-resolution models for simulating carbohydrates.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/olgun-guvench-2/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor", "Department of Pharmaceutical Sciences and Administration"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "61e4a4fe-b36b-40af-9ea6-fdbaf35d9738", "first_name": "Emily", "last_name": "Haigh", "biography": "The primary focus of my research is on examining cognitive processes that confer vulnerability to depression, contribute to the maintenance of the disorder or function to protect individuals from the recurrent nature of depression. To date, my work has focused on understanding the role of depressive rumination in the cognitive model of depression, examining decentering- or the ability to adopt a broader perspective as a possible target of ruminative processing, and examining dysfunctional thought content in individuals with a history of depression. In addition, I have been involved in several theoretical endeavors aimed at identifying, integrating and classifying different biological processes associated with the cognitive model of depression. Finally, I am interested in conducting research on transdiagnostic cognitive processes in service of validating a general cognitive model of psychopathology.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/emily-haigh/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2674ea03-fd6a-48ce-b574-7a6be627499a", "first_name": "Hermann", "last_name": "Haller", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/hermann-haller/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["President", "Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "66cd5d6e-cb47-48be-b4e6-a819f7a67633", "first_name": "Mary Ann", "last_name": "Handel", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/mary-ann-handel/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Emeritus Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "3982a734-7234-42f7-acf5-15b55bbfc4c7", "first_name": "Ben", "last_name": "Harrison", "biography": "Animal ModelCOM Faculty ResearchCOM Neuroscience and PainGene ExpressionNeurosciencePainSensory NeuronTranscriptional RegulationTransgenic Mice", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/ben-harrison/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor", "Department of Biomedical Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2ebaf803-3a2c-4872-a6f1-ac955e738c9c", "first_name": "Matt", "last_name": "Havrda", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/matt-havrda/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Dean for Research and Scholarship", "Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "3020b8ac-7d76-4e5a-9b94-0c0b1df3be71", "first_name": "Babak", "last_name": "Hejrati", "biography": "Babak Hejrati is an Assistant Professor of Mechanical Engineering (recently promoted to the rank of Associate Professor with tenure) and an Associate Member of the Center on Aging and the Institute of Medicine at the University of Maine. He received his Ph.D. in Mechanical Engineering with a focus on wearable robotics from the University of Utah in 2016. He was a postdoctoral research fellow at Biodesign Lab and Wyss Institute for Biologically Inspired Engineering at Harvard University before joining the University of Maine in 2017. His research is focused on dynamic systems and control, wearable robotics, biomechanics, and human-robot interactions. His research aims to bridge robotics and biomechanics by utilizing concepts in human-robot interactions, motor learning, and neuroscience to improve users’ gait and mobility. He is also interested in applying his expertise in dynamic systems and control to the areas of renewable energy and robotic additive manufacturing. Babak’s research is supported by the Institutes of Health (NIH), the National Science Foundation (NSF), the Department of Energy, and the U.S. Army Engineer Research and Development Center. He is a recipient of the NSF CAREER Award from the Disability and Rehabilitation Engineering Program, a recent grant from the National Institute on Aging (NIA) of the NIH, and the Early Career Teaching Award from the College of Engineering at the University of Maine.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/?post_type=um_people&p=6154&preview=true", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b949852d-e702-45c8-8432-809c61985c3a", "first_name": "Clarissa", "last_name": "Henry", "biography": "The goal of my research program is to understand how dynamic interactions between cells and their extracellular matrix mediate morphogenesis, and how disruption of cell-matrix interactions leads to disease states. Aberrant cell-matrix interactions cause or exacerbate many musculoskeletal disorders such as myopathies, tendonitis, traumatic muscle injuries, arthritis, and sarcopenia. My lab primarily focuses on how signaling between muscle cells and their extracellular matrix mediates musculoskeletal development and homeostasis with the goal of discovering new approaches for treatment of myopathies and traumatic muscle injuries.Our rigorous focus on mechanisms that mediate changes in the extracellular matrix led us to discover a novel cell adhesion pathway required for laminin polymerization at the myotendinous junction in vivo. We found that Nrk2b-mediated NAD+ synthesis potentiates laminin polymerization during development. We then found that activation of the Nrk2b pathway through NAD+ supplementation is sufficient to augment laminin polymerization and improve muscle structure and function in dystrophic embryos (dystroglycan-deficient zebrafish). This work was published in PLoS Biology and recommended to Faculty of 1000.Current focuses of our lab include identifying mechanisms of the Nrk2b pathway, characterizing neuromusculoskeletal development in zebrafish models of dystroglycanopathies, and elucidating mechanisms underlying extracellular matrix changes in muscle development, aging, and disease.Learn more at https://www.henrylabfishmuscle.com/", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/clarissa-henry/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c62a289e-bead-4b15-98c3-1af312a086f6", "first_name": "Sam", "last_name": "Hess", "biography": "RESEARCH INTERESTSExperimental and Theoretical Biophysics,Fluorescence Microscopy and Spectroscopy,Function and Lateral Organization of Biomembranes,Single Molecule Fluorescence Photophysics,Green Fluorescent Proteins.Overcoming “The Diffraction Limit”Resolution in light microscopes is limited by diffraction to approximately 200-250 nanometers, but much of biology occurs on much shorter (molecular) length scales. Scientists have been struggling to circumvent the limits of diffraction for more than one hundred years. Electron microscopy can image with nanometer resolution, but so far cannot be used to image living specimens. Super-resolution imaging techniques, which can break the diffraction barrier, are in great demand.Breakthrough in Light MicroscopyWe have developed a technique called fluorescence photoactivation localization microscopy (FPALM) which can image below the diffraction limit. The diffraction limit normally obscures features in the sample which are smaller than roughly half of a wavelength in size, or 200-250 nm for visible light. The FPALM method gets around the diffraction limit by using optical control of the molecules, such that only a small number are visible at any given time, allowing them to be visualized as individuals. Initially, the molecules are all in a non-fluorescent (inactive state). A light source (typically a 405 nm laser) called the activation beam is applied to the sample in a brief pulse at low intensity to activate a small number of molecules. A second light source (typically a 496 nm laser) called the activation beam then illuminates the sample, causing only the active molecules to light up and fluoresce, while all other (inactive) molecules are essentially non-fluorescent and remain invisible. The small number of active molecules are imaged using a high-sensitivity camera and their positions are measured (i.e. the molecules are localized) from the recorded images. After illumination for some short period (a fraction of a second, or roughly a few camera frames), the active molecules are bleached by the high-intensity illumination beam and become non-fluorescent once again. Then, another activation pulse is used, which activates another small subset of the total molecules, which are then imaged under readout beam illumination until they bleach. This iterative process of activation, readout, and bleaching, is repeated until as many molecules as possible are imaged and localized. The plotted positions of all molecules (typically 10,000 to 1,000,000) provides an image of the distribution of the molecules in the sample.The initial proof-of-principle paper on this technique was published in the Biophysical Journal in late 2006 (1), essentially coincident with the work of two other groups (2; 3). These developments were ranked by Science magazine as one of the top ten breakthroughs of 2006, and awarded “Method of the Year” of 2008 by Nature Methods .Because of the interest in imaging living cells, we pushed with particular effort to prove that FPALM works in living cells, and succeeded in imaging individual molecules of fluorescently-tagged hemagglutinin (HA. the fusion protein from influenza virus) inside living fibroblast cell membranes. This work revealed that molecules of HA could move within the membrane clusters they form, eliminating solid phase clusters as a possibility. Furthermore, the boundaries of the clusters are jagged, rather than rounded as would be predicted by energy minimization of the boundary perimeter due to line tension. Instead, some cellular factors must be preventing the clusters from becoming rounded, perhaps interactions between the cytoskeleton and the membrane which are postulated in the literature. Thus, several existing models of biological membrane organization were inconsistent with our observations, and our results strengthened the standing of at least one other model. These results were published in the Proceedings of the National Academy of Sciences in 2007.(4)Because of strong interest in imaging three-dimensional samples, and because FPALM as originally published images two-dimensional samples, we worked together with Dr. Joerg Bewersdorf, a scientist at the Jackson Laboratory, and an adjunct member of the Department of Physics and Astronomy at U. Maine, to develop a new version of FPALM called Biplane-FPALM, or BP-FPALM. BP-FPALM can image three-dimensional samples with a resolution of 30 nm x 30 nm x 75 nm, using methods similar to that of normal FPALM, but with simultaneous detection of fluorescence in two different focal planes, which was recently published in Nature Methods . (5)Because much of biology at the molecular level relies on relative orientations of molecules (not just proximity), we developed a version of FPALM which can image molecular orientations. Using the information encoded in the polarization of each photon, we are able to calculate the two-dimensional anisotropy of each localized molecule, which can be used to determine the orientation of the molecule. This method was published separately in Nature Methods in 2008. (6)The number of potential biomedical applications of localization microscopy is very large. These methods have been successfully used to image living and fixed fibroblasts, kidney cells, neurons, muscle fibers, nanopores in polymer membranes, crystalline surfaces, and nanostructures. The opportunities extend beyond biological systems to any three-dimensional sample which can be labeled with a photoactivatable fluorescent dye. A variety of photoactivatable dyes and photoactivatable fluorescent proteins such as the photoactivatable green fluorescent protein (PA-GFP),(7) EosFP,(8) and Dendra,(9) have been described in literature (10) and are available commercially. Recent publications have demonstrated imaging multiple species(11; 12), living cells(13-15), three-dimensional samples(5; 16), and molecular orientations(6), presenting several powerful capabilities for studying biological systems.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/sam-hess/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor of Physics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c6476149-33ba-4904-bda2-336881a8c677", "first_name": "Ron", "last_name": "Hills", "biography": "Ron Hills is a tenured faculty in the Westbrook College of Health Professions. Since his initial appointment in the Department of Pharmaceutical Sciences, he has taught a variety of courses in biochemistry, medicinal chemistry, pharmacology, and data science. Dr. Hills’ research expertise is in multiscale computational modeling. His interests also include the role of lipids in chronic health and disease, which he incorporates in his teaching. Students working with Dr. Hills’ learn how to develop predictive computational models and perform meta-analyses of the current research literature. Prior to joining UNE, Dr. Hills was a National Institutes of Health Kirschstein Fellow at the University of Chicago and University of Utah, where he received his postdoctoral training in advanced multiscale modeling techniques.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/ronald-hills/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor", "Department of Pharmaceutical Sciences and Administration"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "dce341b7-7cc5-450f-b2c3-d08b3e5451d9", "first_name": "Karen", "last_name": "Houseknecht", "biography": "Research interests focus on the discovery of novel therapeutics for the treatment of diseases associated with metabolic syndrome.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/karen-houseknecht/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor of Pharmacology", "Associate Provost for Research and Scholarship"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "4df7fdea-a9a1-47a2-badf-e3e166db7690", "first_name": "Caitlin", "last_name": "Howell", "biography": "Biointerfaces, Bio-Inspired Technology Development, Bacterial and Fungal Biofilm Formation and Control, Biomolecular Surface Interactions, Mammalian Cell Surface Interactions, Bio-inspired materials, Liquid-infused surfaces, Materials-based infection control, Materials for human space explorationThe Howell Biointerface and Biomimetics Lab", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=-hpjIEwAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/caitlin-howell/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Biomedical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0dd0a9d9-0142-41a4-96e6-6fcdfca1b9fc", "first_name": "Gareth", "last_name": "Howell", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/gareth-howell/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f248bdd0-da82-42ce-b1d0-943589ecac3e", "first_name": "Suzanne", "last_name": "Ishaq", "biography": "The central efforts of my lab are to increase our understanding of the interactions between animal (or human) hosts and their resident microbiota, and investigate solutions for using microorganisms to resolve disordered communities and host health. My ongoing and proposed research activities investigate the microbiome in several animal hosts with implications for a wide variety of research applications and to health, agriculture, and ecological management sectors inside of Maine and beyond. In particular, much of my work centers on the importance of spatial location in understanding host-microbe interactions and how to harness them. Currently, my lab is focusing on the role of gut microbes in creating beneficial compounds from the diet which can reduce inflammation in hosts, microbial community acquisition and health in several marine animal species, and the connection between host-microbe-environment.Teaching: AVS 254 Introduction to Animal Microbiomes AVS 401/402 Capstone in Animal Science AVS 454/554 DNA Sequencing Data Analysis LabTo reach the Website press here . Founder, Microbes and Social Equity Working Group can be reached here. Early Career At-Large Board Member of the American Society for Microbiology, 2024 – 2027 Editor, mSystems, 2021 – 2027", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/suzanne-ishaq/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Microbiomes"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ffb77bb9-a1e4-4fca-a37d-0bb792ee35a9", "first_name": "Mary Teena", "last_name": "Joy", "biography": "We are interested in targeting circuits in the brain for repair in neurological diseases such as stroke. With intersectional tools that employ large-scale recordings of neural activity, quantitative measurements of motor control and transcriptomics, we hope to determine how circuits that control motor actions reorganize in disease and use molecular information to identify therapeutic targets.I received my PhD in Neuroscience from University College London (UCL) where I trained with Dr. Patrick Anderson. My work focused on understanding molecular mechanisms that can be targeted for axonal regeneration in the injured spinal cord. Towards the end of my PhD, I became interested in projections upstream of the spinal cord, in the brain, where connections are more plastic. To further my understanding in reparative mechanisms in the brain, I undertook postdoctoral training with Dr. S.Thomas Carmichael at UCLA, where I studied molecular mechanisms that underlie plasticity during learning and memory as targets for stroke. In addition to molecular targets, I became interested in how neural circuits interact during movement, a domain that is compromised in stroke patients. For further training, I was awarded a visiting fellowship at Janelia, HHMI, where I worked with Dr. Adam Hantman, where I used a unique imaging platform to visualize and target circuit activity across multiple regions in the brain to determine how motor information is encoded in real-time in the normal brain. In my current lab, using a combination of techniques, we will determine how circuits re-organize after a stroke, how these re-organizational processes contribute to changes in motor function, molecular mechanisms that enhance plasticity in these circuits and therapeutic targets that can be clinically translated.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?hl=en&amp;user=tK-JcTwAAAAJ", "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/mary-teena-joy/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "863ec379-61ff-4711-8fc5-c80ddec80873", "first_name": "Joshua", "last_name": "Kelley", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/?post_type=um_people&p=3292&preview=true", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor of Biochemistry"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8469e37e-a142-4a12-b94f-ae3572488702", "first_name": "Andre", "last_name": "Khalil", "biography": "Bioinformatics/Computational BiologyBiomedical EngineeringCancerMolecular and Cellular BiologyRadiomicsPlease see the CompuMaine Lab webpage.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/andre-khalil/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "aaaef0ca-d658-4834-bad2-22deaf9b9458", "first_name": "Bashir", "last_name": "Khoda", "biography": "New Bio-Inspired 3D Printing Functionalized Lattice Composites for Actively Preventing and Mitigating Internal Corrosion, DOTBio-based polymers and composites for additive manufacturing, NSF-EPSCoRBio-manufacturing of cancerous pancreas tissue with controlled gradient hypoxia, NIH", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/bashir-khoda/", "emails": ["bashir.khoda@maine.edu"], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "db91a170-001a-4e13-98dd-fbbaacacab7f", "first_name": "Tamara", "last_name": "King", "biography": "Research interests center around mechanistic analysis of pain, with a specific focus on cancer-induced bone pain, osteoarthritis induced joint pain and chronic pain induced by nerve injury (neuropathic pain) . An important aspect of my research is using approaches that allow for mechanistic evaluation of affective/motivational aspects of pain and pain relief in the preclinical setting. Such an approach will lead to the discovery of molecules that can effectively ameliorate ongoing pain across various preclinical models of pain, including cancer induced bone pain, osteoarthritis induced joint pain, and nerve-injury induced pain. An overarching goal of my research is to examine mechanisms driving distinctive aspects of these pain states to foster development of novel therapies for a more comprehensive treatment of chronic pain in patients. Such advances would improve pain mamagement with diminished side effects compared to the currently available options (e.g. opioids in cancer bone pain).", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/tamara-king/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor", "Department of Biomedical Sciences", "COM"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a0b0bd07-8cd7-4808-a334-11d3b22db936", "first_name": "Benjamin", "last_name": "King", "biography": "Many aspects of human health can be traced to the ability of cells to sense and respond to infection, injury or other environmental changes. Cells orchestrate these essential biological processes through complex networks of genes, proteins and metabolites. The focus of my laboratory is to utilize genomic and computational approaches to understand the mechanisms of stress responses. Increased understanding of how these networks normally function will inform the development of therapies that restore their function when needed.Within these networks, genes function together with multiple layers of genetic regulation that include both protein coding and non-coding genes. Network models provide a powerful framework to predict the regulatory roles of genes. Current projects involve using genome-level data to build and analyze these networks. A specific focus is on non-coding RNAs, including microRNAs and long non-coding RNAs, that have important regulatory roles in heath and disease.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/benjamin-king/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Bioinformatics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2f67d8e9-cb95-4b24-8167-1f43b5dac9da", "first_name": "Dorothy J.", "last_name": "Klimis-Zacas", "biography": "Recent research in my laboratory targets the areas below, in an attempt to unravel mechanisms of bioactive compounds in berries in attenuating oxidative stress, endothelial dysfunction and inflammation, the cause of several chronic diseases.VASCULAR NUTRITION-NUTRITIONAL PHYSIOLOGY. Role and mechanism of action of functional foods and food bioactives on vasomotor function and aortic glycosaminoglycan structure and metabolism as related to Cardiovascular Disase, Hypertension, Obesity-induced inflammation and the Metabolic Syndrome with the use of biosensorsNUTRITIONAL BIOCHEMISTRY-NUTRIGENOMICS. Berry bioactives and their mechanism of action on systemic and local inflammation and gene expression related to the Metabolic Syndrome Role of anthocyanins and phenolics on cell migration, signaling, angiogenesis and vascular remodeling related to Cardiovascular Disease and Atherosclerosis.CLINICAL NUTRITION. Human interventions to study the role of food bioactives on Cardiovascular Disease, attenuation of oxidative stress, endothelial function, DNA protection and repair and alterations of gut microbiota.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/dorothy-j-klimis-zacas-2/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor of Clinical Nutrition"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8feab884-48df-43fc-82cf-d8ab08301f58", "first_name": "Ron", "last_name": "Korstanje", "biography": "The goal of our lab is to identify key genetic factors that contribute to the decline of function and damage in the aging kidney, to learn their role in the kidney, and to understand why variations of these factors lead to different outcomes. We do this by studying the natural genetic variation in mice and their association with different kidney phenotypes. Once causal genes are identified, we develop precision disease models for further study of the gene and to develop therapeutics that will slow down the decline of kidney function and development of disease.An untapped resource is histopathology. By applying image analysis and machine learning on renal sections we can quantify histological features and use these as phenotypes in our genetic analyses to identify the genes that are driving early changes in the kidney that lead to disease.We also study black bears and tenrecs to understand which genes and mechanisms are involved in these species that allow them to recover from kidney damage after hibernation. We apply this knowledge to develop therapies that can be used in human kidney patients.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/ron-korstanje/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ee1517f4-b0a1-4406-9c69-5ec15303e25c", "first_name": "Vivek", "last_name": "Kumar", "biography": "The Kumar Lab consists of geneticists, neuroscientists, and computer scientists. We are passionate about discovering novel targets and models for mental illness through innovation at the confluence of computational, genetic, and genomic methods. Broadly, we are interested in development of better animal models and animal phenotyping methods for human psychiatric illnesses. We use computer vision approaches to quantitate behavior and functional approaches to understand its underlying neuronal and genetic architecture. We have developed high-throughput computer vision based methods for ethologically relevant animal phenotyping. In functional genomics work, we use QTL and mutagenesis approaches to discover novel pathways that can be targeted for addiction therapeutics. Our approaches are flexible and can be applied towards many psychiatric phenotypes. In sum, we are a leading research group using genetics as its foundation, and a combination of biochemistry, physiology, imaging, and computer vision techniques to dissect complex behavior in mammals.Dr. Kumar carried out undergraduate research at The University of Chicago with Dr. Bob Haselkorn. He received his PhD at UCSD working with Dr. Michael G. Rosenfeld and structurally and biochemically characterized transcriptional co-repressors. During his postdoctoral work, Dr. Kumar trained with Dr. Joseph S. Takahashi at Northwestern and UT Southwestern and worked on functional genomics approaches to dissect the genetics of addiction.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/vivek-kumar/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "1e6931e5-efbb-4151-8eaa-ac8ee5925ebb", "first_name": "Lei", "last_name": "Lei", "biography": "Professor Lei has worked at the University of New England since July, 2010. He teaches undergraduate courses such as Cell and Molecular Biology (BIO 370), Developmental Biology (BIO 407), and Developmental Neurobiology (BIO 450). He treasures undergraduate education and was given the Debra J. Summers Memorial Award for Teaching Excellence in 2018.In addition to classroom teaching, Professor Lei conducts research on two seemingly distinct but intimately connected topics: 1) transcriptional regulation of gene expression in neural development and 2) origin of life and the evolution of the genetic code. He has published in high profile journals on both topics, often involving contributions from student researchers that he mentored.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/lei-lei/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "eef2a199-ae61-45e3-8807-701dcc78af89", "first_name": "Danielle", "last_name": "Levesque", "biography": "I am an evolutionary and ecological physiologist primarily interested in the comparative energetics and the evolution of mammalian temperature regulation. My research lies at the intersections of comparative physiology, ecology and evolutionary biology, and the synergies between these disciplines. Through field and laboratory based experiments, I seek to understand how rigidity or flexibility in metabolism and body temperature regulation affects the energetics of a species, and how their evolutionary history has shaped these patterns.The data obtained through studying thermoregulation and energetics can have multiple applications. By understanding the dynamics of the relationship between an animal and its thermal environment, we can better predict energy budgets and responses to changes in climate and resource availability. As such, physiological data are vital for the development of realistic, predictive, climate-change models; a large part of the newly emerging field of conservation physiology. The study of these patterns over a wide range of species, especially those retaining pleisiomorphic (ancestral) characteristics, can allow for the formulation and testing of hypotheses on the evolution of thermoregulatory patterns, such as the evolution of endothermy.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=T9-8FAgAAAAJ&hl=en&oi=sra", "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/danielle-levesque/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Mammology and Mammalian Health"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "4b6c0bc2-a8b4-466d-8e8f-069402bf7315", "first_name": "Romain", "last_name": "Madelaine", "biography": "NeurobiologyDevelopmental biologyAging", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/romain-madelaine/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ff149783-6af0-44e5-8bdb-e749b8d52e33", "first_name": "Melissa", "last_name": "Maginnis", "biography": "Research in the Maginnis laboratory is focused on understanding the cellular and molecular basis of viral disease. Specifically, our work seeks to define the viral and host cell factors that regulate infection and viral pathogenesis of the human JC polyomavirus (JCPyV). The majority of the population is infected with JCPyV, which establishes a lifelong, persistent infection in the kidney without symptoms. In immunocompromised hosts, such as individuals receiving immunomodulatory therapies for autoimmune diseases or those with HIV, the virus can spread from the kidney to the central nervous system and cause a lytic infection in the brain. Viral destruction of the glial cells astrocytes and oligodendrocytes, which are critical for myelin production, results in the fatal, demyelinating disease progressive multifocal leukoencephalopathy (PML). There is currently no effective treatment for PML.Viruses are complex, yet extremely efficient machines that hijack the host cell machinery to complete an infectious cycle and produce progeny virus. The interplay between JCPyV and host cell factors is critical to understanding disease outcomes and PML pathogenesis. Research in my laboratory is focused on understanding the detailed molecular interactions between the virus and host cell factors that drive the early steps in the infectious cycle including entry, trafficking, and viral transcription. In particular, we are focused on defining how JCPyV uses the serotonin receptor to transverse the plasma membrane, identifying signaling cascades that drive viral transcription, and elucidating how the virus causes persistent and lytic infections. This research will allow us to define key unanswered questions in JCPyV biology, provide crucial insights into JCPyV pathogenesis, and identify novel targets for rational drug design for prevention and treatment of PML.To reach CV, please, press here.Visit our lab website: http://umaine.edu/maginnislab/", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/melissa-maginnis/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Microbiology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2814b4af-2397-4934-8ae6-9b7efaa0046f", "first_name": "Michael", "last_name": "Mason", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/michael-mason/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor", "GSBSE Associate Director"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "72ad2f5f-c8f2-4d0c-a22e-e6d33938aad1", "first_name": "Shannon", "last_name": "McCoy", "biography": "Social psychological study of the self, social identity, and social stigma.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/shannon-mccoy/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Psychology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "49e69a6e-f77c-425a-a32d-254d74f631b8", "first_name": "Ian", "last_name": "Meng", "biography": "Dr. Ian Meng received his ScB and PhD in Neuroscience at Brown University. Following completion of his PhD, he worked as a postdoctoral fellow with Dr. Howard Fields in the Department of Neurology at the University of California, San Francisco (UCSF), studying the brain circuits mediating the analgesic properties of cannabinoids. Dr. Meng joined the University of New England (UNE) in 2003 where he is currently a professor of Biomedical Sciences, Director of the Center for Excellence in the Neurosciences (CEN), and the Director of the National Institute of Health (NIH) funded Center for the Study of Pain and Sensory Function. While at UNE, he has maintained a continuously funded research program with the aim of understanding trigeminal sensory processing underlying headache and ocular pain and homeostasis, with an emphasis on two conditions: headache and dry eye. Dr. Meng’s lab is currently investigating sensory neurons that regulate tearing and ocular pain under both normal and pathological conditions such as dry eye. Additional projects are exploring the ability of corneal afferents to promote corneal healing by providing trophic support to the injured cornea in dry eye.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/ian-meng/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor", "Department of Biomedical Sciences", "Director in the Center of Biomedical Research Excellence for the Study of Pain and Sensory Function", "Director in the Center for Excellence in the Neurosciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e65aa6b5-1f12-4291-a9fd-6653fe1ad352", "first_name": "Srinidi", "last_name": "Mohan", "biography": "Drug Delivery and Formulation, Genomics, Molecular Biology, Proteomics, Cancer Biomarkers", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/srinidi-mohan/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Chair and Professor", "Department of Pharmaceutical Sciences and Administration"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0cb13e1b-ed72-498c-881a-fdd48dc6eb98", "first_name": "Derek", "last_name": "Molliver", "biography": "Research in the Molliver lab focuses on the molecular machinery that controls signal transduction in pain-sensing neurons and the changes in that machinery that underlie the transition from acute to chronic pain. In pursuit of those themes, research in the lab examines mechanisms that regulate the integration of distinct signal transduction pathways to determine neuronal response properties, with an emphasis on protein-protein interactions and activity-dependent translational regulation. A second project examines communication between peripheral sensory neurons and resident immune cells. From a technical perspective, the lab uses a set of complementary techniques designed to analyze signal transduction mechanisms from individual neurons to the whole animal, including in vitro functional assays (biochemical analyses of cell signaling, ratiometric calcium imaging), protein identification and localization (immunohistochemistry, multiplex Western blotting, 2D DIGE, mass spectrometry), single cell PCR and in vivo behavioral assays.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/derek-molliver/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor; Director", "Center for Cell Signaling Research"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "d1eecf97-947a-4500-8e35-d9d427919d19", "first_name": "Sally", "last_name": "Molloy", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/sally-molloy/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Genomics and Honors"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8de51c87-e34b-478c-a7a2-d5dcf44962ae", "first_name": "Sharmila M.", "last_name": "Mukhopadhyay", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/sharmila-m-mukhopadhyay/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor & Director of FIRST"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "6f453584-75c1-45aa-a527-1fafbcb71b9c", "first_name": "Steven", "last_name": "Munger", "biography": "The Munger Lab is a hybrid wet-dry lab that combines advanced computational methods with experimental validation techniques in high-resolution genetic mapping populations—an integrative approach called ‘systems genetics’—to elucidate the gene regulatory architecture governing cell fate decisions during early development and quantify the effects of environmental exposures on these processes. Our research takes advantage of the powerful Diversity Outbred (DO) and Collaborative Cross (CC) mouse populations, complementary reservoirs of natural genetic perturbations that segregate high genetic diversity with a balanced population structure ideal for high-resolution genetic mapping, to characterize the effects of genetic and environmental perturbations on multiple layers of gene regulation and infer predictive network models underlying cell fate decisions and exposure health risks. This systems genetic approach has enabled us to (1) define the consequences of genetic variation on transcript and protein abundance in the adult liver, and in so doing discover that pervasive transcriptional variation is largely constrained in homeostatic adult tissues at the level of protein abundance by the relative stoichiometry of protein binding partners and complex members, and (2) predict and validate genetic variants that influence multiple layers of gene regulation and affect maintenance of ground state pluripotency in mouse embryonic stem cells. Understanding cell fate decisions in stem cells has grown into a primary focus of the lab, and we have multiple research projects that take advantage of a large panel of genetically diverse embryonic stem cell lines derived from DO and CC mice. We are a highly collaborative lab that fully embraces team science, and most trainees contribute to more than one project and interact with multiple investigators. I (Steve) strive to provide an open, collaborative, diverse, and supportive environment where both people and research can flourish. For more information, please visit our lab website at mungerlab.com .", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/steven-munger/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "baf658d6-f98b-45dc-b22a-100746b3ca57", "first_name": "Prayag", "last_name": "Murawala", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/prayag-murawala/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "fc4d7456-4a99-488c-ab11-6daad61bd9db", "first_name": "Steve", "last_name": "Murray", "biography": "The research in my lab is focused on discovering the developmental mechanisms of morphogenesis and structural birth defects using both forward and reverse genetic approaches. We use innovative CRISPR/Cas9 modeling methods to rapidly investigate the function of novel human mutations associated with these conditions to aid in diagnosis and improve our understanding of disease mechanisms. We take advantage of large-scale mutagenesis programs to identify and study novel single gene knockout developmental phenotypes, and diverse mouse genetic backgrounds to explore the systems-level dynamics of embryonic morphogenesis.My lab also builds large-scale resources for the broader scientific community including the Knockout Mouse Phenotyping Program (KOMP2), which is part of an international effort the create and phenotype a single gene knockout for every protein coding gene in the mammalian genome. For the JAX Center for Precision Genetics (JCPG), we use genome editing technology to engineer precise models of rare disease and, when feasible, explore genome editing strategies for therapeutic intervention.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/steve-murray/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor and Senior Director", "Genetic Resource Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "96115f2f-516f-48aa-8ebf-55aafc7d82d4", "first_name": "Mohamad", "last_name": "Musavi", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/mohamad-musavi/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor", "Director of SMART INCLUDES", "Associate Dean of the College of Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "678fed2b-7397-4ec6-b137-5b877045efd9", "first_name": "Jurgen", "last_name": "Naggert", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/jurgen-naggert/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0055ec87-6ee9-4d20-afe9-c0c1e38c7940", "first_name": "Melody", "last_name": "Neely", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/?post_type=um_people&p=3263&preview=true", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor and Chair", "Molecular and Biomedical Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "be9851b5-4759-434a-a4f2-52b23c5481ca", "first_name": "David", "last_name": "Neivandt", "biography": "Interfacial adsorption is of critical importance in many industrial and biological processes, primarily due to the fact that system properties such as flocculation, flotation and biological recognition may be modified by interaction with an interface of miniscule amounts of surface-active species such as polyelectrolytes (proteins) and surfactants (lipids). Whilst the surface excess of the adsorbate is often of importance in inducing behavioral change, structural properties such as the polar orientation and degree of conformational order are also critical. A great deal of research has been performed on quantifying the effect of variables such as concentration of the surface-active species, electrolyte concentration, pH and temperature on surface excess. Comparatively little work however has focused on determining the effect of the same system properties on the detailed structure of the adsorbed layer. The primary reason for this paucity of data is the lack of techniques capable of providing interface specific structural information. The aim of our research is to determine detailed conformational informational of interfacial species in industrially and biologically relevant systems with the intention of gaining insight into how the surface structure affects the properties of the system. The primary technique employed is the surface specific second order non-linear optical technique of Sum Frequency vibrational Spectroscopy (SFS). This high energy laser technique involves overlapping, both spatially and temporally, a visible beam of fixed frequency and an infrared beam of tunable frequency on an interface. A third beam is emitted from the interface, the frequency of which is the sum of the two incident frequencies. Detecting this emitted light as function of the infrared wavelength produces a vibrational spectrum that is upshifted into the visible. The polar orientation of species resident at the interface is determined from the relative phase of the resonance signal, that is, whether ‘peaks’ or ‘dips’ are observed in the spectrum. Conformational information of the species is reflected by the relative strength of the resonance signals. The detailed structural information of interfacial species obtained by SFS is complemented by information obtained by a range of other surface techniques in order to provide a more complete picture of the interface. Specifically, the surface excess of the adsorbate is determined by appropriate linear transmission or reflection spectroscopies, for example UV-visible transmission and infrared attenuated total reflection. Further, extensive use of Atomic Force Microscopy is made in order to associate the surface excess and structural information with interfacial topography.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/david-neivandt/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "482a8703-c2f8-4417-b087-1507f0c00c23", "first_name": "Patsy", "last_name": "Nishina", "biography": "Approximately 50 million people worldwide are blind and ~150 million are significantly vision-impaired. Except for trauma and infections, the majority of human eye diseases are genetic in nature. Initially, the goal of our research program was to use mouse models as an entry point to identify the molecules that were essential for normal retinal development and function through positional cloning efforts. We have identified the molecular basis of >100 models, discovered through spontaneous and chemically induced screening.With the maturation of our program, we have begun to focus on using these models to study gene function and mechanisms underlying disease pathology. Knowledge of genetic modifiers and interaction partners is critically important in understanding the pathways that lead from a primary genetic defect to an observable phenotype. The overriding theme of our program currently is the elucidation of interactions that occur among molecules to identify common functional pathways as well as pathways that lead to disease and are impacted by primary mutations. We employ a blend of marker analyses, noninvasive imaging, functional studies, and generation of mouse resources that aim toward a greater understanding of the function and pathways in which the mutant retinal molecules we have identified act.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/patsy-nishina/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "5711c4e1-4607-44d8-8ab5-e53ce8e02c5f", "first_name": "Kristen", "last_name": "O’Connell", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/kristen-oconnell/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "03cb705d-9098-4ad4-971f-716930f3eec0", "first_name": "Martin", "last_name": "Pera", "biography": "Martin Pera was amongst a small group of researchers who pioneered the isolation and characterization of pluripotent stem cells from human germ cell tumours, studies that provided an important framework for the development of human embryonic stem cells. His laboratory at Monash University was the second in the world to isolate embryonic stem cells from the human blastocyst, and the first to describe their differentiation into somatic cells (precursors of the central nervous system). Currently his lab studies the regulation of self-renewal and pluripotency, heterogeneity in pluripotent stem cell populations, and neural specification of pluripotent stem cells. His work on neural differentiation of human pluripotent stem cells led to the development of a new treatment for macular degeneration, a common form of blindness, which is now in clinical trial in Israel. He has provided extensive advice to state, national and international regulatory authorities on the scientific background to stem cell research, and has delivered hundreds of commentaries for print and electronic media on stem cell research, ethics, and regulatory policy. At the Jackson Laboratory Pera will continue work on the regulation of pluripotency, and will study the genetic basis of individual differences in the response of the central nervous system to injury.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/martin-pera/%20", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "18201ccf-9731-43b4-8a27-90c7ab9f7549", "first_name": "Mauricio", "last_name": "PereiraDaCunha", "biography": "Acoustic Wave Filters for High Frequency Wireless Communication Applications Wireless communications is the technique employed in systems such as cell phones, LANs and mobile communication. In recent years, a very crowded wireless frequency band has created a need to expand the band to higher frquencies. Current technology employing SAW devices in critical signal procesing elements, such as RF filters, cannot be utilized in high frequency systems applications. The application of newly discoveredhigh velocity pseudo surface acoustic waves (HVPSAWs) has teh potential of satisfying high frequency requirements of today.This research focuses on an high radio frequency microwave acoustic devices, such as filters in wireless communications using HVPSAWs. The research objective is to identify piezoelectric materials and specific orientations in which HVPSAWs exist, and design, and fabricate and test prototype HVPSAw filters. SGER : Detection of Bioterrorism-Linked Microbial Pathogens Using Surface Acoustic Wave Liquid Sensors Bioterrorism threats require sensors that can rapidly and accurately detect minute quantities of pathological bioagents. Selective and inexpensive sensors are urgently needed to detece pathogens in liquid environments like food and water supplies. This project involving Dr. Pereira da Cunha and Dr. Millard (department of chemical and biological engineering) brings together expertise from 2 different areas into a new exploratory application that highly relevant to bioterrorism threats. The research combines molecular padlock probes for specific nucleic acid amplification with the SH-SAW (Shear Horizontal Surface Acoustic Wave (SH) SAW mode device utilizing the new Langasite family of crystals (LGX) recently fabricated by Dr. pereira daCunha) sensor platform to produce a hybrid biosensor to detect microbialpathogens in liquid quickly and reliably. Temperature Compensated Cuts on GaPO4 for Extreme Temperature Applications This project is part of the Collaboration Agreement established between the University of Maine and Linear Measurements, Inc. on the analysis of Temperature Compensated Cuts on GaPO4 for Extreme Temperature Applications. The general scope of this work is to investigate the temperature performance of GaPO4 for acoustic wave applications for temperatures far away from room temperature, thus outside of what is considered commercial practice.The specific tasks to be developed at UM are 1)Surface Acoustic Wave (SAW) Propagation Directions Analyses And Predictions At Extreme Temperatures 2)On wafer fabrication of SAW devices 3)2.3.On wafer SAW device measurements from 5-300 C temperature range. High Temperature Oscillator and Digital Clock The purpose of this proposal is to look at new materials for fabrication of SAW resonators that can have a sustained operation in the 200 oC to 300 oC temperature ranges. This work will investigate the use of quartz and the langasite family of available crystals for substrate material and will investigate metallization that can maintain its mechanical and electrical integrity at these temperatures. The application is for high temperature clocks that use SAW resonators as their frequency control element. The clocks will be used in geothermal and oil well environments. New Acoustic Wave Materials for High Temperature Chemical Sensors The main objective in the proposed Seed Grant research is to study the feasibility of the LGX family of crystals to operate at temperatures up to 600 oC and serve as acoustic wave materials for sensing applications. Such devices aim at fulfilling the current NASA needs of quick response, point contact H2, CxHy, NOx, CO, CO2, and O2 sensors for safety monitoring, emission monitoring, and fire detection. These sensors are particularly important in improving safety, decreasing the cost of space travel, and decreasing the amount of emissions produced by aeronautic engines.1997-2000 Surface Acoustic Wave SAW sensors, device fabrication, and characterization Joint project with Brazilian Telecommunication Research Institute – CPqD and Information Technologic Center – CTI . . . 1997 to present. Thin Films for high velocity SAW devices Joint work with the new materials group at University of Sao Paulo . . . 1997 to present. Gas and liquid sensors devices and fabrication Joint project with the sensors group at University of Sao Paulo and several other Brazilian Universities (RECOPE/FINEP project – Brazilian Government Grant) . . . 1998 to 2000. Acoustoptical devices for optical signal processing Initial joint activities with Aeronautics Technologic Center – CTA . . .", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/mauricio-pereira-da-cunha/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor of Electrical and Computer Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0cf61155-41ba-4db2-a6f5-af8513cd0eb7", "first_name": "Luis", "last_name": "QuemeCobar", "biography": "Luis Queme Cobar obtained his BS and MD from the Francisco Marroquin University in Guatemala City, Guatemala in 2007 and received his PhD in Cell Information Medicine from Nagoya University, Nagoya, Japan in 2013.He then moved to Cincinnati Ohio for a postdoctoral fellowship with Dr. Michael Jankowski at the Division of Pain Management in the Department of Anesthesia at Cincinnati Children’s Hospital where his research focused on the dual role of primary muscle afferents in controlling both nociception and the cardiovascular reflexes in response to muscle activity with the support of a postdoctoral fellowship from the American Heart Association.In the fall of 2022 he joined the Department of Biomedical Sciences at the University of New England College of Osteopathic Medicine as an Assistant Professor. His research is focused on the interactions between peripheral sensory neurons and other non-neuronal cells and how these may shape the development of chronic pain after exposure to chronic stress.Current NIH-funded projects focus on the role of macrophages in the development of long-lasting muscle pain using a multidisciplinary approach that combines molecular biology, ex-vivo electrophysiology and AI-driven behavioral analysis.To reach CV click here .", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/luis-queme/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor", "Department of Biomedical Sciences", "COM"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c5cadd13-eaae-41ee-891f-76cecc86b2a7", "first_name": "Guangwen “Gary”", "last_name": "Ren", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/guangwen-ren/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0b8b4159-ab5a-4638-9579-1c1b6c765aea", "first_name": "Michael", "last_name": "Robbins", "biography": "My research interests are to investigate biological, psychological and social correlates of cognitive aging. Since 1981 my major research activity has involved collaboration with Merrill F. Elias on the Maine-Syracuse Longitudinal Study (MSLS). Beginning at Syracuse University in 1975 and moving to the University of Maine in 1977, the MSLS has continued uninterrupted for more than 33 years thanks to support from the National Institute on Aging (NIH) and the National Heart Lung and Blood Institute (NIH). This community-based study offers students and faculty opportunities for archival data analysis focusing on relations among newly recognized and traditional risk factors for cardiovascular disease and cognitive performance across the adult lifespan. Some examples of variables in the data base are as follows: blood pressure, diabetes, blood glucose levels, adiposity, depression, anxiety, stroke, cardiovascular disease, homocysteine, lipids, ApoE e4, arterial stiffness (indexed by pulse wave velocity), smoking, alcohol consumption, vitamin B12, vitamin B6, folate, functional disability, activities of daily living, stroke and dementia history. The MSLS offers longitudinal and cross-sectional data on these risk factors and an extensive battery of neuropsychological tests. Among our collaborators are faculty at the University of Maine, Boston University, the University of Virginia, the University of Southern California, Oxford University (UK), the University or Birmingham (UK) and Australian National University.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/michael-robbins/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Research Professor of Psychology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "00216528-b211-4457-b18d-600cf54486f2", "first_name": "Nadia", "last_name": "Rosenthal", "biography": "Professor Rosenthal is the Scientific Director of The Jackson Laboratory (Bar Harbor, Maine). She obtained her Ph.D. from Harvard Medical School, where she later directed a biomedical research laboratory, then established and headed the European Molecular Biology Laboratory (EMBL) campus in Rome. She was Founding Director of the Australian Regenerative Medicine Institute at Monash University and founded EMBL Australia as its Scientific Head. Rosenthal is an EMBO member, Fellow of the UK Academy of Medical Sciences and the Australian Academy of Health and Medical Science, is an NH&MRC Australia Fellow, and is the Maxine Groffsky Endowed Chair at The Jackson Laboratory. She also holds a Chair in Cardiovascular Science at Imperial College London.Professor Rosenthal innovates the use of complex mouse genetic diversity panels to investigate mammalian development, disease, and repair, particularly in cardiovascular and skeletal muscle. Her research has advanced regenerative medicine by elucidating the role of growth factors, stem cells and the immune system in tissue healing after injury. Her book, Heart Development and Regeneration, is considered the definitive text in the field. She has received numerous honorary doctorates and prizes, participates on international advisory boards and committees and is a Founding Editor of Disease Models and Mechanisms, Deputy Editor of Differentiation and Founding Editor-in-Chief of NPJ Regenerative Medicine.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/nadia-rosenthal/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor and Scientific Director"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0f50c8a0-6940-4b96-9a7f-ab2aafdacf32", "first_name": "Mohsen", "last_name": "Shahinpoor", "biography": "Smart/Intelligent Materials, Structures and Systems, Smart Aerospace and Marine Structures, Biomimetics and Artificial Muscles, Mechatronics, Electroactive Polymers, Advanced Nanocomposites, Biologically-Inspired Engineering Systems (BIES), Biologically-Inspired Robotic Devices and Systems (BIRDS), Nano-Bio Engineering, Intelligent Robotic Systems, Robotic Surgery, Health Engineering, Biomedical Engineering, Heart Assist Systems, Left Ventricular Assist Systems (LVAS), Heart Failure Prevention, Bionic Vision and Ophthalmological Engineering as well as Neuro and Endovascular Surgerical Tools and Medical Implants.1-The applications of ionic polymeric conductor (metal) composites (IPMCs, IPCCs) as distributed nanosensors, nanoactuators, energy harvestoers and artificial muscles to spine stabilization and fusion, medicine, surgery, medical implants, neurosurgery and muscular atrophy and dystrophy.2-The applications of smart materials (shape memory alloys, SMA’s, metal hydride artificial muscles, MRF-polymer composites and electroactive materials) and structures to spine stabilization (scoliosis) and fusion, medicine, robotic surgery, medical implants, neurosurgery and muscular atrophy and dystrophy.For more details please visit: https://umaine.edu/mecheng/shahinpoor/", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/mohsen-shahinpoor/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Emeritus Professor in the Mechanical Engineering Department"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ba1ed734-578c-43e5-a943-cf097d740a6f", "first_name": "Siamak", "last_name": "ShamsEs-haghi", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/siamak-shamses-haghi/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Research Professor of Rheology and Polymer Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "335636d2-f05e-403f-a263-8cee7423e057", "first_name": "Leonard", "last_name": "Shultz", "biography": "Development of Humanized SCID Mice and Studies of Single Gene Models for Human Hematological Diseases Advances in our understanding of the development and regulation of the immune system in normal and pathologic states rely heavily on studies of mice with genetically determined immunodeficiency and autoimmunity. Research in our laboratory encompasses (1) basic studies focused on elucidating the mechanisms underlying immunodeficiency, autoimmunity, and hematological diseases; and (2) applied studies focused on the development of effective immunodeficient mouse models that support heightened engraftment with human hematopoietic stem cells. These “humanized SCID mice” will facilitate studies of human immunity, regenerative medicine, and neoplasia. Examples of the studies carried out over the last year are summarized below:Development of Humanized Mice for Translational Biomedical Research Complex biological processes often require in vivo analysis, and important research advances have been obtained using mice as a model system for the study of many biological systems. However, mice are not humans, and the study of human biology in vivo is severely limited by ethical and technical constraints. There is a growing need for animal models to carry out in vivo studies on human cells, tissues, and organs without putting individuals at risk. Humanized mice, or mouse–human chimeras, have been developed to overcome these limitations and have become an important research tool for the in vivo study of human cells and tissues. We have developed a NOD- Prkdc scid (NOD/SCID) mouse strain harboring a null mutation of the common cytokine receptor γ chain ( Il2rgtm1Wjl ) (NOD/SCID/IL2rγ null ) (full name NOD.Cg- Prkdc scid Il2rg tm1Wjl /SzJ ). In collaboration with Dale Greiner and his colleagues at The University of Massachusetts Medical School along with Fumihiko Ishikawa and his colleagues at The Riken Research Center for Allergy and Immunology, we have shown that these mice can efficiently support development of all myelo-erythroid components and functional lymphoid cells following human hematopoietic stem cell (HSC) engraftment. Development of mice that are ‘humanized’ by engraftment of human tissues, HSCs, and peripheral-blood mononuclear cells (PBMCs) provides an opportunity to study human biological processes in vivo that would otherwise not be possible. The new generations of humanized mice are proving to be powerful tools in preclinical testing and in the investigation of many human biological processes. The culmination of decades of research on humanized mice is leading to advances in our understanding of human hematopoiesis, innate and adaptive immunity, autoimmunity, infectious diseases, cancer biology, and regenerative medicine. The potential for new advances in our understanding of human biological systems provided by studies in humanized mice remains promising. The development of humanized mice based on immunodeficient IL2rγ null hosts has overcome many of the limitations and constraints of previously available models.The Mouse Mutation “Thrombocytopenia and Cardiomyopathy” ( trac ) is within the Abcg5 Gene: A Single Gene Model for Human Mediterranean Macrothrombocytopenia Homozygosity for a new spontaneous mouse mutation named “thrombocytopenia and cardiomyopathy” ( trac ) results in thrombocytopenia, dilated cardiomyopathy, and infertility. A/J-trac/trac mice show a precipitous drop in platelet numbers and increases in platelet volume by 4 weeks of age. By 2-3 months of age, trac/trac mice have a 20-fold decrease in platelet number, a 3-fold increase in platelet volume, and a greatly increased bleeding time. Blood smears showed abnormally large platelets and megakaryocytoid cells. The trac/trac mice also developed mild microcytic anemia accompanied by the presence of stomatocytes, a doubling of reticulocyte numbers, and a two-fold decrease in WBC counts. Increased numbers of megakaryocytes were present in bone marrow, spleen, and lungs. Ultrastructural studies of trac/trac megakaryocytes showed a poorly developed demarcation system and a failure to form platelet territories. The trac/trac platelets were enlarged, spherical, and contained numerous small alpha granules. The thrombocytopenia was not associated with defects intrinsic to bone marrow progenitor cells. Although thrombopoietin (TPO) levels were decreased, TPO treatment failed to reverse the thrombocytopenia. To identify the responsible gene, we produced a fine-structure genetic map of a 5-megabase interval containing the trac locus on mouse chromosome 17. The human syntenic region is Chr 2p21-p22. Analyses of 1100 F2 progeny from intercross matings of (A/J x C57BL/6J) F1 +/ trac mice narrowed the interval to 0.3 Mb containing 4 genes. Sequencing of these genes revealed a G-to-A mutation at base 1435 (refseq nm031884) of Abcg5 (ATP-binding cassette sub-family G, member 5). This G>A base change results in a tryptophan codon (UGG) at amino acid position 463(uniprot) being changed to a premature stop codon (UAG). The transmembrane helices prediction program, TMHMM, predicts that the premature stop codon would truncate the last four of the six transmembrane domains of the ABCG5 protein. No DNA alterations were found in any of the other candidate genes. Genetic crosses of +/ trac mice with mice doubly transgenic for the closely linked human ABCG5 and ABCG8 genes (stock B6SJL-Tg(ABCG5/ABCG8)14-2Hobb/J) showed that the transgenes normalized platelet counts and volumes in trac/trac mice. ABCG5 (sterolin-1) functions as part of a heterodimer, with ABCG8, that regulates plant sterol uptake. The trac/trac mutant mice have greatly elevated plasma levels of plant sterols. When placed on a phytosterol-free diet, the thrombocytopenia was reversed. Recent studies have shown that Mediterranean Macrothrombocytopenia is caused by mutations in ABCG5 or ABCG8 . Identification of the molecular basis of the mouse Abcg5trac mutation provides a new model for studying the role of phytosterols in pathogenic changes in the hematopoietic, cardiovascular, and reproductive systems.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/leonard-shultz/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2e921bd1-e56b-43c6-af2a-3146fb566adf", "first_name": "Rosemary", "last_name": "Smith", "biography": "The theme of Professor Smith’s research is the application of interdisciplinary knowledge to solving measurement problems. Many of her current projects are related to the creation of new micro or nanofabricated devices for biomedical applications. Current projects include the fabrication, packaging and testing of both chemical and physical biomedical microsensors and technology development for analytical microinstruments.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/rosemary-smith/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "08c908fb-609c-43b0-a7bf-811e7c8c5169", "first_name": "Emily", "last_name": "Spaulding", "biography": "The Spaulding lab uses the nematode C. elegans to understand how biomolecular condensation contributes to cellular organization within neurons and how its disruption might lead to neurological disease. Biomolecular condensates (BMCs) are collections of functionally related proteins and RNAs that are not enclosed in a membrane. For example, the nucleolus is the largest BMC in cells and is comprised of hundreds of proteins and RNAs that participate in the process of ribosome biogenesis. With their highly polarized morphology, neurons are especially reliant on proper cell organization and BMCs are known to function in neuronal development and synaptic signaling. Emerging evidence supports BMC disruption as a driver of neurodegeneration in Alzheimer’s disease, Parkinson’s disease, and amyotrophic lateral sclerosis. Combining precise CRISPR/Cas9-mediated editing of endogenous genes with super-resolution imaging of living C. elegans we are uncovering new functions of BMCs in neurons with the goal of providing new therapeutic targets for neurodegenerative disease.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/emily-spaulding-2/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0b9e3ad2-9498-4f29-a0bd-77c4a166a51e", "first_name": "Steven", "last_name": "Sutton", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/steven-sutton/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8febc70e-e63f-402e-99ec-bfdd890aeb51", "first_name": "Jared", "last_name": "Talbot", "biography": "In order to produce conscious movement, our body contains hundreds of carefully positioned muscles, that are each endowed with specific contractile properties. The Talbot lab investigates how muscle precursor cells are positioned during embryonic development and how these precursors transform from motile cells into functional muscle fibers. To investigate muscle precursor development Dr Talbot uses zebrafish embryos, which have a comparatively simple musculature and can be imaged live at high resolution throughout their rapid embryonic development. Right now the Talbot lab is pursuing two projects: The first investigates how precursor cells migrate to the correct positions during development. The second project investigates how muscle cells generate contractile structures called sarcomeres. We are currently recruiting students to work on both projects.Dr. Talbot received his Bachelors in Science in Biology from Cornell University. He then began his work on developmental biology by studying skeleton formation with Dr. Charles Kimmel at the University of Oregon. After this, he did a postdoc investigating muscle development with Sharon Amacher, initially working at the University of California Berkeley, then continuing the same work at The Ohio State University. Since becoming an assistant professor at the University of Maine in Orono, he has built a productive lab, received the Graduate Student Government’s Graduate Faculty Mentor Award, and the Chi-Bin Chien Award for new zebrafish investigators; he is also an investigator on the new COBRE grants and has secured R15 funding for the lab.Below, you will see a select subset of our publications which provide a flavor of the lab’s work.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/jared-talbot/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c8200dbd-c782-4969-b786-c607cf018e7e", "first_name": "Basile", "last_name": "Tarchini", "biography": "Fundamental to our interaction with the world, hearing and balance require ‘hair cells’ in the inner ear to transduce a mechanical signal (sound, gravity or head movements) into electrical impulses relayed to the brain. Research in our laboratory aims to unravel the developmental mechanisms conferring sensory ability to hair cells. The specialized hair cell compartment dedicated to mechanotransduction, the stereocilia bundle, is produced and oriented by cytoskeleton polarization at the single-cell and tissue level. A molecular understanding of bundle morphogenesis is key to improve our knowledge of hereditary hearing loss, and empowers emerging therapies to regenerate hair cells permanently lost to injury or disease in mammals.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/basile-tarchini/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e9fe72c3-3b57-4c5e-bea6-18171bb4111d", "first_name": "Ryan", "last_name": "Tewhey", "biography": "BioengineeringGenomicsMolecular and Cellular BiologyThe past decade has seen a transformational change in our understanding of the human genome and the role it plays in influencing disease risk. Large-­scale projects such as Encyclopedia of DNA Elements (ENCODE) have identified which non-­coding regions are important for gene regulatory function. Furthermore, the proliferation of genome wide association studies (GWAS) and scans for recent positive selection have identified thousands of loci that influence human health. Taken together, these efforts show the predominant contributors of heritability for complex disease are common polymorphisms that reside within non-­coding regions of the genome. However, despite our progress in mapping genetic signatures correlated with disease, very few examples exist that mechanistically link genotypic variation to disease risk.The mission of our research group is to bridge the genotype/phenotype gap by improving our ability to interpret single nucleotide variants that directly modulate gene expression. We approach this problem by (i) directly characterizing and interpreting the grammar of regulatory elements, in both mouse and human models, using novel technological approaches such as high-throughput reporter assays and CRISPR based screens of non-coding regions in the genome. (ii) Using our experimental methods and guided by existing genome wide association studies we seek to validate causal variants and construct better animal models that precisely reflect disease phenotypes.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/ryan-tewhey/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "806db517-eb82-460a-9bb7-10b051207f8b", "first_name": "Karissa", "last_name": "Tilbury", "biography": "The Tilbury Biophotonics Group is interested in developing and applying optical instrumentation to study biological interactions at appropriate spatio-temporal dynamics. Ongoing projects in the lab are focused on the use of Second Harmonic Generation (SHG) microscopy for label-free imaging of collagen in various diseased states.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/karissa-tilbury/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c724cb6c-1183-401e-98a8-478b07a328c6", "first_name": "Jennifer", "last_name": "Trowbridge", "biography": "AgingCancerImmunology / Inflammation / HematologyMetabolismMolecular and Cellular BiologyStem Cells", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/jennifer-trowbridge/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "007e4bfb-1af4-4db3-a5e8-63c2d3823158", "first_name": "Kerry", "last_name": "Tucker", "biography": "I come from the North Shore of Massachusetts, and I studied biochemistry at Harvard College, starting my research career purifying clathrin proteins from sheep brain at Harvard Medical School. I continued my studies as a graduate student at the Massachusetts Institute of Technology, in Cambridge, MA where I studied the role of DNA methylation in the development of the mouse, working in the lab of Rudolf Jaenisch. I then switched to developmental neuroscience as a postdoctoral fellow in the laboratory of Yves-Alain Barde at the Max Planck Institute of Neurobiology in Munich, Germany, and subsequently as a group leader at the University of Heidelberg, Germany, from 2003 until 2013. In this time, I developed tools to visualize with fluorescent proteins the embryonic development of the central nervous system (CNS), using genetically-altered mice as a model. My laboratory has discovered that primary cilia, a special microtubule-based organelle found in every cell, control early events in CNS development, including morphogenesis, boundary formation, neurogenesis, and nerve outgrowth. With a career based in Germany, I developed many international collaborations exploring the role of primary cilia in the development of a variety of CNS structures, including the forebrain, midbrain, and spinal cord. After my return to the USA as an Associate Professor at the University of New England, I am now moving into the analysis of postnatal phenotypes associated with loss of primary cilia in specific neuronal populations. We hope thereby to model some of the cognitive / neurodevelopmental defects seen in subsets of patients with so-called ciliopathies, multispectrum diseases associated with defects in proteins localizing to the primary cilium or the underlying basal body.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/kerry-tucker/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f71b664d-b5f4-4bb0-90c3-0fa654619bd8", "first_name": "Dustin", "last_name": "Updike", "biography": "Germ cells are the progenitors of reproductive cells, and the only cells in sexually reproducing animals that have the potential to give rise to all of the cell types of each subsequent generation. In our lab, we want to understand how these totipotent and immortal properties are conferred. Part of the answer comes from special aggregates called “germ granules” that are found just outside the nucleus of germ cells. Recent research has shown that germ granules play a critical role in maintaining the totipotent and immortal properties of the germline. Take away an organism’s germ granules and it will become sterile. In some organisms, introducing germ granules in cells outside of the germline will restore cellular immortality and totipotency, and will reprogram them into germline stem cells.Germ granules are conserved in their appearance, subcellular localization, and composition from worms to humans. Because of this, we are able to quickly ascertain the mechanisms by which germ granules function by studying them in a small roundworm called C. elegans . This well-established model organism is responsible for much of what we know about developmental genetics in humans. Using fluorescence microscopy, germ granules (called P granules in C. elegans ) can be observed in the germ line of transparent worms at all stages of development. The genetic power of C. elegans combined with its short 3-day generation time and transparency offers an opportunity to study the function of germ granules that isn’t feasible in more complex model organisms.A focus of our research is to understand the biophysical properties of germ granules, how they are assembled, and the components that affect their subcellular distribution. We have shown that germ granules are held together by weak hydrophobic interactions, and that they extend the size exclusion barrier of the nuclear pore complex out into the cytoplasm of germ cells. Here germ granules create a specialized microenvironment that facilitates post-transcriptional processing events that are exclusive to the germline. We are continuing to investigate the specifics of those processing events to understand how they are used to maintain the pluripotent and immortal properties of germ cells, and how these mechanisms can be applied to unlocking stem cell-like properties in other cell types.How do stem cells maintain pluripotency — the capacity to become other cell types in the body? Can our ability to regenerate after disease or injury be improved with the ability to switch on and off cellular pluripotency?To answer these and other questions, the Updike Lab derives cues from quintessential stem cells found in the germline. Germline stem cells (GSCs) are the precursors to oocytes and sperm, and these cells must retain their stem cell attributes so fertilized embryos can give rise to all of the cell types of each subsequent generation.To achieve this immortal potential, germ cells survey gene expression activity through unique structures called germ granules in the cell’s cytoplasm. Germ granules use small RNA machinery to read cellular messages and determine whether they are licensed for expression, shutting down aberrant messages whose expression could result in the loss of pluripotency. While germ granules are specific to the germline, they are found in animals, from worms to humans. The Updike Lab studies germ-granule function in C. elegans nematodes, where they are readily accessible and visible at all stages of development. This work will impact our understanding of germ-granule function and human fertility and the role of the cell’s cytoplasm in wound healing, regeneration, and tumorigenesis.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/dustin-updike/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "057aa334-dca0-4219-959d-0aedb72dc7e2", "first_name": "Ravi", "last_name": "Vum", "biography": "Ravi Vumma is an Associate Clinical Professor of Pharmacology at the School of Pharmacy, University of New England. He teaches pharmacology to Pharm.D. students and conducts research in the fields of neuro-immuno-pharmacology and nutrition-gut-brain interactions, utilizing human cell models.With more than a decade of experience in teaching and research in academia, Dr. Vumma previously served as a Senior Lecturer in Pharmacology at Linnaeus University, Kalmar, Sweden, and as a Senior Lecturer in Biomedicine at Orebro University, Orebro, Sweden, before joining the University of New England.Dr. Vumma earned his Ph.D. in Biomedicine (Neuroscience) from Orebro University, Sweden, where he also completed his Postdoctoral fellowship. He holds a Master of Science in Molecular Biology from the University of Skövde, Sweden, and a Bachelor’s degree in Pharmacy from Osmania University, Hyderabad, India.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/ravi-vumma/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Clinical Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "dfdd1b51-8083-430f-81b9-0dcf7c958e09", "first_name": "Phillip", "last_name": "West", "biography": "Dr. A. Phillip West received his PhD in Immunobiology from Yale University in 2011. He then performed postdoctoral training at Yale School of Medicine before starting his own laboratory at Texas A&M School of Medicine. In 2023, he relocated to The Jackson Laboratory in Bar Harbor.Research in the West Lab focuses on mitochondria, cellular organelles integral to many processes including energy generation and metabolism. More recently, mitochondria have emerged as central hubs in the mammalian immune system, orchestrating signal transduction cascades and metabolic switches necessary for the activation and survival of immune cells. Mitochondria are also important sources of damage-associated molecular patterns (DAMPs), which can trigger inflammatory responses when released from the organelle. Given their pleiotropic roles, mitochondrial dysfunction is increasingly implicated as a cause or accelerant of numerous human diseases. Ongoing research in the West Lab is focused on understanding how mitochondria-immune system interactions shape disease-promoting metabolic and immune rewiring in pre-clinical models of mitochondrial disease, heart failure, neurological disorders, and cancer.More detailed information about our research and lab members is available here: www.westlaboratory.comFull list of publications found here: www.westlaboratory.com/west-lab-publications", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/phillip-west/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ec317176-140f-4708-96ef-8eeec309f9ab", "first_name": "Robert", "last_name": "Wheeler", "biography": "Fungal host-pathogen interactionThere is an ongoing war between microbial pathogens and their hosts.For each mode of host immunity, the challenger has designed a defense, which in turn leads the host to devise a new avenue of attack. Opportunistic pathogens such as the fungus Candida , a leading cause of hospital-acquired infection and an increasingly important killer, must be able to constantly evade the attacks of the host and exploit any break in host defense caused by a compromise of immunity. The host, in turn, depends to a large part on innate immune responses to protect itself against this fungus. Using high throughput cell biology and genetics, we are elucidating this ongoing battle between fungi and host from both sides of the conflict.Our work attacks fundamental biological questions that have clinical relevance. In the near term, we expect to understand the normal host-pathogen interaction in disease and during drug treatment. In the long term, we expect to identify new means to prevent and treat fungal infection through attacking the fungus and modulating immune response.Microbial strategies for resisting immune attackCandida is recognized by the innate arm of the immune system through evolutionarily conserved fungal surface molecules. Although innate immune cells can recognize several different surface molecules, the fungus can cover some molecules to tailor the immune response.The sugar β-glucan is present throughout the cell wall of Candida , but as we discovered, the pathogen masks β-glucan from immune recognition to mute immune response. We discovered that a potent antifungal drug has an unexpected side-effect and can cause increased exposure of β-glucan in addition to killing fungi.We are devising and exploiting novel methodology to look at the clinical consequences of treating fungal infection with this antifungal drug.Host strategies for clearing fungal pathogensWe have recently begun using a transparent zebrafish model to probe host-pathogen interactions (Brothers et al. 2011, Tobin et al. 2012, Gratacap et al. 2013, Brothers et al. 2013). This model permits the real-time visualization of innate immune attack. Using this model, we have found that Candida -innate immune interactions differ in vivo from our expectations based on in vitro experiments. We are currently using this model to probe the cellular effects of loss of phagocyte NADPH oxidase function. In the future, this model holds promise for understanding the molecular mechanisms that regulate Candida interaction with innate immune cells, endothelial cells and epithelial cells.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/robert-wheeler/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Associate Professor of Microbiology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "bfdf09f3-6b04-43fc-8bf7-cb7ff4b55192", "first_name": "Scott", "last_name": "Wood", "biography": "The Wood lab focuses on using tissue engineering strategies to better understand, quantify, and predict the behavior of cells in response to physical stimuli. They focus on investigating the homeostatic role of the chondrocyte cytoskeleton and its intersection with integrin signaling pathways and on the development of a Microphysiological Articular Joint In a Chip (MAJIC) to model the multi-tissue nature of human articular joints in a microfluidic system that can be used as a drug screening tool.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/scott-wood/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Director", "Portland Laboratory for Biotechnology and Health Sciences", "Associate Professor of Biomedical Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "7b35f9cf-38d4-455e-9107-7619246c5cee", "first_name": "Zhao", "last_name": "Xuan", "biography": "Dr. Xuan is an Assistant Professor of Neurobiology in the School of Biology and Ecology at the University of Maine in Orono. The Xuan lab is interested in understanding the mechanisms of synapse formation and function, intending to reveal novel mechanisms underlying synaptic deficits in neurological diseases. We primarily use molecular and genetic techniques and advanced live-animal imaging in the nematode Caenorhabditis elegans (C. elegans) to study the following areas.1) The assembly and function of the active zone. The active zone is the site of neurotransmitter release at the presynaptic terminals. Active zones are highly specialized microdomains composed of the presynaptic membrane and a dense collection of proteins. Recently we reported a novel active zone protein in C. elegans called Clarinet (CLA-1). We will investigate how CLA-1 interacts with other active zone proteins to orchestrate neurotransmitter release. We will also carry out unbiased genetic screens to identify novel molecules required for presynaptic assembly.2) The assembly and function of the periactive zone. Adjacent to the active zone is a much less studied presynaptic domain called the periactive zone. Our recent findings that the periactive zone interacts with the active zone to regulate synaptic autophagy open new opportunities to examine the periactive zone and its role in maintaining synaptic performance. We will investigate the assembly of the periactive zone during development in vivo, its interaction with the active zone, and its potential role in coupling axon guidance, synapse formation, and neurotransmission.Laboratory Website can be reached here.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://gsbse.umaine.edu/people/zhao-xuan/", "emails": [], "phones": [], "departments": ["Biomedical Science and Engineering"], "titles": ["Assistant Professor of Neurobiology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "024d705c-96aa-4e70-a9ef-19c8317bd180", "first_name": "Rose", "last_name": "Abramoff", "biography": "", "orcid": "0000-0002-3393-3064", "google_scholar_url": "https://scholar.google.com/citations?user=Pa7eIukAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/rose-abramoff/", "emails": ["rose.abramoff@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Assistant Professor of Forest Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0439cfb6-9f53-4448-9456-50f79471a6fa", "first_name": "John", "last_name": "Daigle", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/personnel/directory/john-daigle/", "emails": ["jdaigle@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Professor of Forest Recreation Management"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b110817d-d1ec-4541-bf2f-46a393d7b630", "first_name": "Adam", "last_name": "Daigneault", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/faculty-staff/adam-daigneault", "emails": ["adam.daigneault@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Director and Associate Professor of Forest Policy and Economics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "59cd0162-7caf-427b-bf28-4fae9e79cad0", "first_name": "Sandra De", "last_name": "Urioste-Stone", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/sandra-de-urioste-stone/", "emails": ["sandra.de@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Professor of Nature-based Tourism"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a722bb5d-8051-4c45-912d-f3e271d3b325", "first_name": "Shawn", "last_name": "Fraver", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/shawn-fraver/", "emails": ["shawn.fraver@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Associate Professor", "Forest Ecology; Graduate Coordinator"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "01808a78-cad4-49b1-bde0-f840edb7f9e0", "first_name": "Douglas J.", "last_name": "Gardner", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/douglas-j-gardner/", "emails": ["douglasg@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Professor of Sustainable Materials Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "1559dc90-ede2-4126-b753-aea327aaccd1", "first_name": "Daniel", "last_name": "Hayes", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/daniel-hayes", "emails": ["daniel.j.hayes@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Associate Professor of Geospatial Analysis & Remote Sensing; Director", "Barbara Wheatland Geospatial Analysis Laboratory"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "9ffa5541-8aba-4725-b66f-65168b3f248d", "first_name": "Anil Raj", "last_name": "Kizha", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/anil-raj-kizha", "emails": ["anil.kizha@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Associate Professor of Forest Operations"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "da5fa027-d315-4ac7-82ce-3d757f2ce1e5", "first_name": "Ling", "last_name": "Li", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/faculty-staff/ling-li", "emails": ["ling.li@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Associate Professor of Sustainable Bioenergy Systems"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e19d6c71-58f9-4e90-a40a-58c18030cbc5", "first_name": "William H.", "last_name": "Livingston", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/william-h-livingston", "emails": ["WilliamL@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Associate Professor of Forest Resources"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f1b831d5-6b43-4123-a9c1-9b57b4aaa298", "first_name": "Michael", "last_name": "Premer", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/faculty-staff/michael-premer/", "emails": ["michael.premer@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Assistant Professor of Forest Management"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "7c86289f-2fc9-4367-ab49-c66f1eb158d1", "first_name": "Parinaz", "last_name": "Rahimzadeh-Bajgiran", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/parinaz-rahimzadeh-bajgiran", "emails": ["parinaz.rahimzadeh@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Associate Professor of Remote Sensing of Natural Resources"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "4f4d5d65-4e2a-4968-ac54-1a2c76a109d9", "first_name": "Amber", "last_name": "Roth", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/amber-roth", "emails": ["amber.roth@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Associate Professor of Forest Wildlife Management"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e8e23239-7a03-47dc-bd4e-d1f332828f1f", "first_name": "Erin", "last_name": "Simons-Legaard", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/personnel/directory/erin-simons-legaard", "emails": ["erin.simons@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Associate Research Professor in Forest Landscape Modeling"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "784cef78-1836-4312-978c-9e67f8c58d3d", "first_name": "Mehdi", "last_name": "Tajvidi", "biography": "", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=f9AlV44AAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/personnel/directory/mehdi-tajvidi", "emails": ["mehdi.tajvidi@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Professor of Renewable Nanomaterials"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b7755fae-f3f3-464d-931b-4ea52a41c502", "first_name": "Wason Lab of Forest Ecosystem", "last_name": "Physiology", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/faculty-staff/jay-wason", "emails": ["jay.wason@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Associate Professor of Forest Ecosystem Physiology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "966bc590-2d5c-43a4-9d3b-4e04db86ab22", "first_name": "Xinyuan", "last_name": "Wei", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/xinyuan-wei/", "emails": ["xinyuan.wei@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Assistant Research Professor in Forest Ecosystem Modeling"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e05e33f4-d6f1-40c4-bba7-78328e2b0e8d", "first_name": "Aaron", "last_name": "Weiskittel", "biography": "", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=e7z1aLEAAAAJ&hl=en", "research_gate_url": "https://www.researchgate.net/profile/Aaron_Weiskittel", "scraped_from": "https://forest.umaine.edu/aaron-weiskittel/", "emails": ["aaron.weiskittel@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Professor of Forest Biometrics and Modeling; Director", "Center for Research on Sustainable Forests"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c5671613-537c-4b86-8ab6-a8957319b177", "first_name": "Xuefeng", "last_name": "Zhang", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://forest.umaine.edu/xuefeng-zhang-staff-page/", "emails": ["xuefeng.zhang1@maine.edu"], "phones": [], "departments": ["Forest Resources"], "titles": ["Associate Professor of Sustainable Materials & Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "447caddf-f4d9-47a9-a38d-f302900cbfde", "first_name": "Yifeng", "last_name": "Zhu", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/yifeng-zhu/", "emails": [], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Norman Stetson Professor & Chair of Electrical and Computer Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "4b48d6cb-ea20-4328-b51d-67ac6408dfd7", "first_name": "Prabuddha", "last_name": "Chakraborty", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=zzXy8kgAAAAJ&hl", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/prabuddha-chakraborty/", "emails": ["prabuddha@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Waldo Libbey Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a87e57b0-d2a6-460b-9494-6a12b87c9f5f", "first_name": "Chaofan", "last_name": "Chen", "biography": "Dr. Chen’s research involves the design of interpretable machine learning models that can be understood (“interpreted”) by human beings. His recent publications include papers on interpretable deep learning for computer vision, and optimization of decision lists with constraint. He is interested in developing new techniques to enhance the interpretability and transparency of machine learning models, especially deep learning models, and in applying such techniques to healthcare, finance, and other application domains, where high-stakes decisions are made and interpretability is key for whether one can trust the predictions made by machine learning models. Dr. Chen also participates in the Maine environmental DNA (eDNA) project: he is developing computational techniques to understand eDNA.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/chen-chaofan/", "emails": ["chaofan.chen@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "756a0d60-416d-4d35-aef9-3d64eb33adba", "first_name": "Vikas", "last_name": "Dhiman", "biography": "Robotic perception Autonomous safe navigation Computer Vision Reinforcement Learning Machine Learning and Artificial Intelligence", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=6Pn0FGUAAAAJ", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/vikas-dhiman/", "emails": ["vikas.dhiman@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "d383b7a5-8d58-478d-9392-9f47ca646365", "first_name": "Yifeng", "last_name": "Zhu", "biography": "", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=XmsrEnYAAAAJ&hl=en&oi=ao", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/nuri-emanetoglu-2/", "emails": ["nuri.emanetoglu@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Associate Professor", "Graduate Coordinator"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b0a1c67a-0005-4f6a-a517-99846436de21", "first_name": "Taher", "last_name": "Ghomian", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=PnrSB_wAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/taher-ghomian/", "emails": ["taher.ghomian@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0970a0bb-2999-4c4a-bc00-2631207a604d", "first_name": "Yongjie", "last_name": "Guan", "biography": "", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=GyfShXgAAAAJ&hl=en&oi=ao", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/yongjie-guan/", "emails": ["yongjie.guan@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "da6bcb0f-ecd4-480a-a45f-277c0b3d69ab", "first_name": "Xueyu", "last_name": "Hou", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=VCeeHAkAAAAJ&hl=en&oi=ao", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/xueyu-hou/", "emails": ["xueyu.hou@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "049cb726-b9cd-42b8-8436-c172628e0f55", "first_name": "Mauricio Pereira da", "last_name": "Cunha", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/mauricio-pereira-da-cunha/", "emails": ["mdacunha@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Roger Clapp Castle and Virginia Averill Castle Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "70c12b32-5492-426d-a5b3-76a6ab032238", "first_name": "rosemary", "last_name": "smith", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=ed4v1A0AAAAJ&hl=en&oi=ao", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/rosemary-smith/", "emails": ["rosemary.smith@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Butler Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b58395b9-8ca2-4f21-9474-1645638dd4cd", "first_name": "Reinal", "last_name": "Tonkoski", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/reinaldo-tonkoski/", "emails": ["reinaldo.tonkoski@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Research Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ddbd7160-aca0-4eec-80d8-1e45b29d83f8", "first_name": "Vince", "last_name": "Weaver", "biography": "Hardware Performance CountersComputer ArchitectureHigh Performance ComputingArchitectural SimulationDynamic Binary InstrumentationLinux KernelEmbedded SystemsOperating SystemsAssembly Language Programming", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=wt-4shMAAAAJ&hl=en&oi=ao", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/vincent-weaver/", "emails": ["vincent.weaver@maine.edu"], "phones": [], "departments": ["Electrical and Computer Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2bc7f997-2032-4f88-b0c7-494c6f5e3909", "first_name": "Bill", "last_name": "Davids", "biography": "Bill’s primary research interests are in the areas of bridge engineering, applications of FRP composites in civil infrastructure, inflatable structures, wood mechanics and engineered wood composites, and the analysis of concrete and asphalt pavements. His research projects often encompass both experimental work and the development of problem-specific numerical analysis techniques. He has significant expertise in computational structural mechanics and numerical methods, which he has applied to areas ranging from the structural analysis of inflatable fabric beams and arches to the development of software for the finite-element analysis of concrete and asphalt pavements. Bill has authored or co-authored 60+ journal papers and is co-inventor on three patents, one of which describes the GBeam FRP bridge girder. The GBeam has been licensed by AIT Bridges and deployed in roadway bridges across three different states since 2020. He also led the development of the AASHTO Guide Specification for Design of Concrete-Filled FRP Tubes for Flexural and Axial Members, which was published in 2012. Further, Bill is the primary developer of EverFE , a software package for the linear and nonlinear 3D finite element analysis of jointed plain concrete pavements that couples a highly interactive graphical user interface and object-oriented C++ finite element code. Bill has also co-developed the program EverStressFE , a 3D finite-element analysis program for flexible pavements that incorporates a variety of advanced analysis and unique visualization capabilities. Bill is a registered Professional Engineer in the State of Maine, and gained four years of professional experience as a structural bridge engineer with Sverdrup Corporation (now Jacobs Engineering) in their Seattle office.”", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=0_75_N0AAAAJ&hl=en&oi=ao", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/william-davids/", "emails": ["william.davids@maine.edu"], "phones": [], "departments": ["Civil and Environmental Engineering"], "titles": ["Chair of Civil and Environmental Department", "Russell S. Bodwell Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2f125c8e-999b-42a2-9a87-f67c279bcf9c", "first_name": "Ruijie “Rebecca”", "last_name": "Bian", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=CAWbJ5cAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/rebecca-bian/", "emails": ["ruijie.bian@maine.edu"], "phones": [], "departments": ["Civil and Environmental Engineering"], "titles": ["Assistant Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "7970ad13-0c68-45ee-9b22-9b1e6b009697", "first_name": "Kimberly", "last_name": "Huguenard", "biography": "Coastal and ocean engineering, estuarine hydrodynamics, nearshore processes, turbulence and mixing, including aquaculture engineering.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?hl=en&user=dsRA6OMAAAAJ", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/kimberly-huguenard/", "emails": [], "phones": [], "departments": ["Civil and Environmental Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f1287c38-bc0a-4d16-8527-f67d35855b16", "first_name": "Shaleen", "last_name": "Jain", "biography": "Hydroclimatology, Water Resources, Environmental Data Analytics, Risk and Decision Analysis.", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?hl=en&user=acGBNr4AAAAJ&view_op=list_works&sortby=pubdate", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/shaleen-jain/", "emails": [], "phones": [], "departments": ["Civil and Environmental Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a574befa-6967-45f5-9fec-a60cdffc0c77", "first_name": "Eric N.", "last_name": "Landis", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=0vm6cbIAAAAJ&hl=en&oi=ao", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/eric-n-landis/", "emails": [], "phones": [], "departments": ["Civil and Environmental Engineering"], "titles": ["Professor", "Frank M. Taylor Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "d25fadd4-6662-49f9-b868-8af702420e93", "first_name": "Jean D.", "last_name": "MacRae", "biography": "Dr. MacRae’s research interests include microbial processes that affect pollutant and nutrient cycling, sustainability issues and access to water and sanitation in the developing world.She is affiliated with the Maine Center for Genetics in the Environment, and the Senator George J. Mitchell Center for Sustainability Solutions, where she is part of two research teams working on PFAS contamination and Materials Management.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/jean-d-macrae/", "emails": [], "phones": [], "departments": ["Civil and Environmental Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "4886bddf-10a0-45ae-8d44-90f69301c1dd", "first_name": "lauren", "last_name": "ross", "biography": "Coastal engineering, estuarine and fjord hydrodynamics, internal waves and tides, analytical and numerical modeling of geophysical flows, marine renewable energy", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=sv17lmwAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/lauren-ross/", "emails": [], "phones": [], "departments": ["Civil and Environmental Engineering"], "titles": ["Associate Professor", "Graduate Coordinator"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "fe19d1ab-d3ee-4420-a134-36ed1710d439", "first_name": "Joline", "last_name": "Blais", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/joline-blais/", "emails": ["jblais@maine.edu"], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Associate Professor of New Media"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "fd9b0511-5ce9-426f-aa47-4c23a7c83095", "first_name": "Sudarshan", "last_name": "Chawathe", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/chawathe-sudarshan/", "emails": ["sudarshan.chawathe@maine.edu"], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Associate Professor of Computer Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "247c2f50-4936-46fe-8cc6-3ecd6005f344", "first_name": "Phillip", "last_name": "Dickens", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/dickens-phillip/", "emails": ["philip.dickens@maine.edu"], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Associate Professor of Computer Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "3cbe87f1-a415-4c6e-aca5-e58df217f6fd", "first_name": "Sepideh", "last_name": "Ghanavati", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/sepideh-ghanavati/", "emails": [], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Associate Professor of Computer Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "065ad9cf-f14e-47fc-94a8-633c1a0a1ffb", "first_name": "Nicholas", "last_name": "Giudice", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/giudice-nicholas/", "emails": ["nicholas.giudice@maine.edu"], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Professor of Spatial Computing"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "72f726ea-82a6-4213-a1e7-5598ddbb9bf4", "first_name": "Torsten", "last_name": "Hahmann", "biography": "Dr. Hahmann’s work develops and studies spatial ontologies for data integration and sharing. One aspect focuses on how to move between precise computational spatial information (e.g. from geographic information systems, building information systems, or computer-aided design software) and intuitive, but often more vague descriptions of space (using vague, more qualitative spatial terms such as North, South, in, next to, between) commonly used by people. Another focuses on semantically integrating and connecting geospatial data from different sources to make it more accessible and to uncover new knowledge from it. His work is highly interdisciplinary, touching upon computer science, geography, philosophy, information science, and cognitive science, and ranges from very theoretical work that advance logic-based AI in the broadest sense to more domain specific work on modeling knowledge about hydrology, geology, glaciology, or environmental sciences.Current research projects include a $6M project on building an Urban Flooding Open Knowledge Network (UF-OKN), a $1.5M project “Safe Agriculture and Water Graph (SAWGraph)” integrating data on PFAS contamination both funded by NSF, and a USDA funded project on a knowledge graph (CelloGraph) for Cellulose Material Informatics. Another long-term project in collaboration with the Geological Survey of Canada focuses on formally capturing the semantics of different kinds of water features (e.g., lakes, river systems, aquifers, wells, etc.). He also leads the development of the macleod toolkit for automated reasoning on ontologies specified in Common Logic.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/hahmann-torsten/", "emails": ["torsten.hahmann@maine.edu"], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Associate Professor of Spatial Computing"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "3719a81d-e0a6-41f8-8ea2-6d2c30b845e7", "first_name": "Jon", "last_name": "Ippolito", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/jon-ippolito/", "emails": ["jippolito@maine.edu"], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Professor of New Media"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a9df70b3-b5e1-4e96-9199-9d35371c013e", "first_name": "Silvia", "last_name": "Nittel", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/nittel-silvia/", "emails": [], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Associate Professor of Spatial Computing"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b17c7b13-e7d3-4bbc-b2b8-ee94de723513", "first_name": "Nimesha", "last_name": "Ranasingh", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/ranasinghe-nimesha/", "emails": ["r.ranasinghe@maine.edu"], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Assistant Professor of Spatial Computing"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f6f277f7-f9cb-4f52-94d2-d8d6f4eb71c2", "first_name": "Manuel", "last_name": "Wörsdörfer", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": "https://www.researchgate.net/profile/Manuel_Woersdoerfer", "scraped_from": "https://mcec.umaine.edu/home/faculty222/manuel-woersdoerfer/", "emails": ["manuel.woersdoerfer@maine.edu"], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Associate Professor", "School of Computing and Information Science and Maine Business School"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e81a9768-0c16-42ea-b866-d64a893e2b1f", "first_name": "Zhangyu", "last_name": null, "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=8vNk5Z8AAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/zhangyu-wang/", "emails": [], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Assistant Professor of Spatial & Information Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0199ec3e-6f70-404e-b5e2-8615e4da7707", "first_name": "Zihan", "last_name": null, "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/zihan-wu/", "emails": [], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Assistant Professor of Human Centered Technology Design", "Spatial & Information Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "d26e9e12-d201-473e-adf1-3fbbeec9c893", "first_name": "Terry S.", "last_name": "Yoo", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/terry-yoo/", "emails": ["terry.yoo@maine.edu"], "phones": [], "departments": ["Computing and Information Science"], "titles": ["Associate Professor of Computer Science"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "72329d89-a084-4ce3-a356-44dc4fd43abf", "first_name": "Ah", "last_name": "Aboelezz", "biography": "Applied aerodynamicsDrones for harsh environmentFlight dynamics and control of UAVsWind energy systems and turbine performance optimizationBio-inspired design and its applications in aerospace engineering", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/ahmed-aboelezz/", "emails": ["ahmed.aboelezz@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Assistant Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "7cf9e7a6-9709-4eca-a394-1372ffec5da5", "first_name": "Vincent", "last_name": "Caccese", "biography": "Design, Testing and Analysis of Impact Attenuating MaterialsDesign and Monitoring Systems for Assistive DevicesStructural Testing, and Finite Element Analysis Computer ModelingDynamic Systems Modeling and TestingFatigue Response of Connections", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/vincent-caccese/", "emails": ["vincent.caccese@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a5667e11-ce61-4d61-a01d-0b7548d4c539", "first_name": "Wilhelm “Alex”", "last_name": "Friess", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": "http://www.researchgate.net/profile/Wilhelm_Friess", "scraped_from": "https://mcec.umaine.edu/home/faculty222/wilhelm-friess/", "emails": ["wilhelm.friess@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "006bf1f8-8da1-4a9c-bdb1-bc06d9e70190", "first_name": "Andrew J.", "last_name": "Goupee", "biography": "Floating offshore wind technologyNumerical methods in floating offshore structuresModel testing of floating offshore structures", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=8eXf1UEAAAAJ&hl=en", "research_gate_url": "https://www.researchgate.net/profile/Andrew_Goupee", "scraped_from": "https://mcec.umaine.edu/home/faculty222/andrew-goupee/", "emails": ["agoupe91@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Donald A. Grant Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a3ab34c7-2322-4f7b-a6e9-5ab390cf1ffa", "first_name": "Babak", "last_name": "Hejrati", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/babak-hejrati/", "emails": ["babak.hejrati@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Associate Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "80c47f5b-9d81-4d3b-9a72-e0983288d3e5", "first_name": "Senthil S.", "last_name": "Vel", "biography": "The following software tools are currently under development by my research group.", "orcid": null, "google_scholar_url": "https://web.archive.org/web/20240723210638/https://scholar.google.com/citations?hl=en&user=sJn8Ua4AAAAJ&view_op=list_works", "research_gate_url": "https://web.archive.org/web/20240723210638/https://www.researchgate.net/profile/Senthil_Vel4", "scraped_from": "https://mcec.umaine.edu/home/faculty222/senthil-vel/", "emails": ["senthil.vel@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Arthur O. Willey Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "1e3b1aa3-dcab-4c87-be27-206a5d57cd31", "first_name": "Kewei", "last_name": "Xu", "biography": "Bluff body (ships and vehicles) airwakesActive flow controlAircraft aerodynamicsWind turbineTurbomachinery and engine inlet", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/kewei-xu/", "emails": ["kewei.xu@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Assistant Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "3285e6d0-c0a3-41b9-b61f-5cfaf41e0a5a", "first_name": "Xiaoxiao", "last_name": "Zhao", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/xiaoxiao-zhao/", "emails": ["xiaoxiao.zhao@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Assistant Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "128dcf30-2f9e-46c4-9f48-958a38ba6a52", "first_name": "Richard", "last_name": "Kimball", "biography": "Offshore Wind Energy: Floating systems development and testingMarine diesel engine performance testing and emissions reduction researchLow emissions fuel developmentComputer design of propellers and turbinesTidal energy systems", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/richard-kimball/", "emails": ["richard.w.kimball@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Presidential Professor in Ocean Engineering and Energy"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b264a956-0c0d-4725-b019-b4abe1f4e4a7", "first_name": "Justin", "last_name": "Lapp", "biography": "Solar Thermal Energy and ThermochemistryNumerical Heat Transfer Modeling for High Temperature SystemsThermal RadiationMaterial Behavior Under Solar Thermal CyclingDetermination of Optical and Thermal Properties of Materials", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/justin-lapp/", "emails": ["justin.lapp@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Associate Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "12351068-db79-4112-89a3-ce6caf11bcd5", "first_name": "Philip", "last_name": "King", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/philip-king/", "emails": ["philip.king@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Assistant Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0655090b-a182-4c46-a293-ce878c33812f", "first_name": "Sharmila", "last_name": "Mukhopadhyay", "biography": "Multifunctional nanomaterials: design, synthesis, characterization and testingCompact lightweight components for energy, environment, and biomedical applicationsSurface and interface phenomena", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/sharmila-mukhopadhyay/", "emails": ["sharmila.mukhopadhyay@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Professor of Mechanical Engineering & FIRST Director"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "9b897485-df51-4715-9ce9-5f4fb8d63a7b", "first_name": "Amrit", "last_name": "Ver", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=aGCIiNAAAAAJ&hl=en&oi=sra", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/amrit-shankar-verma/", "emails": ["amrit.verma@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Assistant Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "61b22751-590b-477c-896d-1ec7cc560d2b", "first_name": "Sheila", "last_name": "Edalatpour", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/sheila-edalatpour/", "emails": ["sheila.edalatpour@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Libra Associate Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "707e63e4-ff72-4db5-985d-a4ad6e40778a", "first_name": "Zhihe", "last_name": "Jin", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/zhihe-jin/", "emails": ["zhihe.jin@maine.edu"], "phones": [], "departments": ["Mechanical Engineering"], "titles": ["Professor of Mechanical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b0b5d06e-84c9-4122-8c93-4b38d6be763e", "first_name": "John", "last_name": "Allen", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/john-allen/", "emails": ["john.w.allen@maine.edu"], "phones": [], "departments": ["Engineering Technology"], "titles": ["Professor", "Electrical Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2a24daca-6e61-4a4f-99e5-bf2a79332675", "first_name": "Keith", "last_name": "Berube", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/keith-berube/", "emails": ["keith.berube@maine.edu"], "phones": [], "departments": ["Engineering Technology"], "titles": ["Associate Professor", "Mechanical Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e9861894-0cb6-4edc-a304-6243cc392b06", "first_name": "Anne A.", "last_name": "Dunham", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/anne-dunham/", "emails": [], "phones": [], "departments": ["Engineering Technology"], "titles": ["Assistant Professor of Mechanical Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "63f30a9a-943f-4bad-a8c6-48e30f710262", "first_name": "Phil", "last_name": "Dunn", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/philip-dunn/", "emails": ["philip.dunnjr@maine.edu"], "phones": [], "departments": ["Engineering Technology"], "titles": ["Professor", "Construction Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f8a5c0ba-c252-4de8-9c5c-53e5f2e15f54", "first_name": "S. David", "last_name": "Dvorak", "biography": "Fuel cell applications using liquid renewable fuels, control of fuel cell power systems, high-temperature polymer electrolyte fuel cells, hydrogen production from renewable energy, innovative polymer electrolyte fuel cell membranes, renewable energy systems, and modeling of solid lubricants.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/s-david-dvorak/", "emails": ["Dvorak@maine.edu"], "phones": [], "departments": ["Engineering Technology"], "titles": ["Professor", "Mechanical Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ea4b4fe9-6699-438b-bace-7044b721be3f", "first_name": "Brett", "last_name": "Ellis", "biography": "Solid mechanics, material science, finite element analysis, design, failure analysis", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/brett-ellis/", "emails": ["brett.ellis@maine.edu"], "phones": [], "departments": ["Engineering Technology"], "titles": ["Professor & Coordinator", "Mechanical Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "3262e102-6ac9-49a8-801b-ac59d99f4a7f", "first_name": "Raymond", "last_name": "Hintz", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/raymond-hintz/", "emails": ["ray.hintz@maine.edu"], "phones": [], "departments": ["Engineering Technology"], "titles": ["Professional Land Surveyor", "Professor", "Surveying Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "24f4de06-5135-43f7-bd4a-aa7e05bdb3d5", "first_name": "Meredith", "last_name": "Kirkmann", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/meredith-kirkmann/", "emails": ["meredith.kirkmann@maine.edu"], "phones": [], "departments": ["Engineering Technology"], "titles": ["Associate Professor and Coordinator", "Construction Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "37118594-1c9c-4c9a-845b-d7e0a2c4bc71", "first_name": "Joseph", "last_name": "McNichols", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/joseph-mcnichols/", "emails": ["Joseph.McNichols@maine.edu"], "phones": [], "departments": ["Engineering Technology"], "titles": ["Professional Land Surveyor", "Assistant Professor", "Surveying Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2bc114ec-664e-4693-83bb-1e3826c304e8", "first_name": "Jude", "last_name": "Pearse", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/judith-pearse/", "emails": ["jpearse@maine.edu"], "phones": [], "departments": ["Engineering Technology"], "titles": ["Professor", "Electrical Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "7b4a50b4-c771-4792-a499-f028f51540ee", "first_name": "Paul", "last_name": "Villeneuve", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/paul-villeneuve/", "emails": ["paul.villeneuve@maine.edu"], "phones": [], "departments": ["Engineering Technology"], "titles": ["Professor", "Electrical Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "7e00ed26-ed39-4e51-811f-5bcdcd555c9f", "first_name": "Carlton", "last_name": "Brown", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/carleton-brown/", "emails": [], "phones": [], "departments": ["Engineering Technology"], "titles": ["Professional Land Surveyor", "Associate Professor of Surveying Engineering Technology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ef59214d-d2ff-42ed-9a39-17814df23fe3", "first_name": "Robert", "last_name": "Bowie", "biography": "Long Distance Medicine. Rural Medicine. Remote Search and Rescue. UAVs and sensor use in assessing and finding lost and missing persons. Telemedicine in Search and Rescue. Cold Injury Frostbite and Hypothermia.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/robert-bowie/", "emails": ["robert.bowie@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Professor of Practice"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "6c6ef021-e2ea-4a76-81f5-4fdd151e9382", "first_name": "Douglas W.", "last_name": "Bousfield", "biography": "Fluid mechanicsRheologyNumerical methodsCoating processes", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/douglas-bousfield/", "emails": ["bousfld@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Calder Professor", "Director of the Paper Surface Science Program"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2304f020-804a-4a4d-b06e-f08349c94e7a", "first_name": "William", "last_name": "DeSisto", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/william-desisto/", "emails": ["william.desisto@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "bfbcfc0e-1cd6-42cd-bdec-3a4940f032ab", "first_name": "Caitlin", "last_name": "Howell", "biography": "B.S. Biology, University of Maine, 2006M.S. Biology, University of Maine, 2008Ph.D. Physical Chemistry, University of Heidelberg, Germany, 2011Postdoc, Wyss Institute for Biologically Inspired Engineering, Harvard University, 2015", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=-hpjIEwAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/caitlin-howell/", "emails": ["caitlin.howell@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "945753be-557a-4fe2-b8cb-d20c564c6543", "first_name": "Andre", "last_name": "Khalil", "biography": "Please see the CompuMaine Lab webpage.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/andre-khalil/", "emails": ["andre.khalil@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Professor", "Director", "CompuMAINE Lab"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8560c0bc-9f39-43a2-a57e-99c79a03a18d", "first_name": "Michael D.", "last_name": "Mason", "biography": "Photophysics of nanoparticles and molecular nanoprobes • single molecule imaging • time-resolved single photon spectroscopic imaging techniques", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/michael-mason/", "emails": ["michael.mason@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Professor", "Biomedical Engineering Undergraduate Program Coordinator"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ae8ebe0c-1b71-482e-960c-4e7caf558ebd", "first_name": "Thomas J.", "last_name": "Schwartz", "biography": "Heterogeneous Catalysis • Reaction Kinetics • in situ and operando Spectroscopy • Biomass Conversion • Biorenewable Chemicals", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=Nr3lvKUAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/thomas-schwartz/", "emails": ["thomas.schwartz@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Associate Professor\nAssociate Director", "Forest Bioproducts Research Institute\nGraduate Program Coordinator"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "9a48e0b8-608e-4b50-8620-299e3ef03e7b", "first_name": "Karissa", "last_name": "Tilbury", "biography": "Extracellular Matrix Remodeling • Cellular Metabolism • Non-linear Microscopy Techniques: Second Harmonic Generation (SHG) Imaging Microscopy • Multiphoton Microscopy • STEM Education", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/karissa-tilbury/", "emails": ["karissa.tilbury@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Associate Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8d7e2045-b7cb-4131-b5ff-c7e0fd148c8b", "first_name": "G. Peter van", "last_name": "Walsum", "biography": "", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/gerard-van-walsum/", "emails": [], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Peter Van Walsum\nChair of Chemical and Biomedical Engineering; Professor of Chemical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "738a8420-c842-478a-8ddb-1c7eada9303c", "first_name": "Clay", "last_name": "Wheeler", "biography": "Biofuels and Catalysis Thermal conversion technologies for converting lignocellulosics to hydrocarbon fuels and chemicals Thermal deoxygenation of biomass-derived organic acids Hydrodeoxygenation of pyrolysis oils Hydrogenation of mixed ketones to mixed alcohols Esterification of mixed organic acids Hydrogenolysis of mixed esters Hydrotreating and fractionation for transportation fuels blend-stocks Process simulation and techno-economicsThermal conversion technologies for converting lignocellulosics to hydrocarbon fuels and chemicalsThermal deoxygenation of biomass-derived organic acidsHydrodeoxygenation of pyrolysis oilsHydrogenation of mixed ketones to mixed alcoholsEsterification of mixed organic acidsHydrogenolysis of mixed estersHydrotreating and fractionation for transportation fuels blend-stocksProcess simulation and techno-economics", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/clay-wheeler/", "emails": ["mcwheeler@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Professor\nDirector", "Forest Bioproducts Research Institute\nChemical Engineering Undergraduate Program Coordinator"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e7d6d95f-81e5-4355-9389-05e2610151a2", "first_name": "Evan K.", "last_name": "Wujcik", "biography": "Polymers | Composites| Advanced Materials| Stretchable Electronics | Conductive Polymers | Organic Mixed Ionic-Electronic Conductors | Self-Healing Polymers| Electrospinning | Electrohydrodynamics | Green Engineering | Environmental Engineering | Water Quality", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=73gy_vwAAAAJ&hl=en", "research_gate_url": "https://www.researchgate.net/profile/Evan-Wujcik", "scraped_from": "https://mcec.umaine.edu/home/faculty222/evan-wujcik/", "emails": ["Evan.Wujcik@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Associate Professor of Chemical Engineering"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "d4873bbc-7a39-4468-974f-255a5280fbdc", "first_name": "David J.", "last_name": "Neivandt", "biography": "Determination of the orientation and conformation of interfacial speciessurface spectroscopies/microscopies", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://mcec.umaine.edu/home/faculty222/david-neivandt/", "emails": ["david.neivandt@maine.edu"], "phones": [], "departments": ["Chemical and Biomedical Engineering"], "titles": ["Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0dcb67a7-a858-4191-a3d7-4073d16d3a37", "first_name": "Pankaj", "last_name": "Agrrawal", "biography": "A central theme of Dr. Agrrawal’s research is developing multi-constraint optimized long-short market-neutral hedged portfolios using ETF’s as primary assets and harvesting financial information on the web. Other research interests include the role of cognitive biases and heuristics in the decision making process as applied to the capital markets, stable covariance and correlation matrices on ETFs, and devising alpha-return techniques that utilize portfolio risk exposures to drive returns. Portfolio Optimization, Risk Management, Beta Neutral Hedging, Sentiment Estimation, Time series analysis, Liquidity modeling, Cointegration vectors, and Risk Parity portfolio strategies are some of his other active interests. Some of this research can be seen on his website at CorrectCharts.com .Since 2004, he has been tracking a multi-asset class ETF portfolio (long-short and long only) that he discusses with his undergrad and MBA students. It continues to outperform the broad market equity and bond indices on both the dimensions in the risk-return space. It was included as a research chapter in the book “The Most Important Concepts in Finance” published in 2017 . A proponent of Multi-asset investing using the 1/n approach, he uses the MV optimization approach to identify optimal allocations. In 2024 he began work in AI chatbot development and integration into his classes. He also works with Python to develop ML dataframes for financial analysis. Google Scholar . Developed two webApps for Finance:3D Returns App: https://returns-visualization.replit.app/.Total Returns, Dividends and AI Sentiment App: https://total-returns-dividends-market-sentiment.replit.app/", "orcid": "0000-0002-8617-433X", "google_scholar_url": "https://scholar.google.com/citations?user=omgy7uoAAAAJ&hl=en&oi=ao", "research_gate_url": "https://www.researchgate.net/profile/Pankaj_Agrrawal", "scraped_from": "https://umaine.edu/business/people/pankaj-agrrawal/", "emails": ["pankaj.agrrawal@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Professor of Finance and Nicolas M. Salgo Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ca1ded8c-d2b6-4038-8848-27b854025dda", "first_name": "Henri", "last_name": "Akono", "biography": "Executive compensationCapital market auditsCorporate governanceAnalysts forecasts and recommendations", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/henri-akono/", "emails": ["henri.akono@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Accounting"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "cfcd48cc-bcbd-441d-9d3b-a00134228d07", "first_name": "Tanya", "last_name": "Beaulieu", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/tanya-beaulieu/", "emails": ["tanya.beaulieu@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Management Information Systems"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "3170be7b-f55c-446d-bd14-35c2cf360f22", "first_name": "Erin Percival", "last_name": "Carter", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/erin-percival-carter/", "emails": ["erin.p.carter@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Marketing"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "dc90f591-9a0f-42aa-aa9b-5e8b00f74111", "first_name": "Muralee", "last_name": "Das", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/muralee-das/", "emails": ["muralee.das@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Management"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "d9056872-36b9-47cf-bbe1-a27d8bcc41df", "first_name": "Jason S.", "last_name": "Entsminger", "biography": "Entrepreneurial NetworksOrganizational Theory, particularly Organizational EvolutionEntrepreneurial Ecosystems, particularly rural enterprise development support structuresSectoral emphasis: food value chains (value addition before or beyond the farm gate)", "orcid": "0000-0001-6681-059X", "google_scholar_url": "https://scholar.google.ca/citations?user=XRq-YLEAAAAJ", "research_gate_url": "https://www.researchgate.net/profile/Jason-Entsminger", "scraped_from": "https://umaine.edu/business/people/jason-entsminger/", "emails": ["jason.entsminger@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Assistant Professor of Entrepreneurship & Innovation and Assistant Extension Professor and Small Business"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "46f55019-ae91-4e30-8125-0e1c7b434436", "first_name": "C. Matt", "last_name": "Graham", "biography": "Sentiment analysis focusing on public perceptions of AI-driven conversational agents like ChatGPT, Interactive marketing, business analytics, database design & development, SQL, SAP business analytics, and business applications of AI", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/c-matt-graham/", "emails": ["c.matt.graham@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Business Information Systems"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ecf2d659-c41e-47c9-9dcb-2e5fdbd42566", "first_name": "Jason", "last_name": "Harkins", "biography": "Jason has teaching and research interests related to the intersection of strategy, entrepreneurship, and small business management.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/jason-harkins/", "emails": ["jason.harkins@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Executive Dean", "MBS; Dean", "GSB; & Associate Professor of Entrepreneurship"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b67800f4-37d4-4fe1-9b0c-3a1148c42c13", "first_name": "Xinhui “Gabe”", "last_name": "Huang", "biography": "Corporate FinanceEconomic Policy AnalysisCorporate GovernanceFinancial Accounting", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/xinhui-gabe-huang/", "emails": ["xinhui.huang@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Assistant Professor of Finance"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "d520119c-c313-48f7-b463-5cc0137224a0", "first_name": "Nory", "last_name": "Jones", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/nory-jones/", "emails": ["njones@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Professor of Business Information Systems"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "6bd6f6f4-9ada-4eb9-8166-12e92cba2695", "first_name": "Daehyun", "last_name": "Kim", "biography": "Corporate GovernanceBoard of DirectorsShareholder ControlEnvironmental, Social, and Governance", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/daehyun-kim/", "emails": ["daehyun.kim@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Assistant Professor of Accounting"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "1ebfe731-397e-4594-9589-e8867dac1884", "first_name": "Nadège", "last_name": "Levallet", "biography": "Organizational improvisation capabilityDigital strategyDigital innovationDynamic capabilities and digital capabilitiesSmall and medium organizationsQualitative comparative analysis", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/nadege-levallet/", "emails": ["nadege.levallet@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Management and Information Systems"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "62a70938-e30c-4571-8184-df5ed3d7b9b7", "first_name": "Sebastian", "last_name": "Lobe", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=Xwy9pQ8AAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/sebastian-lobe/", "emails": ["sebastian.lobe@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["University Foundation Professor of Investment Education"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8f8e391b-2c35-4e91-baa2-7451c422e27a", "first_name": "Yonggang “Tim”", "last_name": "Lu", "biography": "Dr. Lu’s general area of research is data information modeling and knowledge learning in support of business decision making. His primary research interest is on TREE (Transparent, Reliable, Efficient and Effective) Bayesian analytic models for data information processing. He is especially interested in general-purpose Bayesian inference algorithms for regularizing machine and statistical learning models with subjective prior knowledge. His secondary research interest is in social network analysis for understanding online information diffusion.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/yonggang-tim-lu/", "emails": ["yonggang.lu@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Harold Alfond Associate Professor of Business Analytics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "b2695e58-a5b8-4053-8b68-ea5d5889106e", "first_name": "Ivan", "last_name": "Mane v", "biography": "Scholarly articles in leading journals in international business and entrepreneurship on:The multinational enterprise as a networkManagement in the transitional economies of Central and Eastern Europe, Russia, and ChinaEntrepreneurship in transitional economiesCross-cultural leadership", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/ivan-manev/", "emails": ["imanev@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["John M. Murphy Professor of Management"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e761dd35-660c-4d53-91ba-cff9b0a04b36", "first_name": "Dmitri", "last_name": "Markovitch", "biography": "New product commercialization strategies and their performance impactMarketing-finance interface. In particular, I investigate the impact of marketing decisions on firm market value, and stock returns as a feedback mechanism for marketing decisionsManagerial decision making under uncertainty, including cognitive biases, search, and information useThe impact of artificial intelligence on customer outcomes", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/dmitri-markovitch/", "emails": ["dmitri.markovitch@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Marketing"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "28380a13-8eea-4378-b92e-262731e68999", "first_name": "Grant", "last_name": "Miles", "biography": "Dr. Miles’ research interests focus on the role of knowledge, learning, and collaboration in the process of organizational innovation and adaptation. Much of this work is centered on new ways of organizing with a particular emphasis on how companies can work together to create sustainable innovation.", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/grant-miles/", "emails": ["grant.miles@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Management"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "5a845067-067f-488e-9635-c5fafe4f6c0b", "first_name": "Patti", "last_name": "Miles", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/patti-miles/", "emails": ["patti.miles@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Dean of Business and Professor of Management"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c838dc95-9b07-475b-b831-c9d16914cab6", "first_name": "Susan", "last_name": "Myrden", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": "https://www.researchgate.net/publication/228149778_Enhancing_Governmentally_Sponsored_Export_Promotions_through_Better_Segmentation_of_the_Market_of_a_State's_Manufacturing_Concerns", "scraped_from": "https://umaine.edu/business/people/susan-myrden/", "emails": ["susan.myrden@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Professor of Marketing and Dennis McConnell Professor of Business"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "977fab7e-876d-49b1-8298-5fe9b94e081e", "first_name": "Billy", "last_name": "Obenauer", "biography": "Contextual distinctions that influence racial and gender discrimination in organizations, as well as other outcomes related to diversity in the workplaceRecognition of actionable steps that can reduce discrimination and support efforts towards inclusion and equitable outcomes in the workplaceThe evaluation of research methodology with a focus on discovering previously unidentified nuances that enhance the knowledge gleaned from prior research", "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=6pO76ZQAAAAJ&hl=en&oi=ao", "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/billy-obenauer-ph-d/", "emails": ["william.obenauer@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Management"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "6a356bc3-fc5b-46a2-9da1-ef44d0751249", "first_name": "Alexandru V.", "last_name": "Roman", "biography": "Strategic ManagementHuman Capital Resources ManagementFirm Behavior", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/alexandru-roman/", "emails": ["alexandru.roman@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Assistant Professor of Strategic Management"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ed3e84b1-1d2f-4a1b-af46-0a6dc1a53b71", "first_name": "Rusty", "last_name": "Stough", "biography": "Consumer Psychology, Neurobiology of Attention, Experiential Satisfaction, Access-Based Consumption, Television Advertising", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/rusty-stough/", "emails": ["rusty.stough@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Marketing"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "28ef2c55-ad04-469e-8c1f-f9f191de2dae", "first_name": "Lizao", "last_name": "Zhang", "biography": "Revenue Management Inventory Management Supply Chain Management Healthcare Operations Management", "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/lizao-zhang/", "emails": ["lizao.zhang@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Assistant Professor of Operations Management"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ce186e0a-b1b1-4d95-9ea1-1dfc49add052", "first_name": "Qiujie “Angie”", "last_name": "Zheng", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/business/people/qiujie-angie-zheng/", "emails": ["qiujie.zheng@maine.edu"], "phones": [], "departments": ["Business"], "titles": ["Associate Professor of Business Analytics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "786ecf7c-d3e8-4fd6-8858-1b0f8748d5cf", "first_name": "Andrei", "last_name": "Alyokhin", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=871", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Professor of Applied Entomology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f5f5fbcd-4ab2-44f7-8d17-eb26f78f929f", "first_name": "Seanna L.", "last_name": "Annis", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/annis", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Director of SBE / Professor of Mycology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "18282a8e-f7c8-4a0d-85ef-75c3af4f3fe1", "first_name": "Peter", "last_name": "Avis", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/peter-avis/", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Assistant Professor in Ecosystem Genetics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "cfb2a3c8-69a3-40f0-821c-fde006b944ac", "first_name": "Matthew", "last_name": "Chatfield", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/matthew-chatfield/", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Evolution and Eco-Health"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "90c3fc00-8735-4281-b87c-23a27006e0fe", "first_name": "Jacquelyn", "last_name": "Gill", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=2242", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Professor of Paleoecology & Plant Ecology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "30d6b0cc-3b2b-4f94-b0be-611c2218c793", "first_name": "Erin", "last_name": "Grey", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=bDTFiRcAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/erin-grey/", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Aquatic Genetics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "4650373a-94f8-458b-92be-7110d526499b", "first_name": "Leonard J.", "last_name": "Kass", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=921", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Biological Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "3d5402f0-cacc-4f7d-88d8-c656f46581c2", "first_name": "Michael T.", "last_name": "Kinnison", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=928", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Professor of Evolutionary Applications"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a5bd9ebc-d620-45a4-b3f5-183bdb4e6abd", "first_name": "Amanda", "last_name": "Klemmer", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/amanda-klemmer/", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Landscape Ecology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "57c3bcef-d615-4e22-97d8-ea80648fa430", "first_name": "Danielle L.", "last_name": "Levesque", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=4714", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Mammalogy and Mammalian Health"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ec005053-97b0-4d29-b645-cec6a3a9e700", "first_name": "Joyce E.", "last_name": "Longcore", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=932", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Research Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "1747ca2c-5d37-4072-b6b5-fc6b32db4ea5", "first_name": "Brian", "last_name": "McGill", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=934", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Professor of Biological Sciences", "joint appointment Sustainability Solutions Initiative"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "89c1f955-ffce-40a8-9715-6e9dd41aff94", "first_name": "Angela", "last_name": "Mech", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?hl=en&user=VKfye64AAAAJ", "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/angela-mech/", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Forest Entomology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ac04d786-93ac-4d11-91e9-4302e740ac78", "first_name": "José Eduar", "last_name": "Meireles", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/meireles", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Plant Evolution and Systematics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "ae1589ca-dfe0-4674-85f9-2a777d78d656", "first_name": "Brian", "last_name": "Olsen", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=950", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Professor of Ornithology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "6e88c2cf-6f7b-47a3-a696-7fd021f4c75a", "first_name": "Jasmine E.", "last_name": "Saros", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=937", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Professor of Paleoecology and Biological Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "48df4e6e-7640-4496-86b4-a2b040d4058a", "first_name": "Ek Han", "last_name": "Tan", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/tan/", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Plant Genetics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f19761b6-a759-4093-a266-861745f83939", "first_name": "Jianjun", "last_name": "Hao", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/hao", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Plant Pathology", "School of Food and Agriculture"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "557fd5b6-04c9-441c-9377-e728ecefa470", "first_name": "David D.", "last_name": "Hart", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=907", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Director", "George J. Mitchell Center/Professor of Biological Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c86146a4-3136-455c-9973-ee6f68e6bfb7", "first_name": "David", "last_name": "Hiebeler", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=959", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Professor of Mathematics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "95fedfcb-a765-4c67-ab9b-7f1fa96dd941", "first_name": "Anne", "last_name": "Lichtenwalner", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "http://sbe.umaine.edu/lichtenwalner", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Animal and Veterinary Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "c1c04a67-578b-4fd3-b011-c73b4ab98b01", "first_name": "Sara", "last_name": "Lindsay", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=4762", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Marine Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "fe81a4ae-8e34-421f-878b-02145150f62b", "first_name": "William H.", "last_name": "Livingston", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=4765", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Forest Resources"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "95e1da65-6d39-4799-84e3-3f6b129f8a2c", "first_name": "Paul", "last_name": "Rawson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=4768", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Marine Sciences"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "2c6102d6-0671-4385-9692-fa8cc191de77", "first_name": "Kristy", "last_name": "Townsend", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/townsend/", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Adjunct Faculty at UMaine; Associate Professor at The Ohio State", "Wexner Medical Center"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "332b4424-19ec-4b1e-aed0-ec98d094a414", "first_name": "Tim", "last_name": "Waring", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/tim-waring/", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Professor of Applied Cultural Evolution"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "62668315-aba5-43ab-8e70-b76823f97e6a", "first_name": "Ann", "last_name": "Dieffenbacher-Krall", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/dieffenbacher-krall", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Associate Director and Cooperating Professor (Retired)"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "71664841-cc82-4050-b9d9-684027e92b78", "first_name": "Stellos", "last_name": "Tavantzis", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://sbe.umaine.edu/?p=943", "emails": [], "phones": [], "departments": ["Biology and Ecology"], "titles": ["Professor of Plant Pathology and Cooperating Professor of Biochemistry and Microbiology"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e58a7aef-efe6-449e-866e-ba2040c83ee7", "first_name": "R. Dean", "last_name": "Astumian", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "http://physics.umaine.edu/r-dean-astumian/", "emails": ["astumian@maine.edu"], "phones": [], "departments": ["Physics and Astronomy"], "titles": ["Professor of Physics"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "a561630a-7463-4aba-9174-661b79624c91", "first_name": "Nicholas", "last_name": "Bingham", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://physics.umaine.edu/people/nicholas-bingham/%20", "emails": ["nicholas.bingham@maine.edu"], "phones": [], "departments": ["Physics and Astronomy"], "titles": ["Assistant Professor of Physics Member", "FIRST"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "74c82ebd-831d-4b0e-ad26-8d1d890d7f28", "first_name": "Ioan-Augustin", "last_name": "Chioar", "biography": null, "orcid": "0000-0001-5169-2690", "google_scholar_url": "https://scholar.google.se/citations?user=brVyg4EAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://physics.umaine.edu/?post_type=um_people&p=6800&preview=true", "emails": ["ioanaugustin.chioar@maine.edu"], "phones": [], "departments": ["Physics and Astronomy"], "titles": ["Assistant Professor of Physics Member", "FIRST"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "52d62b88-4805-44bf-8c8e-4173f2d10356", "first_name": "Dinh Loc", "last_name": "Duong", "biography": null, "orcid": "0000-0002-4118-9589", "google_scholar_url": "https://scholar.google.com/citations?user=zxLR748AAAAJ", "research_gate_url": null, "scraped_from": "https://physics.umaine.edu/?post_type=um_people&p=6797&preview=true", "emails": ["dinh.duong@maine.edu"], "phones": [], "departments": ["Physics and Astronomy"], "titles": ["Assistant Professor of Physics Member", "FIRST"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "4d17eb8d-ac96-4d32-99e8-fa93780a8df4", "first_name": "Joel", "last_name": "Anderson", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/joel-anderson/", "emails": ["joel.anderson@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Associate Professor of History"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "e2bbb89a-5dcb-4c80-a61a-1ca2691953ce", "first_name": "Samuel", "last_name": "Backer", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/samuel-backer/", "emails": ["samuel.backer@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Assistant Professor of History"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "3c1ffe15-e7e9-4851-bca9-ede6b38dd21d", "first_name": "Mary T.", "last_name": "Freeman", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/dr-mary-t-freeman/", "emails": ["mary.t.freeman@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Associate Professor of New England History"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8d6c0898-d05e-4c07-908d-3afdf28b19f3", "first_name": "Michael", "last_name": "Lang", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/michael-lang/", "emails": ["lang@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Associate Professor of History"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "48c2cd1c-9821-476d-a687-fd7b66bbf582", "first_name": "Mark J.", "last_name": "McLaughlin", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/mark-j-mclaughlin", "emails": ["mark.j.mcLaughlin@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Associate Professor of History and Canadian Studies; Graduate Coordinator"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "cde1aebc-5e11-4098-92ed-defe16b4cdf1", "first_name": "Stephen M.", "last_name": "Miller", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/stephen-m-miller/", "emails": ["stephen.miller@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Colonel James C. McBride Distinguished Professor"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "bfd23b29-432c-49e4-9104-8480b56cac17", "first_name": "Gabriel", "last_name": "Paquette", "biography": null, "orcid": null, "google_scholar_url": "https://scholar.google.com/citations?user=ol_T8CkAAAAJ&hl=en", "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/gabriel-paquette/", "emails": ["gabriel.paquette@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Interim Executive Vice President for Academic Affairs and Provost; Adelaide C. and Alan L. Bird Professor of History"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8282ed3c-aa38-4675-b90d-419974036549", "first_name": "Micah", "last_name": "Pawling", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/dr-micah-pawling/", "emails": ["micah.pawling@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Associate Professor of History and Native American Studies"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "8a52d76e-d047-496f-b81b-ac1455aa6f84", "first_name": "Kara A.", "last_name": "Peruccio", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/kara-a-peruccio/", "emails": [], "phones": [], "departments": ["History"], "titles": ["Assistant Professor of Women’s", "Gender", "& Sexuality Studies and History"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "7437bb91-0c4a-42bc-b28d-9cb2222948e7", "first_name": "Liam", "last_name": "Riordan", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/dr-liam-riordan/", "emails": ["riordan@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Adelaide C. and Alan L. Bird Professor of History and Department Chair"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "0a319a7a-ffb2-4b13-868c-f007564a71b0", "first_name": "Daniel S.", "last_name": "Soucier", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/daniel-s-soucier/", "emails": ["daniel.s.soucier@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Research Assistant Professor of History"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "f83a8ad0-ceb8-4de5-b153-516d462ff18d", "first_name": "Rebecca", "last_name": "White", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/dr-rebecca-white/", "emails": ["Rebecca.White1@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Assistant Professor of History", "University of Maine at Augusta"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
{"faculty_id": "05fc4a54-58dd-4a03-babf-8cd84c6bc287", "first_name": "Nathan", "last_name": "Godfried", "biography": null, "orcid": null, "google_scholar_url": null, "research_gate_url": null, "scraped_from": "https://umaine.edu/history/people/nathan-godfried/", "emails": ["godfried@maine.edu"], "phones": [], "departments": ["History"], "titles": ["Professor of History"], "institution_name": "University of Maine", "start_date": "2025-12-06", "end_date": null}
